{
    "Name": "ACQAD",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/acqad_multihop,https://hf.co/datasets/arbml/acqad_comparison",
    "Link": "https://www.kaggle.com/datasets/abdellahhamouda/acqad-dataset",
    "License": "unknown",
    "Year": 2022,
    "Language": "ar",
    "Dialect": "Modern Standard Arabic",
    "Domain": [
        "wikipedia"
    ],
    "Form": "text",
    "Collection Style": [
        "crawling"
    ],
    "Description": "ACQAD, contains more than 118k questions, covering both comparison and multi-hop types. Each question-answer pair is decomposed into a set of single-hop questions, allowing QA systems to reduce question complexity and explain the reasoning steps.",
    "Volume": 118841.0,
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": [
        "EMP Algeria",
        "LORIA France"
    ],
    "Derived From": [],
    "Paper Title": "ACQAD: A Dataset for Arabic Complex Question Answering",
    "Paper Link": "https://hal.science/hal-03992129v1/preview/ICCSAITCS_2022_paper_9032.pdf",
    "Script": "Arab-Latin",
    "Tokenized": false,
    "Host": "kaggle",
    "Access": "Free",
    "Cost": "0",
    "Test Split": false,
    "Tasks": [
        "question answering"
    ],
    "Venue Title": "ICCSAITCS",
    "Venue Type": "conference",
    "Venue Name": ". International Conference on Cyber Security, Artificial Intelligence and Theoretical Computer Science",
    "Authors": [
        "Abdellah HAMOUDA SIDHOUM",
        "M'Hamed MATAOUI",
        "Faouzi SEBBAk",
        "Kamel SMAILI"
    ],
    "Affiliations": [
        "EMP Algeria",
        "LORIA France"
    ],
    "Abstract": "In this paper, we tackle the problem of Arabic complex Question Answering (QA), where models are required to reason over multiple documents to find the answer. Indeed, no Arabic dataset is available for this type of questions. To fill this lack, we propose a new approach to\nautomatically generate a dataset for Arabic complex question answering task. The proposed approach is based on using an effective workflow with a set of templates. The generated dataset, denoted as ACQAD, contains more than 118k questions, covering both comparison and multi-hop types. Each question-answer pair is decomposed into a set of single-hop\nquestions, allowing QA systems to reduce question complexity and explain the reasoning steps. We then provide a statistical analysis of the produced dataset. Afterwards, we will make the corpus available to the international community.",
    "Added By": "Abdellah HAMOUDA SIDHOUM"
}