{
    "Name": "ADI-5",
    "Subsets": [
        {
            "Name": "Egyptian",
            "Dialect": "Egypt",
            "Volume": 14.4,
            "Unit": "hours"
        },
        {
            "Name": "Gulf",
            "Dialect": "Gulf",
            "Volume": 14.1,
            "Unit": "hours"
        },
        {
            "Name": "Levantine",
            "Dialect": "Levant",
            "Volume": 14.3,
            "Unit": "hours"
        },
        {
            "Name": "MSA",
            "Dialect": "Modern Standard Arabic",
            "Volume": 14.3,
            "Unit": "hours"
        },
        {
            "Name": "North African",
            "Dialect": "North Africa",
            "Volume": 14.6,
            "Unit": "hours"
        }
    ],
    "HF Link": "https://huggingface.co/datasets/ArabicSpeech/MGB-3",
    "Link": "https://huggingface.co/datasets/ArabicSpeech/MGB-3",
    "License": "unknown",
    "Year": 2016,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": [
        "other"
    ],
    "Form": "audio",
    "Collection Style": [
        "crawling"
    ],
    "Description": "This will be divided across the five major Arabic dialects; Egyptian (EGY), Levantine (LAV), Gulf (GLF), North African (NOR), and Modern Standard Arabic (MSA)",
    "Volume": 50.0,
    "Unit": "hours",
    "Ethical Risks": "Low",
    "Provider": [
        "QCRI"
    ],
    "Derived From": [],
    "Paper Title": "Automatic Dialect Detection in Arabic Broadcast Speech",
    "Paper Link": "https://arxiv.org/pdf/1509.06928.pdf",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "HuggingFace",
    "Access": "Upon-Request",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "dialect identification"
    ],
    "Venue Title": "Interspeech",
    "Venue Type": "conference",
    "Venue Name": "Conference of the International Speech Communication Association",
    "Authors": [
        "Ahmed Ali",
        "Najim Dehak",
        "Patrick Cardinal",
        "Sameer Khurana",
        "Sree Harsha Yella",
        "James Glass",
        "Peter Bell",
        "Steve Renals"
    ],
    "Affiliations": [
        "Qatar Computing Research Institute, HBKU, Doha, Qatar",
        "MIT Computer Science and Artificial Intelligence Laboratory (CSAIL), Cambridge, MA, USA",
        "JHU Center for Language and Speech Processing (CLSP), Baltimore, MD, USA",
        "École de technologie supérieure, Département de Génie Logiciel et des TI, Montréal, Canada",
        "Centre for Speech Technology Research, University of Edinburgh, UK"
    ],
    "Abstract": "We investigate different approaches for dialect identification in Arabic broadcast speech, using phonetic, lexical features obtained from a speech recognition system, and acoustic features using the i-vector framework. We studied both generative and discriminate classifiers, and we combined these features using a multi-class Support Vector Machine (SVM). We validated our results on an Arabic/English language identification task, with an accuracy of 100%. We used these features in a binary classifier to discriminate between Modern Standard Arabic (MSA) and Dialectal Arabic, with an accuracy of 100%. We further report results using the proposed method to discriminate between the five most widely used dialects of Arabic: namely Egyptian, Gulf, Levantine, North African, and MSA, with an accuracy of 52%. We discuss dialect identification errors in the context of dialect code-switching between Dialectal Arabic and MSA, and compare the error pattern between manually labeled data, and the output from our classifier. We also release the train and test data as standard corpus for dialect identification.",
    "Added By": ""
}