{
    "Name": "AGS",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/FahdSeddik/AGS-Corpus",
    "Link": "https://hf.co/datasets/FahdSeddik/AGS-Corpus",
    "License": "CC BY-NC 4.0",
    "Year": 2023,
    "Language": "ar",
    "Dialect": "Modern Standard Arabic",
    "Domain": "other",
    "Form": "text",
    "Collection Style": "other",
    "Description": "AGS is the first publicly accessible abstractive summarization dataset for Arabic. It consists of 142,000 pairs of articles and summaries, all written in Modern Standard Arabic (MSA). The summaries are generated using GPT-3.5 Turbo, a large language model, through meticulous prompt engineering. The dataset covers a wide range of topics, such as politics, sports, culture, science, and technology.",
    "Volume": "142,000",
    "Unit": "documents",
    "Ethical Risks": "Low",
    "Provider": "",
    "Derived From": "",
    "Paper Title": "AGS: Arabic GPT Summarization Corpus",
    "Paper Link": "https://ieeexplore.ieee.org/abstract/document/10441794",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "HuggingFace",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "summarization",
    "Venue Title": "ICECCE",
    "Citations": "",
    "Venue Type": "conference",
    "Venue Name": "International Conference on Electrical, Communication and Computer Engineering ",
    "Authors": "Abdelrahman Atef, Fahd Seddik, Abdulrahman Elbedewy",
    "Affiliations": "",
    "Abstract": "This paper presents a novel method for abstractive summarization of Arabic text using a large-language model (LLM), GPT-3.5 Turbo. We introduce AGS, the first publicly available dataset consisting of 142,000 pairs of articles and summaries with an average compression ratio of 70% written in Modern Standard Arabic (MSA) generated by an LLM. We proposed a baseline model that achieves high scores on ROUGEL, similarity score, and compression ratio, while capturing the main points and details of the original articles. We fine-tuned mT5 on our dataset reaching a compression ratio of 62%, and similarity score of 82.65%. We release the AGS dataset to the research community, hoping to advance the field of Arabic natural language processing (NLP) and facilitate the development of effective abstractive summarization systems for Arabic text.",
    "Added By": "Zaid Alyafeai"
}