{
    "Name": "AIRABIC",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://github.com/Hamed1Hamed/AIRABIC",
    "License": "CC BY 4.0",
    "Year": 2023,
    "Language": "ar",
    "Dialect": "Modern Standard Arabic",
    "Domain": [
        "books",
        "news articles"
    ],
    "Form": "text",
    "Collection Style": [
        "LLM generated"
    ],
    "Description": "Arabic benchmark dataset for evaluating AI-generated text detectors, containing 500 human-written and 500 AI-generated passages with and without diacritics.",
    "Volume": 1000.0,
    "Unit": "documents",
    "Ethical Risks": "Low",
    "Provider": [
        "University of Bridgeport"
    ],
    "Derived From": [],
    "Paper Title": "AIRABIC: Arabic Dataset for Performance Evaluation of AI Detectors",
    "Paper Link": "https://ieeexplore.ieee.org/abstract/document/10459781",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "AI-generated text detection"
    ],
    "Venue Title": "ICMLA",
    "Venue Type": "conference",
    "Venue Name": "International Conference on Machine Learning and Applications",
    "Authors": [
        "Hamed Alshammari",
        "Ahmed El-Sayed"
    ],
    "Affiliations": [
        "University of Bridgeport"
    ],
    "Abstract": "In the rapid expansion of Large Language Models\n(LLMs), such as ChatGPT, AI-generated text detection models\nhave made substantial advancements, marking meaningful\nprogress in several research and industrial applications.\nHowever, the performance of these models in the Semitic\nlanguages’ context, especially regarding diacritic usage,\ncontinues to be inadequately explored. One of these Semitic\nlanguages that is still commonly used is Arabic language. To\nstudy the performance of the recent AI-generated text detection\nmodels on the Arabic language, this paper introduces the\nAIRABIC dataset, a combination of 1000 examples\nencompassing 500 human-written passages from 41 unique\nsources and an equal number of AI-generated texts from the\nOpenAI’s Generative Pre-trained Transformer version 3.5\n(GPT-3.5 Turbo ChatGPT). This study focuses on the\nperformance evaluation of two prominent AI-generated text\ndetectors, GPTZero and OpenAI's Text Classifier. Our findings\nreveal that GPTZero achieves an overall accuracy rate of\n62.6%, while the OpenAI Text Classifier exhibits a 50% rate of\nbiased categorizations when analyzing human-written text.\nFurther analysis shows the design gaps of these detectors,\nespecially for identifying human-written Arabic text, mainly\nwhen diacritics are involved. The detection accuracy for human-\nwritten texts with diacritics is as low as 30% for GPTZero and\n0% for the OpenAI Text Classifier. Results also show the\npotential of diacritics to reduce the detectors’ accuracy and the",
    "Added By": "Zaid Alyafeai"
}