{
    "Name": "AJGT",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/komari6/ajgt_twitter_ar",
    "Link": "https://github.com/komari6/Arabic-twitter-corpus-AJGT",
    "License": "unknown",
    "Year": 2017,
    "Language": "ar",
    "Dialect": "Jordan",
    "Domain": "social media",
    "Form": "text",
    "Collection Style": "crawling,annotation",
    "Description": "Corpus consisted of 1,800 tweets annotated as positive and negative. Modern Standard Arabic (MSA) or Jordanian dialect.",
    "Volume": "1,800",
    "Unit": "sentences",
    "Ethical Risks": "Medium",
    "Provider": "Multiple Institutions ",
    "Derived From": "",
    "Paper Title": "Arabic Tweets Sentimental Analysis Using Machine Learning",
    "Paper Link": "https://link.springer.com/chapter/10.1007/978-3-319-60042-0_66",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "sentiment analysis",
    "Venue Title": "IEA/AIE",
    "Citations": "53.0",
    "Venue Type": "conference",
    "Venue Name": "International Conference on Industrial, Engineering and Other Applications of Applied Intelligent Systems",
    "Authors": "K. Alomari,H. M. Elsherif,K. Shaalan",
    "Affiliations": ",,",
    "Abstract": "The continuous rapid growth of electronic Arabic contents in social media channels and in Twitter particularly poses an opportunity for opinion mining research. Nevertheless, it is hindered by either the lack of sentimental analysis resources or Arabic language text analysis challenges. This study introduces an Arabic Jordanian twitter corpus where Tweets are annotated as either positive or negative. It investigates different supervised machine learning sentiment analysis approaches when applied to Arabic user’s social media of general subjects that are found in either Modern Standard Arabic (MSA) or Jordanian dialect. Experiments are conducted to evaluate the use of different weight schemes, stemming and N-grams terms techniques and scenarios. The experimental results provide the best scenario for each classifier and indicate that SVM classifier using term frequency–inverse document frequency (TF-IDF) weighting scheme with stemming through Bigrams feature outperforms the Naive Bayesian classifier best scenario performance results. Furthermore, this study results outperformed other results from comparable related work.",
    "Added By": ""
}