{
    "Name": "ALHD",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://doi.org/10.5281/zenodo.17249602",
    "License": "CC BY-NC 4.0",
    "Year": 2025,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": [
        "public datasets",
        "LLM"
    ],
    "Form": "text",
    "Collection Style": [
        "crawling",
        "LLM generated"
    ],
    "Description": "A large-scale Arabic dataset for detecting human vs LLM-generated texts, with 405k samples across 3 genres (news, social media, reviews) and MSA + multiple dialects.",
    "Volume": 405456.0,
    "Unit": "documents",
    "Ethical Risks": "High",
    "Provider": [
        "Queen Mary University of London"
    ],
    "Derived From": [
        "SANAD",
        "ANAD",
        "MDAT",
        "MASC",
        "HARD",
        "BRAD"
    ],
    "Paper Title": "ALHD: A Large-Scale and Multigenre Benchmark Dataset for Arabic LLM-Generated Text Detection",
    "Paper Link": "https://arxiv.org/pdf/2510.03502",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "zenodo",
    "Access": "Free",
    "Cost": "",
    "Test Split": true,
    "Tasks": [
        "other"
    ],
    "Venue Title": "Information Sciences",
    "Venue Type": "preprint",
    "Venue Name": "Information Sciences",
    "Authors": [
        "Ali Khairallah",
        "Arkaitz Zubiaga"
    ],
    "Affiliations": [
        "Queen Mary University of London"
    ],
    "Abstract": "We introduce ALHD, the first large-scale comprehensive Arabic dataset explicitly designed to distinguish between human- and LLM-generated texts. ALHD spans three genres (news, social media, reviews), covering both MSA and dialectal Arabic, and contains over 400K balanced samples generated by three leading LLMs and originated from multiple human sources, which enables studying generalizability in Arabic LLM-genearted text detection. We provide rigorous preprocessing, rich annotations, and standardized balanced splits to support reproducibility. In addition, we present, analyze and discuss benchmark experiments using our new dataset, in turn identifying gaps and proposing future research directions. Benchmarking across traditional classifiers, BERT-based models, and LLMs (zero-shot and few-shot) demonstrates that fine-tuned BERT models achieve competitive performance, outperforming LLM-based models. Results are however not always consistent, as we observe challenges when generalizing across genres; indeed, models struggle to generalize when they need to deal with unseen patterns in cross-genre settings, and these challenges are particularly prominent when dealing with news articles, where LLM-generated texts resemble human texts in style, which opens up avenues for future research. ALHD establishes a foundation for research related to Arabic LLM-detection and mitigating risks of misinformation, academic dishonesty, and cyber threats.",
    "Added By": "Zaid Alyafeai"
}