{
    "Name": "ALR: Arabic Laptop Reviews dataset",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://github.com/bashartalafha/Arabic-Laptop-Reviews-ALR-Dataset",
    "License": "unknown",
    "Year": 2017,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": "reviews",
    "Form": "text",
    "Collection Style": "crawling",
    "Description": "Arabic  Laptops Reviews  (ALR) dataset focuses on laptops reviews written in Arabic",
    "Volume": "1,753",
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": "Jordan University of Science and Technology, Al-Balqa' Applied UniversityAl-Buraimi University College, Texas A&M University-San Antonio",
    "Derived From": "",
    "Paper Title": "Aspect-Based Sentiment Analysis of Arabic Laptop Reviews",
    "Paper Link": "https://www.researchgate.net/publication/329557366_Aspect-Based_Sentiment_Analysis_of_Arabic_Laptop_Reviews",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "sentiment analysis",
    "Venue Title": "ACIT",
    "Citations": "1.0",
    "Venue Type": "conference",
    "Venue Name": "international Arab Conference on Information Technology",
    "Authors": "Mahmoud Al-Ayyoub, Amal Gigieh, Areej Al-Qwaqenah, Mohammed N. Al-Kabi, Bashar Talafhah, Izzat Alsmadi",
    "Affiliations": "Jordan University of Science and Technology, Al-Balqa' Applied UniversityAl-Buraimi University College, Texas A&M University-San Antonio",
    "Abstract": "Sentiment Analysis  (SA) is one of the hottest research areas in Natural Language Processing (NLP) with  vast commercial as well as academic applications. One of the most interesting versions of SA is called Aspect-Based SA (ABSA). Currently, most of the researchers focus on English text. Other languages such as Arabic have received less attention. To the best of our knowledge, only few papers have addressed ABSA of Arabic reviews and they have all been applied on only three datasets. In  this work, we demonstrate  our efforts  to build  the Arabic  Laptops Reviews  (ALR) dataset,  which focuses on laptops reviews written in Arabic. To make it easy to use, the ALR dataset is prepared according to the annotation scheme of SemEval16-Task5. The annotation scheme considers two problems: aspect category prediction and sentiment polarity label prediction. It also comes with an evaluation procedure that extracts n-grams’ features and employs a Support Vector Machine (SVM) classifier in order to allow researchers to gauge and compare the performance of their systems. The evaluation results show that there is a lot of room for improvements in the performance of the SVM classifier for the aspect category prediction problem. As for the sentiment polarity label prediction, SVM’s accuracy is actually high.",
    "Added By": "Wafaa Mohammed"
}