{
    "Name": "AMI",
    "Subsets": [
        {
            "Name": "AMI-Train",
            "Volume": 2800.0,
            "Unit": "sentences",
            "Dialect": "mixed"
        },
        {
            "Name": "AMI-Test",
            "Volume": 700.0,
            "Unit": "sentences",
            "Dialect": "mixed"
        }
    ],
    "HF Link": "",
    "Link": "https://github.com/Allarwa/AMI",
    "License": "CC BY 4.0",
    "Year": 2025,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": [
        "social media"
    ],
    "Form": "text",
    "Collection Style": [
        "crawling"
    ],
    "Description": "An Arabic Twitter-based mental-illness focused sentiment dataset automatically annotated via transfer learning.",
    "Volume": 3500.0,
    "Unit": "sentences",
    "Ethical Risks": "Medium",
    "Provider": [
        "King Abdulaziz University",
        "Edinburgh Napier University"
    ],
    "Derived From": [],
    "Paper Title": "Transfer Learning-Based Automatic Sentiment Annotation of a Twitter-Based Arabic Mental Illness (AMI) Dataset",
    "Paper Link": "https://doi.org/10.1111/exsy.70128",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": true,
    "Tasks": [
        "sentiment analysis"
    ],
    "Venue Title": "Expert Systems",
    "Venue Type": "journal",
    "Venue Name": "Expert Systems",
    "Authors": [
        "Arwa Diwali",
        "Kawther Saeedi",
        "Kia Dashtipour",
        "Mandar Gogate",
        "Zain Hussain",
        "Adam Howard",
        "Amir Hussain"
    ],
    "Affiliations": [
        "King Abdulaziz University",
        "Edinburgh Napier University",
        "NHS Greater Glasgow and Clyde",
        "Duke University"
    ],
    "Abstract": "Sentiment analysis, crucial for discerning emotional tones in text, relies on manual annotation to train machine learning models and is considered the gold standard for creating annotated corpora. However, this process is time-consuming, labor-intensive, and prone to biases. This paper proposes an automatic annotation approach for the Twitter-based Arabic Mental Illness (AMI) dataset, which encompasses both Modern Standard Arabic and Dialectal Arabic. The approach leverages transfer learning with existing manually annotated datasets and three advanced Arabic language models to automate annotation, thereby enriching Arabic as a low-resource language with labelled sentiment data. Validation was conducted by comparing the automatically generated annotations to manual annotation on the same dataset, achieving strong inter-annotator agreement with a Cohen's Kappa statistic of κ=0.8457. Additionally, various baseline models were evaluated on the AMI dataset, identifying AraBERT as the top performer with the highest F1 score and accuracy.",
    "Added By": "Arwa Diwali"
}