{
    "Name": "APGC v1.0: Arabic Parallel Gender Corpus v1.0",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://camel.abudhabi.nyu.edu/arabic-parallel-gender-corpus/",
    "License": "custom",
    "Year": 2019,
    "Language": "multilingual",
    "Dialect": "ar-MSA: (Arabic (Modern Standard Arabic))",
    "Domain": "other",
    "Form": "text",
    "Collection Style": "crawling and annotation(other)",
    "Description": "a corpus designed to support research on gender bias in natural language processing applications working on Arabic",
    "Volume": "12,000",
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": "Multiple Institutions",
    "Derived From": "OpenSubtitles",
    "Paper Title": "Automatic Gender Identification and Reinflection in Arabic\r",
    "Paper Link": "https://aclanthology.org/W19-3822v2.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "CAMeL Resources",
    "Access": "Upon-Request",
    "Cost": "",
    "Test Split": "Yes",
    "Tasks": "gender identification, gender rewriting",
    "Venue Title": "GeBNLP",
    "Citations": "13.0",
    "Venue Type": "workshop",
    "Venue Name": "Workshop on Gender Bias in Natural Language Processing",
    "Authors": "Nizar Habash,Houda Bouamor,Christine Chung",
    "Affiliations": ",,",
    "Abstract": "The impressive progress in many Natural Language Processing (NLP) applications has increased the awareness of some of the biases these NLP systems have with regards to gender identities. In this paper, we propose an approach to extend biased single-output genderblind NLP systems with gender-specific alternative reinflections. We focus on Arabic, a gender-marking morphologically rich language, in the context of machine translation (MT) from English, and for first-personsingular constructions only. Our contributions are the development of a system-independent gender-awareness wrapper, and the building of a corpus for training and evaluating firstperson-singular gender identification and reinflection in Arabic. Our results successfully demonstrate the viability of this approach with 8% relative increase in BLEU score for firstperson-singular feminine, and 5.3% comparable increase for first-person-singular masculine on top of a state-of-the-art gender-blind MT system on a held-out test set.",
    "Added By": ""
}