{
    "Name": "Arab States Analogy Dataset (ASAD)",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/SaiedAlshahrani/ASAD",
    "Link": "https://github.com/SaiedAlshahrani/performance-implications/tree/main/Word-Representation-Evals/ASAD",
    "License": "MIT License",
    "Year": 2023,
    "Language": "ar",
    "Dialect": "ar-MSA: (Arabic (Modern Standard Arabic))",
    "Domain": "other",
    "Form": "text",
    "Collection Style": "manual curation",
    "Description": "ASAD is a word analogy dataset created using 20 Arab States with their corresponding capital cities, nationalities, currencies, and on which continents they are located, consisting of four sets: country-capital set, country-currency set, country-nationality set, and country-continent set. Each set has 380 word analogies, and the total number of word analogies in the ASAD dataset is 1520. This dataset is used to evaluate Arabic Word Embedding Models (WEMs). ",
    "Volume": "1,520",
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": "Clarkson University",
    "Derived From": "nan",
    "Paper Title": "Performance Implications of Using Unrepresentative Corpora in Arabic Natural Language Processing",
    "Paper Link": "https://aclanthology.org/2023.arabicnlp-1.19.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "HuggingFace",
    "Access": "Free",
    "Cost": "nan",
    "Test Split": "No",
    "Tasks": "embedding",
    "Venue Title": "ArabicNLP 2023",
    "Citations": "nan",
    "Venue Type": "conference",
    "Venue Name": "The First Arabic Natural Language Processing Conference",
    "Authors": "Saied Alshahrani, Norah Alshahrani, Soumyabrata Dey, Jeanna Matthews",
    "Affiliations": "Clarkson University",
    "Abstract": "Wikipedia articles are a widely used source of training data for Natural Language Processing (NLP) research, particularly as corpora for low-resource languages like Arabic. However, it is essential to understand the extent to which these corpora reflect the representative contributions of native speakers, especially when many entries in a given language are directly translated from other languages or automatically generated through automated mechanisms. In this paper, we study the performance implications of using inorganic corpora that are not representative of native speakers and are generated through automated techniques such as bot generation or automated template-based translation. The case of the Arabic Wikipedia editions gives a unique case study of this since the Moroccan Arabic Wikipedia edition (ARY) is small but representative, the Egyptian Arabic Wikipedia edition (ARZ) is large but unrepresentative, and the Modern Standard Arabic Wikipedia edition (AR) is both large and more representative. We intrinsically evaluate the performance of two main NLP upstream tasks, namely word representation and language modeling, using word analogy evaluations and fill-mask evaluations using our two newly created datasets: Arab States Analogy Dataset (ASAD) and Masked Arab States Dataset (MASD). We demonstrate that for good NLP performance, we need both large and organic corpora; neither alone is sufficient. We show that producing large corpora through automated means can be a counter-productive, producing models that both perform worse and lack cultural richness and meaningful representation of the Arabic language and its native speakers.",
    "Added By": "Saied Alshahrani"
}