{
    "Name": "Arabic-Dataset-for-CAPT",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/CAPT",
    "Link": "https://github.com/bhalima/Arabic-Dataset-for-CAPT",
    "License": "unknown",
    "Year": 2015,
    "Language": "ar",
    "Dialect": "Modern Standard Arabic",
    "Domain": "transcribed audio",
    "Form": "spoken",
    "Collection Style": "other",
    "Description": "The dataset includes both “correct” and “wrong” non-artificial pronunciations. The pronunciations are from nine pupils aged from 5 to 8 years; each of them uttered a set of 16 sequences (words or group of words). The chosen words included some difficulties to learners such as the long vowels and the words written with more than one connected component. ",
    "Volume": "143",
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": "University Badji Mokhtar",
    "Derived From": "",
    "Paper Title": "A statistical-based decision for arabic pronunciation assessment",
    "Paper Link": "https://link.springer.com/article/10.1007/s10772-014-9248-2",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "speech recognition ",
    "Venue Title": "IJST",
    "Citations": "",
    "Venue Type": "journal",
    "Venue Name": "International Journal of Speech Technology",
    "Authors": "Khaled Necibi,  Halima Bahi ",
    "Affiliations": "Khaled Necibi & Halima Bahi ",
    "Abstract": "The aim of a computer assisted language learning (CALL) system is to improve the language skills of learners. Such systems often include, grammar and vocabulary components, while the pronunciation learning seems to be the hardest step in language learning process. Little attention has been paid to this aspect among the required ones in CALL systems. In pronunciation learning context, the learner would like to know if its pronunciation is good or bad. In the case where the pronunciation is bad, it will be suitable if some advices are given to him. The goal of this work is an early detection of pupils with reading difficulties and in the issue of decision whether their pronunciation is good or not is our particular interest. For this purpose, we consider the answer to this question as a classification problem and we use a statistical approach to make a decision; this approach allows us to pursue the investigation concerning the pronunciation of every phoneme in the word or in the sentence.",
    "Added By": "Zaid Alyafeai"
}