{
    "Name": "Arabic Named Entity Gazetteer",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/WikiFANEGazet",
    "Link": "https://sourceforge.net/projects/arabic-named-entity-gazetteer/",
    "License": "CC BY 3.0",
    "Year": 2013,
    "Language": "ar",
    "Dialect": "Modern Standard Arabic",
    "Domain": [
        "wikipedia"
    ],
    "Form": "text",
    "Collection Style": [
        "crawling"
    ],
    "Description": "A gazetteer of entities curated from Wikipedia.",
    "Volume": 68355.0,
    "Unit": "tokens",
    "Ethical Risks": "Low",
    "Provider": [],
    "Derived From": [],
    "Paper Title": "Automatically Developing a Fine-grained Arabic Named Entity Corpus and Gazetteer by utilizing Wikipedia",
    "Paper Link": "https://aclanthology.org/I13-1045/",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "sourceforge",
    "Access": "Free",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "named entity recognition",
        "information retrieval"
    ],
    "Venue Title": "IJCNLP",
    "Venue Type": "conference",
    "Venue Name": "International Joint Conference on Natural Language Processing",
    "Authors": [
        "Fahd Alotaibi",
        "Mark Lee"
    ],
    "Affiliations": [
        "University of Birmingham, UK"
    ],
    "Abstract": "This paper presents a methodology to exploit the potential of Arabic Wikipedia to assist in the automatic development of a large Fine-grained Named Entity (NE) corpus and gazetteer. The corner stone of this approach is efficient classification of Wikipedia articles to target NE classes. The resources developed were thoroughly evaluated to ensure reliability and a high quality. Results show the developed gazetteer boosts the performance of the NE classifier on a news-wire domain by at least 2 points F-measure. Moreover, by combining a learning NE classifier with the developed corpus the score achieved is a high F-measure of 85.18%. The developed resources overcome the limitations of traditional Arabic NE tasks by more fine-grained analysis and providing a beneficial route for further studies.",
    "Added By": "Amr Keleg"
}