{
    "Name": "ArabicaQA",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/abdoelsayed/Open-ArabicaQA",
    "Link": "https://github.com/DataScienceUIBK/ArabicaQA",
    "License": "MIT License",
    "Year": 2024,
    "Language": "ar",
    "Dialect": "ar-MSA: (Arabic (Modern Standard Arabic))",
    "Domain": "wikipedia",
    "Form": "text",
    "Collection Style": "crawling and annotation(other)",
    "Description": "ArabicaQA is a robust dataset designed to support and advance the development of Arabic Question Answering (QA) systems. This dataset encompasses a wide range of question types, including both Machine Reading Comprehension (MRC) and Open-Domain questions, catering to various aspects of QA research and application. The dataset is structured to facilitate training, validation, and testing of Arabic QA models.",
    "Volume": "88,946",
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": "Multiple Institutions ",
    "Derived From": "nan",
    "Paper Title": "ArabicaQA: A Comprehensive Dataset for Arabic Question",
    "Paper Link": "https://arxiv.org/pdf/2403.17848v1.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "nan",
    "Test Split": "Yes",
    "Tasks": "question answering",
    "Venue Title": "arXiv",
    "Citations": "nan",
    "Venue Type": "preprint",
    "Venue Name": "nan",
    "Authors": "Abdelrahman Abdallah , Mahmoud Kasem , Mahmoud Abdalla , Mohamed Mahmoud , Mohamed Elkasaby , Yasser Elbendary , Adam Jatowt\r",
    "Affiliations": "nan",
    "Abstract": "In this paper, we address the significant gap in Arabic natural\nlanguage processing (NLP) resources by introducing ArabicaQA,\nthe first large-scale dataset for machine reading comprehension and\nopen-domain question answering in Arabic. This comprehensive\ndataset, consisting of 89,095 answerable and 3,701 unanswerable\nquestions created by crowdworkers to look similar to answerable\nones, along with additional labels of open-domain questions marks\na crucial advancement in Arabic NLP resources. We also present\nAraDPR, the first dense passage retrieval model trained on the\nArabic Wikipedia corpus, specifically designed to tackle the unique\nchallenges of Arabic text retrieval. Furthermore, our study includes\nextensive benchmarking of large language models (LLMs) for Arabic\nquestion answering, critically evaluating their performance in the\nArabic language context. In conclusion, ArabicaQA, AraDPR, and\nthe benchmarking of LLMs in Arabic question answering offer\nsignificant advancements in the field of Arabic NLP. The dataset\nand code are publicly accessible for further research",
    "Added By": "Zaid Alyafeai"
}