{
    "Name": "Arabic SMS/Chat ",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://catalog.ldc.upenn.edu/LDC2017T07",
    "License": "LDC User Agreement for Non-Members",
    "Year": 2014,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": "other",
    "Form": "text",
    "Collection Style": "other",
    "Description": "5,691 conversations totaling 1,029,248 words across 262,026 messages. Messages were natively written in either Arabic orthography or romanized Arabizi",
    "Volume": "262,026",
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": "LDC",
    "Derived From": "",
    "Paper Title": "Transliteration of Arabizi into Arabic Orthography: Developing a\r\nParallel Annotated Arabizi-Arabic Script SMS/Chat Corpus",
    "Paper Link": "https://www.ldc.upenn.edu/sites/www.ldc.upenn.edu/files/emnlp2014-transliteration-aribizi-into-arabic-orthography.pdf",
    "Script": "Arab-Latin",
    "Tokenized": "No",
    "Host": "LDC",
    "Access": "With-Fee",
    "Cost": "1750 $",
    "Test Split": "No",
    "Tasks": "transliteration, machine translation",
    "Venue Title": "WANLP",
    "Citations": "39.0",
    "Venue Type": "workshop",
    "Venue Name": "Arabic Natural Language Processing workshop",
    "Authors": "Ann Bies,Zhiyi Song,M. Maamouri,Stephen Grimes,Haejoong Lee,Jonathan Wright,S. Strassel,Nizar Habash,R. Eskander,Owen Rambow",
    "Affiliations": ",,,,,,,,,",
    "Abstract": "This paper describes the process of creating a novel resource, a parallel Arabizi-Arabic script corpus of SMS/Chat data. The language used in social media expresses many differences from other written genres: its vocabulary is informal with intentional deviations from standard orthography such as repeated letters for emphasis; typos and nonstandard abbreviations are common; and nonlinguistic content is written out, such as laughter, sound representations, and emoticons. This situation is exacerbated in the case of Arabic social media for two reasons. First, Arabic dialects, commonly used in social media, are quite different from Modern Standard Arabic phonologically, morphologically and lexically, and most importantly, they lack standard orthographies. Second, Arabic speakers in social media as well as discussion forums, SMS messaging and online chat often use a non-standard romanization called Arabizi. In the context of natural language processing of social media Arabic, transliterating from Arabizi of various dialects to Arabic script is a necessary step, since many of the existing state-of-the-art resources for Arabic dialect processing expect Arabic script input. The corpus described in this paper is expected to support Arabic NLP by providing this resource.",
    "Added By": "Zaid Alyafeai"
}