{
    "Name": "Arabic Named Entities",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/Arabic_Named_Entities",
    "Link": "https://sourceforge.net/projects/arabicnes/",
    "License": "unknown",
    "Year": 2010,
    "Language": "ar",
    "Dialect": "ar-MSA: (Arabic (Modern Standard Arabic))",
    "Domain": "other",
    "Form": "text",
    "Collection Style": "crawling and annotation(other)",
    "Description": "we have extracted\r\napproximately 45,000 Arabic NE",
    "Volume": "45,000",
    "Unit": "tokens",
    "Ethical Risks": "Low",
    "Provider": "Multiple Institutions",
    "Derived From": "nan",
    "Paper Title": "An automatically built Named Entity lexicon for Arabic\r",
    "Paper Link": "http://doras.dcu.ie/15979/1/An_automatically_built_Named_Entity_lexicon_for_Arabic.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "sourceforge",
    "Access": "Free",
    "Cost": "nan",
    "Test Split": "No",
    "Tasks": "named entity recognition",
    "Venue Title": "LREC",
    "Citations": "41.0",
    "Venue Type": "conference",
    "Venue Name": "International Conference on Language Resources and Evaluation",
    "Authors": "Mohammed Attia,Antonio Toral,L. Tounsi,M. Monachini,Josef van Genabith",
    "Affiliations": ",University of Groningen,,,",
    "Abstract": "We have successfully adapted and extended the automatic Multilingual, Interoperable Named Entity Lexicon approach to Arabic, using Arabic WordNet (AWN) and Arabic Wikipedia (AWK). First, we extract AWN’s instantiable nouns and identify the corresponding categories and hyponym subcategories in AWK. Then, we exploit Wikipedia inter-lingual links to locate correspondences between articles in ten different languages in order to identify Named Entities (NEs). We apply keyword search on AWK abstracts to provide for Arabic articles that do not have a correspondence in any of the other languages. In addition, we perform a post-processing step to fetch further NEs from AWK not reachable through AWN. Finally, we investigate diacritization using matching with geonames databases, MADA-TOKAN tools and different heuristics for restoring vowel marks of Arabic NEs. Using this methodology, we have extracted approximately 45,000 Arabic NEs and built, to the best of our knowledge, the largest, most mature and well-structured Arabic NE lexical resource to date. We have stored and organised this lexicon following the Lexical Markup Framework (LMF) ISO standard. We conduct a quantitative and qualitative evaluation of the lexicon against a manually annotated gold standard and achieve precision scores from \n 95.83% (with 66.13% recall) to 99.31% (with 61.45% recall) according to different values of a threshold.",
    "Added By": "Zaid Alyafeai"
}