{
    "Name": "ArabCulture",
    "Subsets": [],
    "HF Link": "https://huggingface.co/datasets/MBZUAI/ArabCulture",
    "Link": "https://huggingface.co/datasets/MBZUAI/ArabCulture",
    "License": "CC BY-NC-SA 4.0",
    "Year": 2025,
    "Language": "ar",
    "Dialect": "Modern Standard Arabic",
    "Domain": [
        "other"
    ],
    "Form": "text",
    "Collection Style": [
        "human annotation",
        "manual curation"
    ],
    "Description": "A commonsense reasoning dataset in Modern Standard Arabic covering 13 Arab countries across four regions.",
    "Volume": 3482.0,
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": [
        "MBZUAI"
    ],
    "Derived From": [],
    "Paper Title": "Commonsense Reasoning in Arab Culture",
    "Paper Link": "https://arxiv.org/pdf/2502.12788",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "HuggingFace",
    "Access": "Free",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "commonsense reasoning",
        "multiple choice question answering"
    ],
    "Venue Title": "arXiv",
    "Venue Type": "preprint",
    "Venue Name": "arXiv",
    "Authors": [
        "Abdelrahman Sadallah",
        "Junior Cedric Tonga",
        "Khalid Almubarak",
        "Saeed Almheiri",
        "Farah Atif",
        "Chatrine Qwaider",
        "Karima Kadaoui",
        "Sara Shatnawi",
        "Yaser Alesh",
        "Fajri Koto"
    ],
    "Affiliations": [
        "Mohamed bin Zayed University of Artificial Intelligence",
        "SDAIA",
        "Al-Balqa Applied University",
        "Khalifa University",
        "HUMAIN, Data and AI Models"
    ],
    "Abstract": "Despite progress in Arabic large language models, such as Jais and AceGPT, their evaluation on commonsense reasoning has largely relied on machine-translated datasets, which lack cultural depth and may introduce Anglocentric biases. Commonsense reasoning is shaped by geographical and cultural contexts, and existing English datasets fail to capture the diversity of the Arab world. To address this, we introduce ArabCulture, a commonsense reasoning dataset in Modern Standard Arabic (MSA), covering cultures of 13 countries across the Gulf, Levant, North Africa, and the Nile Valley. The dataset was built from scratch by engaging native speakers to write and validate culturally relevant questions for their respective countries. ArabCulture spans 12 daily life domains with 54 fine-grained subtopics, reflecting various aspects of social norms, traditions, and everyday experiences. Zero-shot evaluations show that open-weight language models with up to 32B parameters struggle to comprehend diverse Arab cultures, with performance varying across regions. These findings highlight the need for more culturally aware models and datasets tailored to the Arabic-speaking world.\n",
    "Added By": "Zaid Alyafeai"
}
