{
    "Name": "Arabic Infectious Disease Ontology",
    "Subsets": [],
    "HF Link": "",
    "Link": "http://www.research.lancs.ac.uk/portal/en/datasets/arabic-infectious-disease-ontology(39dbef60-ae9b-4405-99c8-35a41e95a3e0).html",
    "License": "unknown",
    "Year": 2020,
    "Language": "ar",
    "Dialect": "Modern Standard Arabic",
    "Domain": "web pages",
    "Form": "text",
    "Collection Style": "crawling",
    "Description": "This file contains an Arabic Infectious Disease Ontology to include Non-Standard Terminology. The Arabic Infectious Disease Ontology is written in the Arabic language, and is the first ontology in Arabic specialising in the infectious disease domain. It contains 11 classes, 21 object properties, 11 datatype properties, and 215 individual concepts.",
    "Volume": "215",
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": "Lancaster University",
    "Derived From": "",
    "Paper Title": "Developing an Arabic Infectious Disease Ontology to Include Non-Standard Terminology",
    "Paper Link": "https://eprints.lancs.ac.uk/id/eprint/142307/1/LREC_2020_Paper_Developing_an_Arabic_Infectious_Ontology_.pdf",
    "Script": "Arab",
    "Tokenized": "Yes",
    "Host": "other",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "dictionary",
    "Venue Title": "LREC",
    "Citations": "",
    "Venue Type": "conference",
    "Venue Name": "Language Resources and Evaluation Conference",
    "Authors": "Lama Alsudias, Paul Rayson",
    "Affiliations": " Lancaster University; King Saud University",
    "Abstract": "Building ontologies is a crucial part of the semantic web endeavour. In recent years, research interest has grown rapidly in supporting\nlanguages such as Arabic in NLP in general but there has been very little research on medical ontologies for Arabic. We present a new\nArabic ontology in the infectious disease domain to support various important applications including the monitoring of infectious disease\nspread via social media. This ontology meaningfully integrates the scientific vocabularies of infectious diseases with their informal\nequivalents. We use ontology learning strategies with manual checking to build the ontology. We applied three statistical methods for\nterm extraction from selected Arabic infectious diseases articles: TF-IDF, C-value, and YAKE. We also conducted a study, by consulting\naround 100 individuals, to discover the informal terms related to infectious diseases in Arabic. In future work, we will automatically\nextract the relations for infectious disease concepts but for now these are manually created. We report two complementary experiments\nto evaluate the ontology. First, a quantitative evaluation of the term extraction results and an additional qualitative evaluation by a\ndomain expert.",
    "Added By": "Zaid Alyafeai"
}