{
    "Name": "Arabic Hate Speech 2022 Shared Task",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/Arabic_Hate_Speech",
    "Link": "https://sites.google.com/view/arabichate2022/home",
    "License": "custom",
    "Year": 2022,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": [
        "social media"
    ],
    "Form": "text",
    "Collection Style": [
        "crawling"
    ],
    "Description": "largest Arabic dataset for offensive, fine-grained hate speech, vulgar and violence content",
    "Volume": 12698.0,
    "Unit": "sentences",
    "Ethical Risks": "High",
    "Provider": [
        "QCRI"
    ],
    "Derived From": [],
    "Paper Title": "Emojis as Anchors to Detect Arabic Offensive Language and Hate Speech",
    "Paper Link": "https://arxiv.org/pdf/2201.06723.pdf",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "QCRI Resources",
    "Access": "Free",
    "Cost": "",
    "Test Split": true,
    "Tasks": [
        "offensive language detection",
        "hate speech detection"
    ],
    "Venue Title": "arXiv",
    "Venue Type": "preprint",
    "Venue Name": "",
    "Authors": [],
    "Affiliations": [
        "Hamdy Mubarak",
        "Sabit Hassan",
        "and Shammur Absar Chowdhury"
    ],
    "Abstract": "We introduce a generic, language-independent method to collect a large percentage of offensive and hate\ntweets regardless of their topics or genres. We harness the extralinguistic information embedded in the\nemojis to collect a large number of offensive tweets. We apply the proposed method on Arabic tweets\nand compare it with English tweets – analysing key cultural differences. We observed a constant usage of\nthese emojis to represent offensiveness throughout different timespans on Twitter. We manually annotate\nand publicly release the largest Arabic dataset for offensive, fine-grained hate speech, vulgar and violence content. Furthermore, we benchmark the dataset for detecting offensiveness and hate speech using\ndifferent transformer architectures and perform in-depth linguistic analysis. We evaluate our models on\nexternal datasets – a Twitter dataset collected using a completely different method, and a multi-platform\ndataset containing comments from Twitter, YouTube and Facebook, for assessing generalization capability.\nCompetitive results on these datasets suggest that the data collected using our method captures universal\ncharacteristics of offensive language. Our findings also highlight the common words used in offensive communications, common targets for hate speech, specific patterns in violence tweets; and pinpoint common\nclassification errors that can be attributed to limitations of NLP models. We observe that even state-ofthe-art transformer models may fail to take into account culture, background and context or understand\nnuances present in real-world data such as sarcasm.",
    "Added By": "Zaid Alyafeai"
}