{
    "Name": "Arabic OSCAR",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/oscar-corpus/oscar",
    "Link": "https://oscar-corpus.com/",
    "License": "CC0",
    "Year": 2020,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": [
        "other"
    ],
    "Form": "text",
    "Collection Style": [
        "crawling"
    ],
    "Description": "a huge multilingual corpus obtained by language classification and filtering of the Common Crawl",
    "Volume": 8117162828.0,
    "Unit": "tokens",
    "Ethical Risks": "Low",
    "Provider": [
        "Inria"
    ],
    "Derived From": [
        "Common Crawl"
    ],
    "Paper Title": "A Monolingual Approach to Contextualized Word Embeddings\r\nfor Mid-Resource Languages",
    "Paper Link": "https://arxiv.org/pdf/2006.06202.pdf",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "other",
    "Access": "Free",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "text generation",
        "language modeling"
    ],
    "Venue Title": "ACL",
    "Venue Type": "conference",
    "Venue Name": "Assofications of computation linguisitcs",
    "Authors": [
        "Pedro Javier Ortiz Suárez",
        "L. Romary",
        "Benoît Sagot"
    ],
    "Affiliations": [
        "Inria;Sorbonne Université",
        "",
        ""
    ],
    "Abstract": "We use the multilingual OSCAR corpus, extracted from Common Crawl via language classification, filtering and cleaning, to train monolingual contextualized word embeddings (ELMo) for five mid-resource languages. We then compare the performance of OSCAR-based and Wikipedia-based ELMo embeddings for these languages on the part-of-speech tagging and parsing tasks. We show that, despite the noise in the Common-Crawl-based OSCAR data, embeddings trained on OSCAR perform much better than monolingual embeddings trained on Wikipedia. They actually equal or improve the current state of the art in tagging and parsing for all five languages. In particular, they also improve over multilingual Wikipedia-based contextual embeddings (multilingual BERT), which almost always constitutes the previous state of the art, thereby showing that the benefit of a larger, more diverse corpus surpasses the cross-lingual benefit of multilingual embedding architectures.",
    "Added By": ""
}