{
    "Name": "Arabic ontology",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://ontology.birzeit.edu/about#download",
    "License": "CC BY 4.0",
    "Year": 2021,
    "Language": "ar",
    "Dialect": "Modern Standard Arabic",
    "Domain": [
        "other"
    ],
    "Form": "text",
    "Collection Style": [
        "manual curation"
    ],
    "Description": "An Arabic Wordnet with ontologically-clean content. Classification of the meanings of the Arabic terms, based on state-of-art science, rather than on speakers' naïve knowledge.",
    "Volume": 30000.0,
    "Unit": "tokens",
    "Ethical Risks": "Low",
    "Provider": [
        "SinaLab",
        "Birzeit University"
    ],
    "Derived From": [],
    "Paper Title": "The Arabic Ontology - An Arabic Wordnet with Ontologically Clean Content.",
    "Paper Link": "https://arxiv.org/abs/2205.09664",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "CAMeL Resources",
    "Access": "Free",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "language modeling",
        "topic classification",
        "information retrieval",
        "speaker identification",
        "transliteration"
    ],
    "Venue Title": "",
    "Venue Type": "conference",
    "Venue Name": "",
    "Authors": [
        "Mustafa Jarrar"
    ],
    "Affiliations": [],
    "Abstract": "We present a formal Arabic wordnet built on the basis of a carefully designed ontology hereby referred to as the Arabic Ontology. The ontology provides a formal representation of the concepts that the Arabic terms convey, and its content was built with ontological analysis in mind, and benchmarked to scientific advances and rigorous knowledge sources as much as this is possible, rather than to only speakers’ beliefs as lexicons typically are. A comprehensive evaluation was conducted thereby demonstrating that the current version of the top-levels of the ontology can top the majority of the Arabic meanings. The ontology consists currently of about 1,300 well-investigated concepts in addition to 11,000 concepts that are partially validated. The ontology is accessible and searchable through a lexicographic search engine (http://ontology.birzeit.edu) that also includes about 150 Arabic-multilingual lexicons, and which are being mapped and enriched using the ontology. The ontology is fully mapped with Princeton WordNet, Wikidata, and other resources.",
    "Added By": "Tymaa Hammouda"
}