{
    "Name": "AraCOVID19-MFH",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://github.com/MohamedHadjAmeur/AraCOVID19-MFH",
    "License": "CC BY-NC-SA 4.0",
    "Year": 2021,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": "social media",
    "Form": "text",
    "Collection Style": "crawling and annotation(other)",
    "Description": "multi-label fake news and hate speech detection dataset each sentence is annotated with 10 labels",
    "Volume": "10,828",
    "Unit": "sentences",
    "Ethical Risks": "High",
    "Provider": "Multiple Institutions",
    "Derived From": "",
    "Paper Title": "AraCOVID19-MFH: Arabic COVID-19 Multi-label Fake News and Hate Speech Detection Dataset",
    "Paper Link": "https://arxiv.org/abs/2105.03143",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Upon-Request",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "fake news detection, hate speech detection",
    "Venue Title": "ArXiv",
    "Citations": "0.0",
    "Venue Type": "preprint",
    "Venue Name": "ArXiv",
    "Authors": "Mohamed Seghir Hadj Ameur,H. Aliane",
    "Affiliations": ",",
    "Abstract": "Along with the COVID-19 pandemic, an \"infodemic\" of false and misleading information has emerged and has complicated the COVID-19 response efforts. Social networking sites such as Facebook and Twitter have contributed largely to the spread of rumors, conspiracy theories, hate, xenophobia, racism, and prejudice. To combat the spread of fake news, researchers around the world have and are still making considerable efforts to build and share COVID-19 related research articles, models, and datasets. This paper releases \"AraCOVID19-MFH\"1a manually annotated multi-label Arabic COVID-19 fake news and hate speech detection dataset. Our dataset contains 10,828 Arabic tweets annotated with 10 different labels. The labels have been designed to consider some aspects relevant to the fact-checking task, such as the tweet's check worthiness, positivity/negativity, and factuality. To confirm our annotated dataset's practical utility, we used it to train and evaluate several classification models and reported the obtained results. Though the dataset is mainly designed for fake news detection, it can also be used for hate speech detection, opinion/news classification, dialect identification, and many other tasks. © 2021 Elsevier B.V.. All rights reserved.",
    "Added By": ""
}