{
    "Name": "AraNews",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://github.com/UBC-NLP/wanlp2020_arabic_fake_news_detection",
    "License": "custom",
    "Year": 2020,
    "Language": "ar",
    "Dialect": "Modern Standard Arabic",
    "Domain": "news articles",
    "Form": "text",
    "Collection Style": "crawling,annotation",
    "Description": "a large-scale, multi-topic, and multi-country Arabic news dataset",
    "Volume": "1,000,000",
    "Unit": "documents",
    "Ethical Risks": "Low",
    "Provider": "UBC",
    "Derived From": "",
    "Paper Title": "Machine Generation and Detection of Arabic Manipulated and Fake News\r",
    "Paper Link": "https://aclanthology.org/2020.wanlp-1.7.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Upon-Request",
    "Cost": "",
    "Test Split": "Yes",
    "Tasks": "fake news detection",
    "Venue Title": "WANLP",
    "Citations": "6.0",
    "Venue Type": "workshop",
    "Venue Name": "Arabic Natural Language Processing Workshop",
    "Authors": "E. Nagoudi,AbdelRahim Elmadany,Muhammad Abdul-Mageed,Tariq Alhindi,H. Cavusoglu",
    "Affiliations": ",University of British Columbia,,Columbia University;King Abdulaziz City for Science and Technology,",
    "Abstract": "Fake news and deceptive machine-generated text are serious problems threatening modern societies, including in the Arab world. This motivates work on detecting false and manipulated stories online. However, a bottleneck for this research is lack of sufficient data to train detection models. We present a novel method for automatically generating Arabic manipulated (and potentially fake) news stories. Our method is simple and only depends on availability of true stories, which are abundant online, and a part of speech tagger (POS). To facilitate future work, we dispense with both of these requirements altogether by providing AraNews, a novel and large POS-tagged news dataset that can be used off-the-shelf. Using stories generated based on AraNews, we carry out a human annotation study that casts light on the effects of machine manipulation on text veracity. The study also measures human ability to detect Arabic machine manipulated text generated by our method. Finally, we develop the first models for detecting manipulated Arabic news and achieve state-of-the-art results on Arabic fake news detection (macro F1=70.06). Our models and data are publicly available.",
    "Added By": "Zaid Alyafeai"
}