{
    "Name": "AraNPCC",
    "Subsets": [],
    "HF Link": "nan",
    "Link": "https://archive.org/details/AraNPCC",
    "License": "CC BY-NC 4.0",
    "Year": 2022,
    "Language": "ar",
    "Dialect": "ar-MSA: (Arabic (Modern Standard Arabic))",
    "Domain": "news articles",
    "Form": "text",
    "Collection Style": "crawling",
    "Description": "the corpus is a large Arabic newspaper COVID-19 corpus, automatically collected from 88 Arabic newspapers from 12 Arab countries.",
    "Volume": "7,277,525",
    "Unit": "documents",
    "Ethical Risks": "Medium",
    "Provider": "KACST",
    "Derived From": "nan",
    "Paper Title": "AraNPCC: The Arabic Newspaper COVID-19 Corpus",
    "Paper Link": "http://www.lrec-conf.org/proceedings/lrec2022/workshops/OSACT/pdf/2022.osact-1.4.pdf",
    "Script": "Latn",
    "Tokenized": "No",
    "Host": "other",
    "Access": "Free",
    "Cost": "nan",
    "Test Split": "No",
    "Tasks": "language modeling, topic classification, corpus spatio-temporal analysis",
    "Venue Title": "LREC",
    "Citations": "nan",
    "Venue Type": "conference",
    "Venue Name": "European Language Resources Association (ELRA)",
    "Authors": "Abdulmohsen Al-Thubaity, Sakhar Alkhereyf, Alia Bahanshal",
    "Affiliations": "The National Center for Data Analytics and Artificial Intelligence King Abdulaziz City for Science and Technology (KACST)",
    "Abstract": "This paper introduces a corpus for Arabic newspapers during COVID-19: AraNPCC. The AraNPCC corpus covers 2019 until 2021 via automatically-collected data from 12 Arab countries. It comprises more than 2 billion words and 7.2 million texts alongside their metadata. AraNPCC can be used for several natural language processing tasks, such as updating available Arabic language models or corpus linguistics tasks, including language change over time. We utilized the corpus in two case studies. In the first case study, we investigate the correlation between the number of officially reported infected cases and the collective word frequency of “COVID” and “Corona.” The data shows a positive correlation that varies among Arab countries. For the second case study, we extract and compare the top 50 keywords in 2020 and 2021 to study the impact of the COVID-19 pandemic on two Arab countries, namely Algeria and Saudi Arabia. For 2020, the data shows that the two countries’ newspapers strongly interacted with the pandemic, emphasizing its spread and dangerousness, and in 2021 the data suggests that the two countries coped with the pandemic.",
    "Added By": "Jezia Zakraoui"
}