{
    "Name": "Arap-Tweet Corpus",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://arap.qatar.cmu.edu/ ",
    "License": "unknown",
    "Year": 2018,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": "social media",
    "Form": "text",
    "Collection Style": "crawling,annotation",
    "Description": "Arap-Tweet is a large-scale, multi-dialectal Arabic Twitter corpus containing 2.4 million tweets from 11 regions across 16 countries in the Arab world. The dataset includes annotations for dialect, age group, and gender of the users. Tweets were collected using region-specific keywords to ensure accurate dialect identification, and the profiles of users were manually verified and annotated by trained annotators. This corpus is designed to support research in author profiling, stylometry, and dialect identification, providing a valuable resource for natural language processing applications in Arabic.",
    "Volume": "2,400,000",
    "Unit": "sentences",
    "Ethical Risks": "Medium",
    "Provider": "Multiple Institutions",
    "Derived From": "Public Twitter profiles and their tweets",
    "Paper Title": "Arap-Tweet: A Large Multi-Dialect Twitter Corpus for Gender, Age, and Language Variety Identification",
    "Paper Link": "https://arxiv.org/pdf/1808.07674",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "other",
    "Access": "Upon-Request",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "sentiment analysis, dialect identification, author profiling, authorship attribution",
    "Venue Title": "COLING",
    "Citations": "",
    "Venue Type": "conference",
    "Venue Name": "International academic conference on computational linguistics",
    "Authors": "Wajdi Zaghouani, and Anis Charfi ",
    "Affiliations": "College of Humanities and Social Sciences, Hamad Bin Khalifa University, Qatar; Information Systems Program, Carnegie Mellon University, Qatar",
    "Abstract": "This paper presents the Arap-Tweet corpus, a large-scale, multi-dialectal Arabic corpus sourced from Twitter, which has been annotated for age, gender, and dialectal variety. The corpus is intended to provide resources for developing NLP tools and models for Arabic dialects and can be used in tasks such as author profiling, sentiment analysis, and more. The dataset covers 11 major dialect regions and includes over 2.4 million tweets. Annotators identified users based on dialect-specific keywords and verified additional metadata (age and gender) through manual checks and external resources.",
    "Added By": "Maryam Al Emadi"
}