{
    "Name": "AraSenti",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/AraSenti",
    "Link": "https://github.com/nora-twairesh/AraSenti",
    "License": "GPL-3.0",
    "Year": 2017,
    "Language": "ar",
    "Dialect": "ar-SA: (Arabic (Saudi Arabia))",
    "Domain": "social media",
    "Form": "text",
    "Collection Style": "crawling and annotation(other)",
    "Description": "The corpus contains 17,573 tweets labelled with four labels for sentiment: positive, negative, neutral and mixed",
    "Volume": "17,573",
    "Unit": "sentences",
    "Ethical Risks": "Medium",
    "Provider": "KSU",
    "Derived From": "",
    "Paper Title": "AraSenTi-Tweet: A Corpus for Arabic Sentiment Analysis of Saudi Tweets",
    "Paper Link": "https://www.sciencedirect.com/science/article/pii/S1877050917321518",
    "Script": "Arab-Latn",
    "Tokenized": "Yes",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "sentiment analysis",
    "Venue Title": "ACLING",
    "Citations": "56.0",
    "Venue Type": "conference",
    "Venue Name": "nternational Conference on AI in Computational Linguistics",
    "Authors": "Nora Al-Twairesh,Hend Suliman Al-Khalifa,A. Al-Salman,Y. Al-Ohali",
    "Affiliations": ",,,",
    "Abstract": "Abstract Arabic Sentiment Analysis is an active research area these days. However, the Arabic language still lacks sufficient language resources to enable the tasks of sentiment analysis. In this paper, we present the details of collecting and constructing a large dataset of Arabic tweets. The techniques used in cleaning and pre-processing the collected dataset are explained. A corpus of Arabic tweets annotated for sentiment analysis was extracted from this dataset. The corpus consists mainly of tweets written in Modern Standard Arabic and the Saudi dialect. The corpus was manually annotated for sentiment. The annotation process is explained in detail and the challenges during the annotation are highlighted. The corpus contains 17,573 tweets labelled with four labels for sentiment: positive, negative, neutral and mixed. Baseline experiments were conducted to provide benchmark results for future work.",
    "Added By": "Maraim Masoud"
}