{
    "Name": "ArBanking77",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://sina.birzeit.edu/arbanking77/",
    "License": "unknown",
    "Year": 2023,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": [
        "other"
    ],
    "Form": "text",
    "Collection Style": [
        "human annotation"
    ],
    "Description": "Queries in MSA and Palestinian Arabic annotated for their intent (77 classes)",
    "Volume": 31404.0,
    "Unit": "sentences",
    "Ethical Risks": "Medium",
    "Provider": [
        "SinaLab",
        "Birzeit University"
    ],
    "Derived From": [],
    "Paper Title": "ArBanking77: Intent Detection Neural Model and a New Dataset in Modern and Dialectical Arabic",
    "Paper Link": "https://aclanthology.org/2023.arabicnlp-1.22/",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "other",
    "Access": "Upon-Request",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "dialect identification",
        "intent detection"
    ],
    "Venue Title": "ArabicNLP",
    "Venue Type": "conference",
    "Venue Name": "Arabic Natural Language Processing Conference",
    "Authors": [
        "Mustafa Jarrar",
        "Ahmet Birim",
        "Mohammed Khalilia",
        "Mustafa Erden",
        "Sana Ghanem"
    ],
    "Affiliations": [],
    "Abstract": "This paper presents the ArBanking77, a large Arabic dataset for intent detection in the banking domain. Our dataset was arabized and localized from the original English Banking77 dataset, which consists of 13,083 queries to ArBanking77 dataset with 31,404 queries in both Modern Standard Arabic (MSA) and Palestinian dialect, with each query classified into one of the 77 classes (intents). Furthermore, we present a neural model, based on AraBERT, fine-tuned on ArBanking77, which achieved an F1-score of 0.9209 and 0.8995 on MSA and Palestinian dialect, respectively. We performed extensive experimentation in which we simulated low-resource settings, where the model is trained on a subset of the data and augmented with noisy queries to simulate colloquial terms, mistakes and misspellings found in real NLP systems, especially live chat queries. The data and the models are publicly available at https://sina.birzeit.edu/arbanking77.",
    "Added By": "Amr Keleg"
}