{
    "Name": "ARC-WMI",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/ARC_WMI",
    "Link": "https://github.com/iwan-rg/ARC-WMI",
    "License": "CC BY-NC-SA 4.0",
    "Year": 2018,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": [
        "other"
    ],
    "Form": "text",
    "Collection Style": [
        "crawling"
    ],
    "Description": "4476 sentences with over 61k words, extracted from 94 sources of Arabic written medicine information",
    "Volume": 4476.0,
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": [
        "King Saud University Riyadh"
    ],
    "Derived From": [],
    "Paper Title": "ARC-WMI: Towards Building Arabic Readability Corpus for Written Medicine\r\nInformation",
    "Paper Link": "http://lrec-conf.org/workshops/lrec2018/W30/pdf/9_W30.pdf",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "readability assessment"
    ],
    "Venue Title": "LREC",
    "Venue Type": "conference",
    "Venue Name": "International Conference on Language Resources and Evaluation",
    "Authors": [
        "Abeer Aldayel",
        "Hend Al-Khalifa",
        "Sinaa Alaqeel",
        "Norah Abanmy",
        "Maha Al-Yahya",
        "Mona Diab"
    ],
    "Affiliations": [
        "College of Computer and Information Science, King Saud University, Riyadh, Saudi Arabia",
        "College of Pharmacy, King Saud University, Riyadh, Saudi Arabia",
        "Department of Computer Science, the George Washington University"
    ],
    "Abstract": "Developing easy-to-read written medicine information continues to be a challenge in health communication. Readability aims to gauge the difficulty level of a text. Various formulas and machine learning algorithms have proposed to judge the readability of health materials and assist writers in identifying possible problems related to text difficulty. For this reason, having corpus annotated with readability levels is fundamental to evaluating the readability formulas and training machine learning algorithms. Arabic suffers from a lack of annotated corpora to evaluate text readability, especially for health materials. To address this shortage, we describe a baseline results towards constructing readability corpus ARC-WMI, a new Arabic collection of written medicine information annotated with readability levels. We compiled a corpus of 4476 sentences with over 61k words, extracted from 94 sources of Arabic written medicine information. These sentences were manually annotated and assigned a readability level (“Easy,” “Intermediate,” or “Difficult”) by a panel of five health-care professionals.",
    "Added By": "Zaid Alyafeai"
}