{
    "Name": "ArMATH",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/ArMATH",
    "Link": "https://github.com/reem-codes/ArMATH",
    "License": "unknown",
    "Year": 2022,
    "Language": "multilingual",
    "Dialect": "Modern Standard Arabic",
    "Domain": [
        "other"
    ],
    "Form": "text",
    "Collection Style": [
        "other"
    ],
    "Description": "There are 6000 samples and 883 templates. A template is an equation once the variables have been replaced with ordered placeholders.",
    "Volume": 6000.0,
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": [
        "-"
    ],
    "Derived From": [],
    "Paper Title": "ArMATH: a Dataset for Solving Arabic Math Word Problems",
    "Paper Link": "https://aclanthology.org/2022.lrec-1.37.pdf",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": true,
    "Tasks": [
        "question answering"
    ],
    "Venue Title": "LREC",
    "Venue Type": "conference",
    "Venue Name": "Language Resources and Evaluation Conference",
    "Authors": [
        "Reem Alghamdi",
        "Zhenwen Liang",
        "Xiangliang Zhang"
    ],
    "Affiliations": [
        "King Abdullah University of Science and Technology (KAUST)",
        "University of Notre Dame"
    ],
    "Abstract": "This paper studies solving Arabic Math Word Problems by deep learning. A Math Word Problem (MWP) is a text description of a mathematical problem that can be solved by deriving a math equation to reach the answer. Effective models have been developed for solving MWPs in English and Chinese. However, Arabic MWPs are rarely studied. This paper contributes the first large-scale dataset for Arabic MWPs, which contains 6,000 samples of primary-school math problems, written in Modern Standard Arabic (MSA). Arabic MWP solvers are then built with deep learning models and evaluated on this dataset. In addition, a transfer learning model is built to let the high-resource Chinese MWP solver promote the performance of the low-resource Arabic MWP solver. This work is the first to use deep learning methods to solve Arabic MWP and the first to use transfer learning to solve MWP across different languages. The transfer learning enhanced solver has an accuracy of 74.15%, which is 3% higher than the solver without using transfer learning. We make the dataset and solvers available in public for encouraging more research of Arabic MWPs: https://github.com/reem-codes/ArMATH",
    "Added By": "Zaid Alyafeai"
}