{
    "Name": "ArSenTD-LEV",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/ramybaly/arsentd_lev",
    "Link": "http://oma-project.com/ArSenL/ArSenTD_Lev_Intro",
    "License": "custom",
    "Year": 2019,
    "Language": "ar",
    "Dialect": "Levant",
    "Domain": [
        "social media"
    ],
    "Form": "text",
    "Collection Style": [
        "crawling",
        "machine annotation"
    ],
    "Description": "ArSentD-LEV is a multi-topic corpus for target-based sentiment analysis in Arabic Levantine tweets",
    "Volume": 4000.0,
    "Unit": "sentences",
    "Ethical Risks": "Medium",
    "Provider": [
        "American University of Beirut"
    ],
    "Derived From": [],
    "Paper Title": "ArSentD-LEV: A Multi-Topic Corpus for Target-based Sentiment Analysis in Arabic Levantine Tweets",
    "Paper Link": "https://paperswithcode.com/paper/190601830",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "other",
    "Access": "Free",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "sentiment analysis"
    ],
    "Venue Title": "LREC",
    "Venue Type": "conference",
    "Venue Name": "International Conference on Language Resources and Evaluation",
    "Authors": [
        "Ramy Baly",
        "Alaa Khaddaj",
        "Hazem Hajj",
        "Wassim El-Hajj",
        "Khaled Bashir Shaban"
    ],
    "Affiliations": [
        "(1) MIT Computer Science and Artificial Intelligence Laboratory",
        "Cambridge",
        "MA 02139",
        "USA (2) American University of Beirut",
        "Electrical and Computer Engineering Department",
        "Beirut",
        "Lebanon (3) American University of Beirut",
        "Computer Science Department",
        "Beirut",
        "Lebanon (4) Qatar University",
        "Computer Science and Engineering Department",
        "Doha",
        "Qatar"
    ],
    "Abstract": "Sentiment analysis is a highly subjective and challenging task. Its complexity further increases when applied to the Arabic language, mainly because of the large variety of dialects that are unstandardized and widely used in the Web, especially in social media. While many datasets have been released to train sentiment classifiers in Arabic, most of these datasets contain shallow annotation, only marking the sentiment of the text unit, as a word, a sentence or a document. In this paper, we present the Arabic Sentiment Twitter Dataset for the Levantine dialect (ArSenTD-LEV). Based on findings from analyzing tweets from the Levant region, we created a dataset of 4,000 tweets with the following annotations: the overall sentiment of the tweet, the target to which the sentiment was expressed, how the sentiment was expressed, and the topic of the tweet. Results confirm the importance of these annotations at improving the performance of a baseline sentiment classifier. They also confirm the gap of training in a certain domain, and testing in another domain",
    "Added By": "Jezia Zakraoui"
}