{
    "Name": "ArSentiment",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/hadyelsahar/ar_res_reviews",
    "Link": "https://github.com/hadyelsahar/large-arabic-sentiment-analysis-resouces",
    "License": "unknown",
    "Year": 2015,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": "reviews",
    "Form": "text",
    "Collection Style": "crawling",
    "Description": "Automatically annotated Reviews in Domains of Movies, Hotels, Restaurants and Products",
    "Volume": "42,692",
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": "Nile University",
    "Derived From": "",
    "Paper Title": "Building Large Arabic Multi-domain Resources for Sentiment Analysis",
    "Paper Link": "https://link.springer.com/chapter/10.1007/978-3-319-18117-2_2",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "sentiment analysis, review classification",
    "Venue Title": "CICLing",
    "Citations": "127.0",
    "Venue Type": "conference",
    "Venue Name": "International Conference on Computational Linguistics and Intelligent Text Processing",
    "Authors": "Hady ElSahar,S. El-Beltagy",
    "Affiliations": ",",
    "Abstract": "While there has been a recent progress in the area of Arabic Sentiment Analysis, most of the resources in this area are either of limited size, domain specific or not publicly available. In this paper, we address this problem by generating large multi-domain datasets for Sentiment Analysis in Arabic. The datasets were scrapped from different reviewing websites and consist of a total of 33K annotated reviews for movies, hotels, restaurants and products. Moreover we build multi-domain lexicons from the generated datasets. Different experiments have been carried out to validate the usefulness of the datasets and the generated lexicons for the task of sentiment classification. From the experimental results, we highlight some useful insights addressing: the best performing classifiers and feature representation methods, the effect of introducing lexicon based features and factors affecting the accuracy of sentiment classification in general. All the datasets, experiments code and results have been made publicly available for scientific purposes.",
    "Added By": ""
}