{
    "Name": "ArTrivia",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://github.com/salrowili/ArTrivia/tree/main",
    "License": "unknown",
    "Year": 2023,
    "Language": "ar",
    "Dialect": "Modern Standard Arabic",
    "Domain": "wikipedia",
    "Form": "text",
    "Collection Style": "crawling,annotation",
    "Description": "10,045 question-answer-passages triplets extracted from Wikipedia passages",
    "Volume": "10,045",
    "Unit": "sentences",
    "Ethical Risks": "",
    "Provider": "",
    "Derived From": "",
    "Paper Title": "ArTrivia: Harvesting Arabic Wikipedia to Build A New Arabic Question Answering Dataset",
    "Paper Link": "https://aclanthology.org/2023.arabicnlp-1.17/",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": "Yes",
    "Tasks": "question answering",
    "Venue Title": "ArabicNLP",
    "Citations": "",
    "Venue Type": "conference",
    "Venue Name": "Arabic Natural Language Processing Conference",
    "Authors": "",
    "Affiliations": "",
    "Abstract": "We present ArTrivia, a new Arabic question-answering dataset consisting of more than 10,000 question-answer pairs along with relevant passages, covering a wide range of 18 diverse topics in Arabic. We created our dataset using a newly proposed pipeline that leverages diverse structured data sources from Arabic Wikipedia. Moreover, we conducted a comprehensive statistical analysis of ArTrivia and assessed the performance of each component in our pipeline. Additionally, we compared the performance of ArTrivia against the existing TyDi QA dataset using various experimental setups. Our analysis highlights the significance of often overlooked aspects in dataset creation, such as answer normalization, in enhancing the quality of QA datasets. Our evaluation also shows that ArTrivia presents more challenging and out-of-distribution questions to TyDi, raising questions about the feasibility of using ArTrivia as a complementary dataset to TyDi.",
    "Added By": "Amr Keleg"
}