{
    "Name": "Aya Dataset",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/aya_ar",
    "Link": "https://hf.co/datasets/CohereForAI/aya_dataset",
    "License": "Apache-2.0",
    "Year": 2024,
    "Language": "multilingual",
    "Dialect": "mixed",
    "Domain": [
        "other"
    ],
    "Form": "text",
    "Collection Style": [
        "manual curation"
    ],
    "Description": "The Aya Dataset is a multilingual instruction fine-tuning dataset curated by an open-science community via Aya Annotation Platform from Cohere For AI. The dataset contains a total of 204k human-annotated prompt-completion pairs along with the demographics data of the annotators.",
    "Volume": 14250.0,
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": [
        "Cohere For AI"
    ],
    "Derived From": [],
    "Paper Title": "Aya Dataset: An Open-Access Collection for Multilingual Instruction Tuning",
    "Paper Link": "https://arxiv.org/pdf/2402.06619.pdf",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "HuggingFace",
    "Access": "Free",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "question answering",
        "instruction tuning"
    ],
    "Venue Title": "arXiv",
    "Venue Type": "preprint",
    "Venue Name": "",
    "Authors": [
        "Shivalika Singh",
        "Freddie Vargus",
        "Daniel Dsouza",
        "Börje F. Karlsson",
        "Abinaya Mahendiran",
        "Wei-Yin Ko",
        "Herumb Sh",
        "ilya",
        "Jay Patel",
        "Deividas Mataciunas",
        "Laura OMahony",
        "Mike Zhang",
        "Ramith Hettiarachchi",
        "Joseph Wilson",
        "Marina Machado",
        "Luisa Souza Moura",
        "Dominik Krzemiński",
        "Hakimeh Fadaei",
        "Irem Ergün",
        "Ifeoma Okoh",
        "Aisha Alaagib",
        "Oshan Mudannayake",
        "Zaid Alyafeai",
        "Vu Minh Chien",
        "Sebastian Ruder",
        "Surya Guthikonda",
        "Emad A. Alghamdi",
        "Sebastian Gehrmann",
        "Niklas Muennighoff",
        "Max Bartolo",
        "Julia Kreutzer",
        "Ahmet Üstün",
        "Marzieh Fadaee  and Sara Hooker"
    ],
    "Affiliations": [],
    "Abstract": "Datasets are foundational to many breakthroughs in modern artificial intelligence. Many recent\nachievements in the space of natural language processing (NLP) can be attributed to the finetuning of pre-trained models on a diverse set of tasks that enables a large language model (LLM)\nto respond to instructions. Instruction fine-tuning (IFT) requires specifically constructed and annotated datasets. However, existing datasets are almost all in the English language. In this work,\nour primary goal is to bridge the language gap by building a human-curated instruction-following\ndataset spanning 65 languages. We worked with fluent speakers of languages from around the world\nto collect natural instances of instructions and completions. Furthermore, we create the most extensive multilingual collection to date, comprising 513 million instances through templating and\ntranslating existing datasets across 114 languages. In total, we contribute four key resources: we\ndevelop and open-source the Aya Annotation Platform, the Aya Dataset, the Aya Collection,\nand the Aya Evaluation Suite. The Aya initiative also serves as a valuable case study in participatory research, involving collaborators from 119 countries. We see this as a valuable framework\nfor future research collaborations that aim to bridge gaps in resources.",
    "Added By": "Zaid Alyafeai"
}