{
    "Name": "BRAD 1.0",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/BRAD",
    "Link": "https://github.com/elnagara/BRAD-Arabic-Dataset",
    "License": "unknown",
    "Year": 2016,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": "reviews",
    "Form": "text",
    "Collection Style": "crawling,annotation",
    "Description": "The reviews were collected from GoodReads.com website during June/July 2016",
    "Volume": "156,506",
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": "Sharjah University",
    "Derived From": "",
    "Paper Title": "BRAD 1.0: Book reviews in Arabic dataset\r\n",
    "Paper Link": "https://ieeexplore.ieee.org/abstract/document/7945800",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": "Yes",
    "Tasks": "review classification",
    "Venue Title": "AICCSA",
    "Citations": "32.0",
    "Venue Type": "conference",
    "Venue Name": "International Conference on Computer Systems and Applications",
    "Authors": "Ashraf Elnagar,Omar Einea",
    "Affiliations": ",",
    "Abstract": "The availability of rich datasets is a pre-requisite for proposing robust sentiment analysis systems. A variety of such datasets exists in English language. However, it is rare or nonexistent for the Arabic language except for a recent LABR dataset, which consists of a little bit over 63,000 book reviews extracted from. Goodreads. com. We introduce BRAD 1.0, the largest Book Reviews in Arabic Dataset for sentiment analysis and machine language applications. BRAD comprises of almost 510,600 book records. Each record corresponds for a single review and has the review in Arabic language and the reviewer's rating on a scale of 1 to 5 stars. In this paper, we present and describe the properties of BRAD. Further, we provide two versions of BRAD: the complete unbalanced dataset and the balanced version of BRAD. Finally, we implement four sentiment analysis classifiers based on this dataset and report our findings. When training and testing the classifiers on BRAD as opposed to LABR, an improvement rate growth of 46% is reported. The highest accuracy attained is 91%. Our core contribution is to make this benchmark-dataset available and accessible to the research community on Arabic language.",
    "Added By": ""
}