{
    "Name": "CALIMA-GLF",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://github.com/unimorph/afb",
    "License": "CC BY-SA 3.0",
    "Year": 2017,
    "Language": "ar",
    "Dialect": "Gulf",
    "Domain": [
        "social media"
    ],
    "Form": "text",
    "Collection Style": [
        "manual curation"
    ],
    "Description": "The dataset is part of the CALIMAGLF morphological analyzer, focusing on Gulf Arabic verbs. It includes over 2,600 verbal lemmas with associated paradigms and lexical entries. The verbs were derived from phonetic dictionary entries, annotated, and expanded into inflected forms, including orthographic variants.",
    "Volume": 2648.0,
    "Unit": "tokens",
    "Ethical Risks": "Low",
    "Provider": [
        "NYU Abu Dhabi"
    ],
    "Derived From": [],
    "Paper Title": "A Morphological Analyzer for Gulf Arabic Verbs",
    "Paper Link": "https://aclanthology.org/W17-1305.pdf",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "CAMeL Resources",
    "Access": "Free",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "part of speech tagging",
        "morphological analysis"
    ],
    "Venue Title": "WANLP",
    "Venue Type": "workshop",
    "Venue Name": "The Third Arabic Natural Language Processing Workshop",
    "Authors": [
        "Salam Khalifa",
        "Sara Hassan",
        "Nizar Habash"
    ],
    "Affiliations": [
        "CAMeL Lab",
        "New York University Abu Dhabi"
    ],
    "Abstract": "We present CALIMAGLF, a Gulf Arabic morphological analyzer currently covering over 2,600 verbal lemmas. We describe in detail the process of building the analyzer starting from phonetic dictionary entries to fully inflected orthographic paradigms and associated lexicon and orthographic variants. We evaluate the coverage of CALIMAGLF against Modern Standard Arabic and Egyptian Arabic analyzers on part of a Gulf Arabic novel. CALIMAGLF verb analysis token recall for identifying correct POS tag outperforms both the Modern Standard Arabic and Egyptian Arabic analyzers by over 27.4% and 16.9% absolute, respectively.",
    "Added By": "Maryam Al Emadi"
}