{
    "Name": "Calliar",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/Calliar",
    "Link": "https://github.com/ARBML/Calliar",
    "License": "MIT License",
    "Year": 2021,
    "Language": "ar",
    "Dialect": "Modern Standard Arabic",
    "Domain": "other",
    "Form": "images",
    "Collection Style": "crawling,annotation",
    "Description": "Calliar is a dataset for Arabic calligraphy. The dataset consists of 2500 json files that contain strokes manually annotated for Arabic calligraphy. This repository contains the dataset for the following paper ",
    "Volume": "2,500",
    "Unit": "images",
    "Ethical Risks": "Low",
    "Provider": "ARBML",
    "Derived From": "",
    "Paper Title": "Calliar: An Online Handwritten Dataset for Arabic Calligraphy",
    "Paper Link": "https://arxiv.org/pdf/2106.10745",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": "Yes",
    "Tasks": "calligraphy",
    "Venue Title": "NCAA",
    "Citations": "",
    "Venue Type": "journal",
    "Venue Name": "Neural Computing and Applications ",
    "Authors": "Zaid Alyafeai, Maged S. Al-shaibani, Mustafa Ghaleb & Yousif Ahmed Al-Wajih ",
    "Affiliations": "",
    "Abstract": "Calligraphy is an essential part of the Arabic heritage and culture. It has been used in the past for the decoration of houses and mosques. Usually, such calligraphy is designed manually by experts with aesthetic insights. In the past few years, there has been a considerable effort to digitize such type of art by either taking a photograph of decorated buildings or drawing them using digital devices. The latter is considered an online form where the drawing is tracked by recording the apparatus movement, an electronic pen, for instance, on a screen. In the literature, there are many offline datasets with diverse Arabic styles for calligraphy. However, there is no available online dataset for Arabic calligraphy. In this paper, we illustrate our approach for collecting and annotating an online dataset for Arabic calligraphy called Calliar, which consists of 2,500 sentences. Calliar is annotated for stroke, character, word, and sentence-level prediction. We also propose various baseline models for the character classification task. The results we achieved highlight that it is still an open problem.",
    "Added By": "Zaid Alyafeai"
}