{
    "Name": "CANERCorpus",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/caner",
    "Link": "https://github.com/RamziSalah/Classical-Arabic-Named-Entity-Recognition-Corpus",
    "License": "unknown",
    "Year": 2018,
    "Language": "ar",
    "Dialect": "Modern Standard Arabic",
    "Domain": "other",
    "Form": "text",
    "Collection Style": "manual curation",
    "Description": "It is freely available and manual annotation by human experts, containing more than 7,000 Hadiths",
    "Volume": "72,108",
    "Unit": "tokens",
    "Ethical Risks": "Low",
    "Provider": "Universiti Kebangsaan",
    "Derived From": "",
    "Paper Title": "Building the Classical Arabic Named Entity Recognition Corpus (CANERCorpus)",
    "Paper Link": "https://ieeexplore.ieee.org/document/8464820/authors#authors",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "named entity recognition",
    "Venue Title": "CAMP",
    "Citations": "0.0",
    "Venue Type": "conference",
    "Venue Name": "International Conference on Information Retrieval and Knowledge Management",
    "Authors": "Ramzi Salah,Lailatul Qadri Binti Zakaria",
    "Affiliations": ",",
    "Abstract": "The past decade has witnessed construction of the background information resources to overcome several challenges in text mining tasks. For non-English languages with poor knowledge sources such as Arabic, these challenges have become more salient especially for handling the natural language processing applications that require human annotation. In the Named Entity Recognition (NER) task, several researches have been introduced to address the complexity of Arabic in terms of morphological and syntactical variations. However, there are a small number of studies dealing with Classical Arabic (CA) that is the official language of Quran and Hadith. CA was also used for archiving the Islamic topics that contain a lot of useful information which could of great value if extracted. Therefore, in this paper, we introduce Classical Arabic Named Entity Recognition corpus as a new corpus of tagged data that can be useful for handling the issues in recognition of Arabic named entities. It is freely available and manual annotation by human experts, containing more than 7,000 Hadiths. Based on Islamic topics, we classify named entities into 20 types which include the specific-domain entities that have not been handled before such as Allah, Prophet, Paradise, Hell, and Religion. The differences between the standard and classical Arabic are described in details during this work. Moreover, the comprehensive statistical analysis is introduced to measure the factors that play important role in manual human annotation.",
    "Added By": "Zaid Alyafeai"
}