{
    "Name": "CEAP",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/CEAP",
    "Link": "https://sourceforge.net/projects/ceap-bp/",
    "License": "unknown",
    "Year": 2021,
    "Language": "ar",
    "Dialect": "ar-CLS: (Arabic (Classic))",
    "Domain": "web pages",
    "Form": "text",
    "Collection Style": "crawling",
    "Description": "It contains 50 TXT files recording poetry composition by various authors from 6th and 7th c. It was derived from two corpora: King Saud University Classical Arabic Corpus (KSUCAC) created by the team led by Maha S. Alrabiah (2014), and a corpus prepared by Abeer Alsheddi (2016).",
    "Volume": "50",
    "Unit": "documents",
    "Ethical Risks": "Low",
    "Provider": "",
    "Derived From": "Alrabiah, Maha S. (2014): \tKing Saud University Classical Arabic Corpus, Ar-Riyāḍ. Alsheddi, Abeer. (2016): \tEdit Distance Adapted to Natural Language Words. M.A. Thesis. Ar-Riyāḍ.",
    "Paper Title": "Cultural Conceptualizations of shame & dishonor in Early Poetic Arabic (EPA)",
    "Paper Link": "https://www.ejournals.eu/pliki/art/20227/",
    "Script": "Latn",
    "Tokenized": "No",
    "Host": "sourceforge",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "cultural conceptualizations of shame and dishonor",
    "Venue Title": "The Polish Journal of the Arts and Culture",
    "Citations": "",
    "Venue Type": "journal",
    "Venue Name": "The Polish Journal of the Arts and Culture. New Series}",
    "Authors": "Bartosz Pietrzak",
    "Affiliations": "Institute of Oriental Studies of Jagiellonian University in Krakow.",
    "Abstract": "Persisting in a binary relationship with honor, shame was an important element of the pre-Islamic Arabic social evaluation system. In my\nstudy, I analyzed the two most important EPA concepts parallel to\nEnglish shame – ˁayb and ˁār – applying the Cultural Linguistic approach. Based on the analyses on corpus of Early Arabic poetry and\nClassical Arabic dictionaries, I represented cultural schemata encoding the knowledge shared by pre-Islamic Arabs about those phenomena. The paper presents also metaphoric, metonymic, and image-schematic models, which account for the specifics of associated linguistic\nframes. Moreover, I posit a hypothesis on the existence of a schema\nsubsuming the honor- and shame-dishonor-related schemata in\nform of social evaluation of usefulness, which seems to correspond\nto the historical and linguistic data.",
    "Added By": "Mustafa Ghaleb"
}