{
    "Name": "CHILDES Egyptian Arabic Salama Corpus",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://childes.talkbank.org/access/Other/Arabic/Salama.html",
    "License": "unknown",
    "Year": 2015,
    "Language": "ar",
    "Dialect": "ar-EG: (Arabic (Egypt))",
    "Domain": "transcribed audio",
    "Form": "spoken",
    "Collection Style": "other",
    "Description": "Participants The Egyptian Arabic corpus includes data from ten children. Five boys and five girls were selected randomly with no language delay from a nursery in Alexandria. All children were normal and their first language is Arabic. The children ranged in age from 1;7 to 3;8 years (mean age2.77) studied cross-sectionally. 7 Children were visited in their kindergarten and 3 children at their home. The total number of utterances for all 10 children is 25,645. The adult part of the corpus contains 14,868 adult utterances 2,518 from the mother, 12,350 from the investigator and, 10,777 from children..  Data Collection A speech sample was collected based on spontaneous speech in unstructured interview. Data were elicited through conversation, naming objects, pictures around the child in his/her environment and use anything that children normally use rather than something new, and describe what they were doing while playing. We encourage natural interaction to include all styles, such as sitting with a child in the class, playing with the child, interacting with a mother, and/or teacher during the interaction and teaching process. The interview is increasingly semi-structured when a child is able to produce morphemes: for example, when a child produces a singular noun, the investigator, and/or a mother asked him about plural competence. Data was collected from 6 children in a nursery by the investigator, one child at home with a mother and an investigator, and 2 children at home by mothers. Audio recording of spontaneous speech produced by children is obtained in natural settings, in a child home or a kindergarten.",
    "Volume": "",
    "Unit": "hours",
    "Ethical Risks": "",
    "Provider": "Alexandria University",
    "Derived From": "",
    "Paper Title": "Building a spoken Arabic corpus for Egyptian children: data collection and transcription. Master's thesis. Alexandria University.",
    "Paper Link": "https://www.academia.edu/44521353/Building_a_spoken_Arabic_corpus_for_Egyptian_children_Data_collection_and_transcription",
    "Script": "Latn",
    "Tokenized": "No",
    "Host": "other",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "speech recognition",
    "Venue Title": "",
    "Citations": "",
    "Venue Type": "",
    "Venue Name": "",
    "Authors": "Heba Salama",
    "Affiliations": "Alexandria University",
    "Abstract": "",
    "Added By": "Kamel GAANOUN"
}