{
    "Name": "Corpus of Offensive Language in Arabic",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/Corpus_of_Offensive_Language_in_Arabic",
    "Link": "https://onedrive.live.com/?authkey=!ACDXj_ZNcZPqzy0&id=6EF6951FBF8217F9!105&cid=6EF6951FBF8217F9",
    "License": "unknown",
    "Year": 2018,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": [
        "social media"
    ],
    "Form": "text",
    "Collection Style": [
        "crawling"
    ],
    "Description": "a dataset of YouTube comments in Arabic, specifically designed to be used for thedetection of offensive language in a machine learning scenario",
    "Volume": 15050.0,
    "Unit": "sentences",
    "Ethical Risks": "High",
    "Provider": [
        "University of Limerick"
    ],
    "Derived From": [],
    "Paper Title": "Dataset Construction for the Detection of Anti-Social Behaviour in\r\nOnline Communication in Arabic",
    "Paper Link": "https://core.ac.uk/download/pdf/211161742.pdf",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "OneDrive",
    "Access": "Free",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "offensive language detection",
        "hate speech detection"
    ],
    "Venue Title": "ACLING",
    "Venue Type": "conference",
    "Venue Name": "nternational Conference on AI in Computational Linguistics",
    "Authors": [
        "Azalden Alakrot",
        "Liam Murray",
        "Nikola S. Nikolov"
    ],
    "Affiliations": [
        "",
        "",
        ""
    ],
    "Abstract": "Abstract Warning: this paper contains a range of words which may cause offence. In recent years, many studies target anti-social behaviour such as offensive language and cyberbullying in online communication. Typically, these studies collect data from various reachable sources, the majority of the datasets being in English. However, to the best of our knowledge, there is no dataset collected from the YouTube platform targeting Arabic text and overall there are only a few datasets of Arabic text, collected from other social platforms for the purpose of offensive language detection. Therefore, in this paper we contribute to this field by presenting a dataset of YouTube comments in Arabic, specifically designed to be used for the detection of offensive language in a machine learning scenario. Our dataset contains a range of offensive language and flaming in the form of YouTube comments. We document the labelling process we have conducted, taking into account the difference in the Arab dialects and the diversity of perception of offensive language throughout the Arab world. Furthermore, statistical analysis of the dataset is presented, in order to make it ready for use as a training dataset for predictive modelling.",
    "Added By": "Zaid Alyafeai"
}