{
    "Name": "COVID-FAKES",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/COVID_FAES_ar",
    "Link": "https://github.com/mohaddad/COVID-FAKES",
    "License": "unknown",
    "Year": 2020,
    "Language": "multilingual",
    "Dialect": "mixed",
    "Domain": "social media",
    "Form": "text",
    "Collection Style": "crawling and annotation(other)",
    "Description": "Bilingual (Arabic/English) COVID-19 Twitter dataset for misleading information detection",
    "Volume": "3,263,000",
    "Unit": "sentences",
    "Ethical Risks": "Medium",
    "Provider": "University of Victoria",
    "Derived From": "nan",
    "Paper Title": "COVID-19-FAKES: A Twitter (Arabic/English) Dataset for Detecting Misleading Information on COVID-19",
    "Paper Link": "https://link.springer.com/chapter/10.1007/978-3-030-57796-4_25",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "nan",
    "Test Split": "No",
    "Tasks": "fake news detection",
    "Venue Title": "INCoS",
    "Citations": "17.0",
    "Venue Type": "conference",
    "Venue Name": "International Conference on Intelligent Networking and Collaborative Systems",
    "Authors": "Mohamed K. Elhadad,K. F. Li,F. Gebali",
    "Affiliations": ",,",
    "Abstract": "This paper aims to aid the ongoing research efforts for combating the Infodemic related to COVID-19. We provide an automatically annotated, bilingual (Arabic/English) COVID-19 Twitter dataset (COVID-19-FAKES). This dataset has been continuously collected from February 04, 2020, to March 10, 2020. For annotating the collected dataset, we utilized the shared information on the official websites and the official Twitter accounts of the WHO, UNICEF, and UN as a source of reliable information, and the collected COVID-19 pre-checked facts from different fact-checking websites to build a ground-truth database. Then, the Tweets in the COVID-19-FAKES dataset are annotated using 13 different machine learning algorithms and employing 7 different feature extraction techniques. We are making our dataset publicly available to the research community (https://github.com/mohaddad/COVID-FAKES). This work will help researchers in understanding the dynamics behind the COVID-19 outbreak on Twitter. Furthermore, it could help in studies related to sentiment analysis, the analysis of the propagation of misleading information related to this outbreak, the analysis of users’ behavior during the crisis, the detection of botnets, the analysis of the performance of different classification algorithms with various feature extraction techniques that are used in text mining. It is worth noting that, in this paper, we use the terms of misleading information, misinformation, and fake news interchangeably.",
    "Added By": "Zaid Alyafeai"
}