{
    "Name": "DAICT ",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://www.hbku.edu.qa/en/DAICT",
    "License": "custom",
    "Year": 2020,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": "social media",
    "Form": "text",
    "Collection Style": "crawling",
    "Description": "The dataset includes 5,588 tweets -- written in both MSA and dialectual Arabic -- manually annotated by two professional linguistics from HBKU",
    "Volume": "5,588",
    "Unit": "sentences",
    "Ethical Risks": "Medium",
    "Provider": "Hamad Bin Khalifa University",
    "Derived From": "",
    "Paper Title": "DAICT: A Dialectal Arabic Irony Corpus Extracted from Twitter\r",
    "Paper Link": "http://www.lrec-conf.org/proceedings/lrec2020/pdf/2020.lrec-1.768.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "other",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "irony detection",
    "Venue Title": "LREC",
    "Citations": "15.0",
    "Venue Type": "conference",
    "Venue Name": "International Conference on Language Resources and Evaluation",
    "Authors": "Ines Abbes,W. Zaghouani,Omaima El-Hardlo,Faten Ashour",
    "Affiliations": ",,,",
    "Abstract": "Identifying irony in user-generated social media content has a wide range of applications; however to date Arabic content has received limited attention. To bridge this gap, this study builds a new open domain Arabic corpus annotated for irony detection. We query Twitter using irony-related hashtags to collect ironic messages, which are then manually annotated by two linguists according to our working definition of irony. Challenges which we have encountered during the annotation process reflect the inherent limitations of Twitter messages interpretation, as well as the complexity of Arabic and its dialects. Once published, our corpus will be a valuable free resource for developing open domain systems for automatic irony recognition in Arabic language and its dialects in social media text.",
    "Added By": "Zaid Alyafeai"
}