{
    "Name": "DARES",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://github.com/DamithDR/arabic-readability-assessment",
    "License": "CC BY-NC 4.0",
    "Year": 2024,
    "Language": "ar",
    "Dialect": "ar-MSA: (Arabic (Modern Standard Arabic))",
    "Domain": "books",
    "Form": "text",
    "Collection Style": "other",
    "Description": "DARES is a dataset for Arabic readability estimation based on Saudi school textbooks. It contains 13,335 instances of text, focusing on the readability levels of different educational levels (grades 1-12). It is organized into two main subtasks: (a) Coarse-grained readability, classifying texts into broad educational levels (elementary, intermediate, high school), and (b) Fine-grained readability, classifying texts into individual grade levels.",
    "Volume": "13,335",
    "Unit": "tokens",
    "Ethical Risks": "Low",
    "Provider": "Multiple Institutions",
    "Derived From": "Saudi school textbooks (grades 1-12)",
    "Paper Title": "DARES: Dataset for Arabic Readability Estimation of School Materials",
    "Paper Link": "https://aclanthology.org/2024.determit-1.10.pdf",
    "Script": "Arab",
    "Tokenized": "Yes",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": "Yes",
    "Tasks": "readability assessment",
    "Venue Title": "LREC-COLING",
    "Citations": "",
    "Venue Type": "workshop",
    "Venue Name": "Workshop on DeTermIt! Evaluating Text Difficulty in a Multilingual Context @ LREC-COLING 2024",
    "Authors": "Mo El-Haj, Sultan Almujaiwel, Damith Premasiri, Tharindu Ranasinghe, Ruslan Mitkov",
    "Affiliations": "Lancaster University, King Saud University, Aston University",
    "Abstract": "The DARES dataset is introduced as a resource for assessing Arabic text readability in the context of Saudi educational materials. It focuses on readability levels across different educational stages (grades 1-12) and consists of coarse-grained and fine-grained tasks. The dataset was used to fine-tune transformer models for readability estimation, demonstrating high performance in classifying educational materials by their readability level.",
    "Added By": "Maryam Al Emadi"
}