{
    "Name": "DefArabicQA",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://sites.google.com/site/anlprg/outils-et-corpus-realises",
    "License": "unknown",
    "Year": 2010,
    "Language": "ar",
    "Dialect": "Modern Standard Arabic",
    "Domain": "wikipedia",
    "Form": "text",
    "Collection Style": "crawling and annotation(other)",
    "Description": "2000 snippets returned by Google search engine and Wikipedia Arabic version\nand a set of 50 organization definition questions",
    "Volume": "2,000",
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": "Multiple Institutions",
    "Derived From": "",
    "Paper Title": "DefArabicQA: Arabic Definition Question Answering System \r",
    "Paper Link": "http://personales.upv.es/prosso/resources/TriguiEtAl_LREC10.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "other",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "question answering",
    "Venue Title": "LREC",
    "Citations": "51.0",
    "Venue Type": "conference",
    "Venue Name": "International Conference on Language Resources and Evaluation",
    "Authors": "Omar Trigui,L. Belguith,P. Rosso",
    "Affiliations": ",,",
    "Abstract": "Today the Web is the largest resource of knowledge and, therefore, sometimes this makes it difficult to find precise information. Current search engines can only return ranked snippets containing the effective answers to a query user. But, they can not return the exact answers. Question Answering systems present the solution to obtain effective and exact answers to a user question asked in natural language question instead of keywords query. Unfortunately, Question Answering task for the Arabic language has not been investigated enough in the last decade, compared to other languages. In this paper, we tackle the definition Question Answering task for the Arabic language. We propose an Arabic definitional Question Answering system based on a pattern approach to identify exact and accurate definitions about organization using Web resources. We experimented this system using 2000 snippets returned by Google search engine and Wikipedia Arabic version and a set of 50 organization definition questions. The obtained results are very encouraging: (90%) of the questions used have complete (vital) definitions in the top-five answers and (64%) of them have complete definitions in the top-one answer. MRR was (0.81).",
    "Added By": "Zaid Alyafeai"
}