{
    "Name": "Dialectal Arabic Code-Switching Dataset",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/Dialectal_Speech_Code_Switching",
    "Link": "https://github.com/qcri/Arabic_speech_code_switching",
    "License": "MIT License",
    "Year": 2020,
    "Language": "ar",
    "Dialect": "Egypt",
    "Domain": [
        "other"
    ],
    "Form": "text",
    "Collection Style": [
        "human annotation"
    ],
    "Description": "The dataset studies code-switching between Egyptian and modern standard Arabic in broadcast domain.",
    "Volume": 2.0,
    "Unit": "hours",
    "Ethical Risks": "Medium",
    "Provider": [
        "QCRI"
    ],
    "Derived From": [
        "ADI-5"
    ],
    "Paper Title": "Effects of Dialectal Code-Switching on Speech Modules: A Study using Egyptian Arabic Broadcast Speech",
    "Paper Link": "http://www.interspeech2020.org/uploadfile/pdf/Wed-1-10-5.pdf",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "codeswitch detection"
    ],
    "Venue Title": "",
    "Venue Type": "conference",
    "Venue Name": "",
    "Authors": [
        "Chowdhury",
        "Shammur Absar  and Samih",
        "Younes and Eldesouki",
        "Mohamed and Ali",
        "Ahmed"
    ],
    "Affiliations": [],
    "Abstract": "The intra-utterance code-switching (CS) is defined as the alternation between two or more languages within the same utterance. Despite the fact that spoken dialectal code-switching (DCS) is more challenging than CS, it remains largely unexplored. In this study, we describe a method to build the first spoken DCS corpus. The corpus is annotated at the token-level minding both linguistic and acoustic cues for dialectal Arabic. For detailed analysis, we study Arabic automatic speech recognition (ASR), Arabic dialect identification (ADI), and natural language processing (NLP) modules for the DCS corpus. Our results highlight the importance of lexical information for discriminating the DCS labels. We observe that the performance of different models is highly dependent on the degree of code-mixing at the token-level as well as its complexity at the utterance-level.",
    "Added By": "Nouamane Tazi"
}