{
    "Name": "EDGAD",
    "Subsets": [],
    "HF Link": "nan",
    "Link": "https://github.com/shery91/Egyptian-Dialect-Gender-Annotated-Dataset",
    "License": "unknown",
    "Year": 2019,
    "Language": "ar",
    "Dialect": "ar-EG: (Arabic (Egypt))",
    "Domain": "social media",
    "Form": "text",
    "Collection Style": "crawling and annotation(other)",
    "Description": "Egyptian Dialect Gender Annotated Dataset (EDGAD) obtained from Twitter as well as a proposed text classification solution for the Gender Identification (GI) problem. The dataset consists of 70,000 tweets per gender",
    "Volume": "140,000",
    "Unit": "sentences",
    "Ethical Risks": "Medium",
    "Provider": "Cairo University",
    "Derived From": "nan",
    "Paper Title": "Gender identification of egyptian dialect in twitter",
    "Paper Link": "https://www.sciencedirect.com/science/article/pii/S1110866518302044",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "nan",
    "Test Split": "No",
    "Tasks": "gender identification",
    "Venue Title": "EIJ",
    "Citations": "6.0",
    "Venue Type": "journal",
    "Venue Name": "Egyptian Informatics Journal",
    "Authors": "Shereen Hussein,Mona Farouk,E. Hemayed",
    "Affiliations": ",,",
    "Abstract": "Abstract Despite the widespread of social media among all age groups in Arabic countries, the research directed towards Author Profiling (AP) is still in its early stages. This paper provides an Egyptian Dialect Gender Annotated Dataset (EDGAD) obtained from Twitter as well as a proposed text classification solution for the Gender Identification (GI) problem. The dataset consists of 70,000 tweets per gender. In text classification, a Mixed Feature Vector (MFV) with different stylometric and Egyptian Arabic Dialect (EAD) language-specific features is proposed, in addition to N-Gram Feature Vector (NFV). Ensemble weighted average is applied to the Random Forest (RF) with MFV and Logistic Regression (LR) with NFV. The achieved gender identification accuracy is 87.6%.",
    "Added By": "Zaid Alyafeai"
}