{
    "Name": "ElecMorocco2016",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/ElecMorocco",
    "Link": "https://github.com/sentiprojects/ElecMorocco2016",
    "License": "unknown",
    "Year": 2016,
    "Language": "ar",
    "Dialect": "Morocco",
    "Domain": [
        "social media"
    ],
    "Form": "text",
    "Collection Style": [
        "crawling"
    ],
    "Description": "A sentiment analysis dataset containing 10254 Arabic facebook comments about the Moroccan elections of 2016. The comments are written in standard arabic and morrocan dialect.",
    "Volume": 10000.0,
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": [],
    "Derived From": [],
    "Paper Title": "Collecting and Processing Arabic Facebook Comments for Sentiment Analysis",
    "Paper Link": "https://link.springer.com/chapter/10.1007/978-3-319-66854-3_20",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "sentiment analysis"
    ],
    "Venue Title": "MEDI",
    "Venue Type": "conference",
    "Venue Name": "International Conference on Model and Data Engineering",
    "Authors": [
        "Abdeljalil Elouardighi",
        "Mohcine Maghfour",
        "Hafdalla Hammia"
    ],
    "Affiliations": [
        "Mohammed V University",
        "Hassan 1st University"
    ],
    "Abstract": "Social networks platforms such as Facebook are becoming one of the most powerful sources for information. The produced and shared data are important in volume, in velocity and in variety. Processing these data in the raw state to extract useful information can be a very difficult task and a big challenge. Furthermore, the Arabic language under its modern standard or dialectal shape is one of the languages producing an important quantity of data in social networks and the least analyzed. The characteristics and the specificity of the Arabic language present a big challenge for sentiment analysis, especially if this analysis is performed on Arabic Facebook comments. In this paper, we present a methodology that we have elaborated, for collecting and preprocessing Facebook comments written in Modern Standard Arabic (MSA) or in Moroccan Dialectal Arabic (MDA) for Sentiment Analysis (SA) using supervised classification methods. In this methodology, we have detailed the processing applied to the comments’ text as well as various schemes of features’ construction (words or groups of words) useful for supervised sentiments’ classification. This methodology was tested on comments written in MSA or in MDA collected from Facebook for the sentiment analysis on a political phenomenon. The experiments’ results obtained are promising and this encourages us to continue working on this topic.",
    "Added By": "Abderrahmane Issam"
}