{
    "Name": "FloDusTA",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/FloDusTA_Dust_Storm",
    "Link": "https://github.com/BatoolHamawi/FloDusTA",
    "License": "CC BY 4.0",
    "Year": 2020,
    "Language": "ar",
    "Dialect": "Saudi Arabia",
    "Domain": "social media",
    "Form": "text",
    "Collection Style": "crawling and annotation(other)",
    "Description": "FloDusTA is a dataset of annotated tweets collected for the purpose of developing an event detection system. The dataset contains tweets written in both the MSA and Saudi dialect. Labels are: flood, dust storm, traffic accident, and non-event.",
    "Volume": "8,998",
    "Unit": "sentences",
    "Ethical Risks": "Medium",
    "Provider": "Umm Al-Qura University - Saudi Arabia",
    "Derived From": "",
    "Paper Title": "FloDusTA: Saudi Tweets Dataset for Flood, Dust Storm, and Traffic Accident Events",
    "Paper Link": "https://aclanthology.org/2020.lrec-1.174.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "event detection",
    "Venue Title": "LREC",
    "Citations": "2.0",
    "Venue Type": "conference",
    "Venue Name": "Language Resources and Evaluation Conference",
    "Authors": "Btool Hamoui, Mourad Mars, Khaled Almotairi",
    "Affiliations": "Umm Al-Qura University - Saudi Arabia",
    "Abstract": "The rise of social media platforms makes it a valuable information source of recent events and users’ perspective towards them. Twitter has been one of the most important communication platforms in recent years. Event detection, one of the information extraction aspects, involves identifying specified types of events in the text. Detecting events from tweets can help to predict real-world events precisely. A serious challenge that faces Arabic event detection is the lack of Arabic datasets that can be exploited in detecting events. This paper will describe FloDusTA, which is a dataset of tweets that we have built for the purpose of developing an event detection system. The dataset contains tweets written in both Modern Standard Arabic and Saudi dialect. The process of building the dataset starting from tweets collection to annotation by human annotators will be present. The tweets are labeled with four labels: flood, dust storm, traffic accident, and non-event. The dataset was tested for classification and the result was strongly encouraging.\n",
    "Added By": "Mourad Mars"
}