{
    "Name": "HateSpeechArabic",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://zenodo.org/records/14669917",
    "License": "CC BY 4.0",
    "Year": 2025,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": [
        "social media"
    ],
    "Form": "text",
    "Collection Style": [
        "crawling",
        "human annotation"
    ],
    "Description": "A multilabel Arabic hate speech corpus of 10,000 tweets annotated for offensive content and hate targets.",
    "Volume": 10000.0,
    "Unit": "sentences",
    "Ethical Risks": "High",
    "Provider": [
        "Northwestern University in Qatar",
        "Hamad Bin Khalifa University"
    ],
    "Derived From": [],
    "Paper Title": "An Annotated Corpus of Arabic Tweets for Hate Speech Analysis",
    "Paper Link": "https://arxiv.org/pdf/2505.11969",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "zenodo",
    "Access": "Upon-Request",
    "Cost": "",
    "Test Split": true,
    "Tasks": [
        "offensive language detection"
    ],
    "Venue Title": "arXiv",
    "Venue Type": "preprint",
    "Venue Name": "",
    "Authors": [
        "Wajdi Zaghouani",
        "Md. Rafiul Biswas"
    ],
    "Affiliations": [
        "Northwestern University in Qatar",
        "Hamad Bin Khalifa University"
    ],
    "Abstract": "Identifying hate speech content in the Arabic language is challenging due to the rich quality of dialectal variations. This study introduces a multilabel hate speech dataset in the Arabic language. We have collected 10,000 Arabic tweets and annotated each tweet, whether it contains offensive content or not. If a text contains offensive content, we further classify it into different hate speech targets such as religion, gender, politics, ethnicity, origin, and others. A text can contain either single or multiple targets. Multiple annotators are involved in the data annotation task. We calculated the inter-annotator agreement, which was reported to be 0.86 for offensive content and 0.71 for multiple hate speech targets. Finally, we evaluated the data annotation task by employing a different transformers-based model in which AraBERTv2 outperformed with a micro-F1 score of 0.7865 and an accuracy of 0.786.",
    "Added By": "Zaid Alyafeai"
}