{
    "Name": "IDRISI-R",
    "Subsets": [
        {
            "Name": "Arabic gold",
            "Dialect": "mixed",
            "Volume": "4,593",
            "Unit": "sentences"
        },
        {
            "Name": "Arabic silver",
            "Dialect": "mixed",
            "Volume": "1,187,123",
            "Unit": "sentences"
        },
        {
            "Name": "English gold",
            "Dialect": "mixed",
            "Volume": "20,514",
            "Unit": "sentences"
        },
        {
            "Name": "English silver",
            "Dialect": "mixed",
            "Volume": "56,682",
            "Unit": "sentences"
        }
    ],
    "HF Link": "",
    "Link": "https://github.com/rsuwaileh/IDRISI",
    "License": "custom",
    "Year": 2022,
    "Language": "multilingual",
    "Dialect": "mixed",
    "Domain": "social media",
    "Form": "text",
    "Collection Style": "crawling",
    "Description": "IDRISI-R is the largest-scale publicly-available Twitter Location Mention Recognition (LMR) dataset, in both English and Arabic languages. It contains 41 disaster events of different types such as floods, fires, etc. In addition to tagging LMs in text, the LMs are labeled for location types such as countries, cities, streets, POIs, etc.",
    "Volume": "1,268,912",
    "Unit": "sentences",
    "Ethical Risks": "Medium",
    "Provider": "Qatar University, QCRI, Hamad Bin Khalifa University",
    "Derived From": "Kawarith and humAID datasets",
    "Paper Title": "(Under review) IDRISI-R: Large-scale English and Arabic Location Mention Recognition Datasets for Disaster Response over Twitter",
    "Paper Link": "",
    "Script": "Arab-Latin",
    "Tokenized": "Yes",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": "Yes",
    "Tasks": "named entity recognition, crisis detection, machine translation",
    "Venue Title": "",
    "Citations": "",
    "Venue Type": "journal",
    "Venue Name": "",
    "Authors": "Reem Suwaileh, Tamer Elsayed, Muhammad Imran",
    "Affiliations": "Computer Science and Engineering Department, College of Engineering, Qatar University, Doha, Qatar. Qatar Computing Research Institute (QCRI), Hamad Bin Khalifa University (HBKU), Doha, Qatar",
    "Abstract": "While utilizing Twitter data for crisis management, a critical challenge that hinders authorities' response is the scarcity of geotagged messages. Although studies show the presence of toponyms in tweets and their effectiveness as alternative information to geotagged messages, limited focus has been given to location mention recognition in tweets. In fact, the community lacks a standard dataset to thrive research towards building robust models and solutions. To bridge this gap, we present two human-labeled datasets for the location mention recognition task in text messages, particularly tweets. The human annotation task labels toponym spans and assigns a location type (e.g., country, state, city) to them. The datasets contain tweets from 41 large-scale disaster events (e.g., floods, earthquakes) covering a wide geographical area of English and Arabic-speaking countries. Moreover, we benchmark the datasets using standard and deep learning models and present rigorous quantitative and qualitative analysis to highlight their superiority over past efforts. Last but not least, the trained models are used to process raw data comprising millions of tweets and offered as a silver dataset. ",
    "Added By": "Reem Suwaileh"
}