{
    "Name": "International Corpus of Arabic",
    "Subsets": [],
    "HF Link": "",
    "Link": "http://www.bibalex.org/ica/ar/",
    "License": "unknown",
    "Year": 2007,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": "other",
    "Form": "text",
    "Collection Style": "other",
    "Description": "There are two points of view about the need for corpora. The first one says that there can not be any corpora, however large, that contain information about all of the areas of any language lexicon and grammar of that language. The second point of view is that every corpus, however small, has taught the person facts that could not be imagined finding out about in any other way. ",
    "Volume": "",
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": "Alexandria University",
    "Derived From": "",
    "Paper Title": "Building an International Corpus of Arabic (ICA): Progress of Compilation Stage",
    "Paper Link": "http://www.bibalex.org/isis/UploadedFiles/Publications/Building%20an%20Intl%20corpus%20of%20arabic.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "other",
    "Access": "Upon-Request",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "text generation, language modeling",
    "Venue Title": "",
    "Citations": "35.0",
    "Venue Type": "conference",
    "Venue Name": "7th international conference on language engineering, Cairo, Egypt",
    "Authors": " Sameh Alansary, Magdy Nagi, Noha Adly",
    "Affiliations": "",
    "Abstract": "This paper focuses on three axes. The first ax is gives a survey of the importance of corpora in language studies e.g. lexicography, grammar, sem antics, Natural Language Processing and other areas. The second axis demonstrates how the A rabic language lacks textual resources, such as corpora and tools for corpus analysis and t he effected of this lack on the quality of Arabic language applications. There are rarely succ essful trials in compiling Arabic corpora, therefore, the third axis presents the technical de sign of the International Corpus of Arabic (ICA), a newly established representative corpus of Arabic that is intended to cover the Arabic language as being used all over the Arab world. The corpus is planned to support various Arabic studies that depends on authentic data, in a ddition to building Arabic Natural Language Processing Applications.",
    "Added By": "Abdelrahman Rezk"
}