{
    "Name": "KACST",
    "Subsets": [],
    "HF Link": "nan",
    "Link": "http://www.kacstac.org.sa",
    "License": "unknown",
    "Year": 2015,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": "other",
    "Form": "text",
    "Collection Style": "crawling",
    "Description": "The KACST Arabic corpus comprises more than 700 million words from the pre-Islamic era to the present day (a period covering more than 1,500 years), collected from 10 diverse mediums.",
    "Volume": "7,000,000",
    "Unit": "tokens",
    "Ethical Risks": "Medium",
    "Provider": "KACST",
    "Derived From": "http://shamela.ws/  http://saaid.net/  http://www.awu.sy/  https://uqu.edu.sa/page/ar/518  http://www.kfu.edu.sa/ar/departments/sjournal/Pages/Home.aspx  http://www.boe.gov.sa/MainLaws.aspx?lang=en  http://www.arablegalportal.org/  http://www.alwatan.com.sa http://rosa-magazine.com/  http://www.spa.gov.sa/",
    "Paper Title": "A 700M+ Arabic corpus: KACST Arabic corpus design and construction",
    "Paper Link": "https://link.springer.com/article/10.1007/s10579-014-9284-1",
    "Script": "Arab",
    "Tokenized": "Yes",
    "Host": "other",
    "Access": "Free",
    "Cost": "nan",
    "Test Split": "No",
    "Tasks": "natural language inference",
    "Venue Title": "LREC",
    "Citations": "20.0",
    "Venue Type": "journal",
    "Venue Name": "International Conference on Language Resources and Evaluation",
    "Authors": "Al-Thubaity, A.O",
    "Affiliations": "King Abdulaziz City for Science & Technology (KACST) university",
    "Abstract": "Compared with English, Arabic is a poorly-resourced language within the field of corpus linguistics. A lack of sufficient data and research has negatively affected Arabic corpus-based researchers and natural language processing practitioners. Although a number of Arabic corpora have been developed in recent years, the overall situation has improved little. The aim of this paper is twofold. First, it reviews 14 Arabic corpora categorized by their designated purpose, target language, mode of text, size, text date, location, text type/medium, text domain, representativeness, and balance. The review also describes the availability of the reviewed corpora, the presence of tokenization, lemmatization and tagging, and whether there are any tools available to search and explore them. Second, it introduces the King Abdulaziz City for Science and Technology (KACST) Arabic corpus, which was designed and created to overcome the limitations of existing Arabic corpora. The KACST Arabic corpus is a large and diverse Arabic corpus with clearly defined design criteria. It is carefully sampled, and its contents are classified based on time, region, medium, domain, and topic, and it can be searched and explored using these classifications. The KACST Arabic corpus comprises more than 700 million words from the pre-Islamic era to the present day (a period covering more than 1,500 years), collected from 10 diverse mediums. Each text has been further classified more specifically into domains and topics. The KACST Arabic corpus is freely available to explore on the Internet (http://www.kacstac.org.sa) using a variety of tools.",
    "Added By": "Jezia Zakraoui"
}