{
    "Name": "KalamDZ",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/KalamDZ",
    "Link": "https://github.com/LIM-MoDos/KalamDZ",
    "License": "unknown",
    "Year": 2017,
    "Language": "ar",
    "Dialect": "Algeria",
    "Domain": "other",
    "Form": "spoken",
    "Collection Style": "crawling",
    "Description": "8 major Algerian Arabic sub-dialects with 4881\r\nspeakers and more than 104.4 hours segmented in utterances of at least 6 s",
    "Volume": "104",
    "Unit": "hours",
    "Ethical Risks": "Low",
    "Provider": "Laboratoire d’informatique et Mathématiques\r\nUniversité ",
    "Derived From": "",
    "Paper Title": "Toward a Web-based Speech Corpus for Algerian Arabic Dialectal\r\nVarieties",
    "Paper Link": "https://aclanthology.org/W17-1317.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "dialect identification",
    "Venue Title": "WANLP",
    "Citations": "10.0",
    "Venue Type": "workshop",
    "Venue Name": "Arabic Natural Language Processing Workshop",
    "Authors": "Soumia Bougrine,Aicha Chorana,Abdallah Lakhdari,H. Cherroun",
    "Affiliations": ",,,",
    "Abstract": "The success of machine learning for automatic speech processing has raised the need for large scale datasets. However, collecting such data is often a challenging task as it implies significant investment involving time and money cost. In this paper, we devise a recipe for building largescale Speech Corpora by harnessing Web resources namely YouTube, other Social Media, Online Radio and TV. We illustrate our methodology by building KALAM’DZ, An Arabic Spoken corpus dedicated to Algerian dialectal varieties. The preliminary version of our dataset covers all major Algerian dialects. In addition, we make sure that this material takes into account numerous aspects that foster its richness. In fact, we have targeted various speech topics. Some automatic and manual annotations are provided. They gather useful information related to the speakers and sub-dialect information at the utterance level. Our corpus encompasses the 8 major Algerian Arabic sub-dialects with 4881 speakers and more than 104.4 hours segmented in utterances of at least 6 s.",
    "Added By": "Zaid Alyafeai"
}