{
    "Name": "Khaleej-2004",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/khaleej_2004",
    "Link": "https://sourceforge.net/projects/arabiccorpus/files/",
    "License": "unknown",
    "Year": 2004,
    "Language": "ar",
    "Dialect": "ar-MSA: (Arabic (Modern Standard Arabic))",
    "Domain": "news articles",
    "Form": "text",
    "Collection Style": "crawling",
    "Description": "Extracted from the daily Arabic news paper Akhbar al Khaleej, it includes 5120 news articles corresponding to 2,855,069 words covering four topics sport, local news, international news and economy",
    "Volume": "5,690",
    "Unit": "documents",
    "Ethical Risks": "Low",
    "Provider": "INRIA",
    "Derived From": "nan",
    "Paper Title": "Comparison of Topic Identification methods for Arabic Language",
    "Paper Link": "https://hal.inria.fr/inria-00000448/document",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "sourceforge",
    "Access": "Free",
    "Cost": "nan",
    "Test Split": "No",
    "Tasks": "topic classification",
    "Venue Title": "nan",
    "Citations": "nan",
    "Venue Type": "preprint",
    "Venue Name": "nan",
    "Authors": "M. Abbas and K. Smaili",
    "Affiliations": "INRIA-LORIA",
    "Abstract": "In this paper we present two well-known methods for topic identification. The first one is a TFIDF classifier approach, and the second one is a based machine learning approach which is called Support Vector Machines (SVM). In our knowledge, we do not know several works on Arabic topic identification. So that we decide to investigate in this article. The corpus we used is extracted from the daily Arabic newspaper it Akhbar Al Khaleej, it includes 5120 news articles corresponding to 2.855.069 words covering four topics : sport, local news, international news and economy. According to our experiments, the results are encouraging both for SVM and TFIDF classifier, however we have noticed the superiority of the SVM classifier and its high capability to distinguish topics.\n",
    "Added By": "Zaid Alyafeai"
}