{
    "Name": "Khawas",
    "Subsets": [],
    "HF Link": "nan",
    "Link": "https://sourceforge.net/projects/kacst-acptool/",
    "License": "unknown",
    "Year": 2013,
    "Language": "ar",
    "Dialect": "ar-MSA: (Arabic (Modern Standard Arabic))",
    "Domain": "news articles",
    "Form": "text",
    "Collection Style": "crawling",
    "Description": "a corpus containing more than two million words and a corpora processing tool that is specifically designed for Arabic",
    "Volume": "2,910",
    "Unit": "documents",
    "Ethical Risks": "Low",
    "Provider": "Multiple Institutions ",
    "Derived From": "nan",
    "Paper Title": "New Language Resources for Arabic: Corpus Containing More Than Two Million Words and a Corpus Processing Tool",
    "Paper Link": "https://ieeexplore.ieee.org/abstract/document/6646005",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "sourceforge",
    "Access": "Free",
    "Cost": "nan",
    "Test Split": "No",
    "Tasks": "topic classification",
    "Venue Title": "IALP",
    "Citations": "19.0",
    "Venue Type": "conference",
    "Venue Name": "International Conference on Asian Language Processing",
    "Authors": "A. Al-Thubaity,Marwa Khan,Manal Al-Mazrua,Maram Al-Mousa",
    "Affiliations": ",,,",
    "Abstract": "Arabic is a resource-poor language relative to other languages with a similar number of speakers. This situation negatively affects corpus-based linguistic studies in Arabic and, to a lesser extent, Arabic language processing. This paper presents a brief overview of recent freely available Arabic corpora and corpora processing tools, and it examines some of the issues that may be preventing Arabic linguists from using the same. These issues reveal the need for new language resources to enrich and foster Arabic corpus-based studies. Accordingly, this paper introduces the design of a new Arabic corpus that includes modern standard Arabic varieties based on newspapers from all Arab countries and that comprises more than two million words, it also describes the main features of a corpus processing tool specifically designed for Arabic, called \"Khawas ÛæÇÕ\" (\"diver\" in English). Khawas provides more features than any other freely available corpus processing tool for Arabic, including n-gram frequency and concordance, collocations, and statistical comparison of two corpora. Finally, we outline modifications and improvements that could be made in future works.",
    "Added By": "Zaid Alyafeai"
}