{
    "Name": "KSU Rich Arabic Speech Database\r",
    "Subsets": [],
    "HF Link": "nan",
    "Link": "https://catalog.ldc.upenn.edu/LDC2014S02",
    "License": "custom",
    "Year": 2013,
    "Language": "ar",
    "Dialect": "ar-MSA: (Arabic (Modern Standard Arabic))",
    "Domain": "transcribed audio",
    "Form": "spoken",
    "Collection Style": "crawling and annotation(other)",
    "Description": "it has 752 speakers; the speakers are from different\r\nethnic groups: Saudis, Arabs, and non-Arabs;",
    "Volume": "590",
    "Unit": "hours",
    "Ethical Risks": "Low",
    "Provider": "King Saud University ",
    "Derived From": "nan",
    "Paper Title": "KSU Rich Arabic Speech Database\r",
    "Paper Link": "https://catalog.ldc.upenn.edu/docs/LDC2014S02/KSU-Rich-Arabic-Speech-Database.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "LDC",
    "Access": "With-Fee",
    "Cost": "2000 $",
    "Test Split": "No",
    "Tasks": "speech recognition",
    "Venue Title": "other",
    "Citations": "20.0",
    "Venue Type": "preprint",
    "Venue Name": "nan",
    "Authors": "M. Alsulaiman,G. Muhammad,M. Bencherif,A. Mahmood,Z. Ali",
    "Affiliations": ",,,,",
    "Abstract": "Arabic is one of the major languages in the world. Unfortunately not so much research in Arabic speaker recognition has been done. One main reason for this lack of research is the unavailability of rich Arabic speech databases. In this paper, we present a rich and comprehensive Arabic speech database that we developed for the Arabic speaker / speech recognition research and/or applications. The database is rich in different aspects: (a) it has 752 speakers; (b) the speakers are from different ethnic groups: Saudis, Arabs, and non-Arabs; (c) utterances are both read text and spontaneous; (d) scripts are of different dimensions, such as, isolated words, digits, phonetically rich words, sentences, phonetically balanced sentences, paragraphs, etc.; (e) different sets of microphones with medium and high quality; (f) telephony and non-telephony speech; (g) three different recording environments: office, sound proof room, and cafeteria; (h) three different sessions, where the recording sessions are scheduled at least with 2 weeks interval. Because of the richness of this database, it can be used in many Arabic, and non-Arabic, speech processing researches, such as speaker / speech recognition, speech analysis, accent identification, ethnic groups / nationality recognition, etc. The richness of the database makes it a valuable resource for research in Arabic speech processing in particular and for research in speech processing in general. The database was carefully manually verified. The manual verification was complemented with automatic verification. Validation was performed on a subset of the database where the recognition rate reached 100% for Saudi speakers and 96% for non-Saudi speakers by using a system with 12 Mel frequency Cepstral coefficients, and 32 Gaussian mixtures.",
    "Added By": "Zaid Alyafeai"
}