{
    "Name": "KSUCCA Corpus",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/KSUCCA",
    "Link": "https://sourceforge.net/projects/ksucca-corpus/",
    "License": "unknown",
    "Year": 2013,
    "Language": "ar",
    "Dialect": "Classical Arabic",
    "Domain": "books",
    "Form": "text",
    "Collection Style": "crawling",
    "Description": "KSUCCA is a pioneering 50+ million word corpus that captures the culture of a nation.",
    "Volume": "410",
    "Unit": "documents",
    "Ethical Risks": "Low",
    "Provider": "King Saud University",
    "Derived From": "",
    "Paper Title": "The Design and Construction of the 50 Million Words KSUCCA ",
    "Paper Link": "https://eprints.whiterose.ac.uk/81860/1/TheDesignConstruction50MillionWordKSUCCA.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "sourceforge",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "semantic similarity",
    "Venue Title": "other",
    "Citations": "30.0",
    "Venue Type": "preprint",
    "Venue Name": "",
    "Authors": "Maha AlRabiah,A. Al-Salman,E. Atwell",
    "Affiliations": ",,",
    "Abstract": "In this paper, we report the design and construction of King Saud University Corpus of Classical Arabic (KSUCCA), which is part of ongoing research that attempts to study the meanings of words used in the holy Quran, through analysis of their distributional semantics in contemporaneous texts. The holy Quranic text was revealed in pure Classical Arabic, which forms the basis of Arabic linguistic theory and which is well understood by the educated Arabic reader. Therefore, it is necessary to investigate the distributional lexical semantics of the Quran's words in the light of similar texts (corpus) that are written in pure Classical Arabic. To the best of our knowledge, there exist only two corpora of Classical Arabic; one is part of the King Abdulaziz City for Science and Technology Arabic Corpus (KACST Arabic Corpus) and the other is the Classical Arabic Corpus (CAC) (Elewa, 2009). However, neither of the two corpora is adequate for our research; the former does not cover many genres such as: Linguistics, Literature, Science, Sociology and Biography; and it only contains 17+ million words, so it is not very large. While the latter is even smaller with only 5 million words. Therefore, we made an effort to carefully design and compose our own corpus bearing in mind that it should be large enough, balanced, and representative so that any result obtained from it can be generalized for Classical Arabic. In addition, we tried to make the design general enough in order to make the corpus also appropriate for other research.",
    "Added By": "Mustafa Ghaleb"
}