{
    "Name": "KUNUZ",
    "Subsets": [],
    "HF Link": "",
    "Link": "http://jarir.tn/kunuzcorpus",
    "License": "CC BY-NC-ND 4.0",
    "Year": 2019,
    "Language": "multilingual",
    "Dialect": "Classical Arabic",
    "Domain": "other",
    "Form": "text",
    "Collection Style": "manual curation",
    "Description": "KUNUZ is an XMLized version of Sahih Albukhari, the most authentic hadith book.",
    "Volume": "7,563",
    "Unit": "documents",
    "Ethical Risks": "Low",
    "Provider": "Joint group for Artificial Reasoning and Information Retrieval",
    "Derived From": "",
    "Paper Title": "KUNUZ: a Multi-purpose Reusable Test Collection for Classical Arabic Document Engineering",
    "Paper Link": "https://ieeexplore.ieee.org/document/9035212",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "other",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "machine translation, cross-lingual information retrieval, named entity recognition, information retrieval, language identification,  document classification, information extraction",
    "Venue Title": "AICCSA",
    "Citations": "2.0",
    "Venue Type": "conference",
    "Venue Name": "International Conference on Computer Systems and Applications",
    "Authors": "Ibrahim Bounhas, Souheila Ben Guirat",
    "Affiliations": "LISI: Laboratory of Computer science for industrial systems, Carthage University, Tunisia",
    "Abstract": "Corpora   are   important   resources   for   several   applications   in   Information   Retrieval   (IR)   and   Knowledge   Extraction    (KE).    Arabic    is    a    low    resourced    language    characterized  by  its  complex  morphology.  Furthermore,  most  existent  Arabic  language  resources  focus  on  Modern  Standard  Arabic  (MSA).  This  paper  describes  KUNUZ  a  multi-purpose  test  collection  composed  of  voweled  and  structured  classical  Arabic documents. Its goal is to provide a unique benchmark for assessing  applications  in  several  areas  of  document  engineering  including IR, document classification and information extraction. The  documents  are  also  translated  in  English  to  allow  Arabic-English cross-lingual IR and machine translation. As far as IR is concerned, we follow the standard topic development and results sampling  used  in  international  campaigns.  The  paper,  describes  the  process  of  topic  development,  results  pooling  and  relevance  judgment.  It  also  analyses  the  results  of  some  processing  tools  and IR models used in the runs. In order to enhance the results of our  experiments,  we  also  proposed  to  combine  the  results  based  on   a   meta-search   approach   using   Support   Vector   Machines   (SVM) classification.",
    "Added By": "Jezia Zakraoui"
}