{
    "Name": "LAMA",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/ara_emotion",
    "Link": "https://github.com/UBC-NLP/ara_emotion_naacl2018",
    "License": "unknown",
    "Year": 2018,
    "Language": "ar",
    "Dialect": "Modern Standard Arabic",
    "Domain": "social media",
    "Form": "text",
    "Collection Style": "crawling,machine annotation",
    "Description": "A dataset for Modern Standard and Dialectal Arabic emotion detection focused at Robert Plutchik’s 8 basic emotion types",
    "Volume": "7,000",
    "Unit": "sentences",
    "Ethical Risks": "Medium",
    "Provider": "University of British Columbia",
    "Derived From": "",
    "Paper Title": "Enabling Deep Learning of Emotion With First-Person Seed Expressions",
    "Paper Link": "https://aclanthology.org/W18-1104.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": "Yes",
    "Tasks": "emotion detection",
    "Venue Title": "ACL",
    "Citations": "21.0",
    "Venue Type": "workshop",
    "Venue Name": "he Second Workshop on Computational Modeling of People’s Opinions, Personality, and Emotions in Social Media, ACL",
    "Authors": "Hassan Alhuzali, Muhammad Abdul-Mageed, Lyle Ungar",
    "Affiliations": "",
    "Abstract": "The computational treatment of emotion in natural language text remains relatively lim- ited, and Arabic is no exception. This is partly due to lack of labeled data. In this work, we describe and manually validate a method for the automatic acquisition of emotion labeled data and introduce a newly developed data set for Modern Standard and Dialectal Arabic emotion detection focused at Robert Plutchik’s 8 basic emotion types. Using a hybrid supervi- sion method that exploits first person emotion seeds, we show how we can acquire promis- ing results with a deep gated recurrent neu- ral network. Our best model reaches 70% F- score, significantly (i.e., 11%, p < 0.05) out- performing a competitive baseline. Applying our method and data on an external dataset of 4 emotions released around the same time we fi- nalized our work, we acquire 7% absolute gain in F-score over a linear SVM classifier trained on gold data, thus validating our approach",
    "Added By": "Emad A. Alghamdi"
}