{
    "Name": "LinCE - MSA-DA  (LID - Code Switching )",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://ritual.uh.edu/lince/datasets",
    "License": "unknown",
    "Year": 2016,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": "social media",
    "Form": "text",
    "Collection Style": "crawling and annotation(other)",
    "Description": "Twitter data and 9 entity types to establish a new dataset for code-switched NER\r\nbenchmarks.",
    "Volume": "11,241",
    "Unit": "sentences",
    "Ethical Risks": "Medium",
    "Provider": "Multiple Institutions ",
    "Derived From": "",
    "Paper Title": "Overview for the Second Shared Task on Language Identification in Code-Switched Data",
    "Paper Link": "https://aclanthology.org/W16-5805.pdf",
    "Script": "Arab-Latn",
    "Tokenized": "No",
    "Host": "other",
    "Access": "Upon-Request",
    "Cost": "",
    "Test Split": "Yes",
    "Tasks": "codeswitch detection",
    "Venue Title": "CALCS ",
    "Citations": "98.0",
    "Venue Type": "workshop",
    "Venue Name": "Workshop on Computational Approaches to Code Switching",
    "Authors": "Giovanni Molina,F. Alghamdi,Mahmoud A. Ghoneim,A. Hawwari,Nicolas Rey-Villamizar,Mona T. Diab,T. Solorio",
    "Affiliations": ",,,,,,",
    "Abstract": "We present an overview of the first shared task on language identification on codeswitched data. The shared task included code-switched data from four language pairs: Modern Standard ArabicDialectal Arabic (MSA-DA), MandarinEnglish (MAN-EN), Nepali-English (NEPEN), and Spanish-English (SPA-EN). A total of seven teams participated in the task and submitted 42 system runs. The evaluation showed that language identification at the token level is more difficult when the languages present are closely related, as in the case of MSA-DA, where the prediction performance was the lowest among all language pairs. In contrast, the language pairs with the higest F-measure where SPA-EN and NEP-EN. The task made evident that language identification in code-switched data is still far from solved and warrants further research.",
    "Added By": "Maraim Masoud"
}