{
    "Name": "MADAR Lexicon",
    "Subsets": [],
    "HF Link": "nan",
    "Link": "https://docs.google.com/forms/d/e/1FAIpQLSe2LHYmHsxdkHPYHgcZDz25dTNbnygPkmClIaLd_fwud-XnTQ/viewform",
    "License": "custom",
    "Year": 2022,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": "other",
    "Form": "text",
    "Collection Style": "manual curation",
    "Description": "The MADAR Lexicon is a collection of 1,042 concepts expressed in 25 city dialects totaling 47K entries (with an average of 45 words per concept, or about 2 words per dialect).  Concepts were selected from the BTEC Parallel corpora. The lexicon is centered around concept keys, which are triplets of English, French, and Modern Standard Arabic (MSA), and annotators had to provide words that overlap in word sense with all three languages.  Each dialectal word is presented in its CODA orthography and its CAPHI phonology (Bouamor et al., 2018; Habash et al., 2018).  The MADAR Lexicon was created as part of the Multi-Arabic Dialect Applications and Resources Project (funded by NPRP 7-290- 1-047 from the Qatar National Research Fund (a member of the Qatar Foundation).   Website: http://madar.camel-lab.com",
    "Volume": "47,000",
    "Unit": "tokens",
    "Ethical Risks": "Low",
    "Provider": "NYU Abu Dhabi",
    "Derived From": "nan",
    "Paper Title": "The MADAR Arabic Dialect Corpus and Lexicon.",
    "Paper Link": "http://www.lrec-conf.org/proceedings/lrec2018/pdf/351.pdf",
    "Script": "Arab",
    "Tokenized": "Yes",
    "Host": "CAMeL Resources",
    "Access": "Upon-Request",
    "Cost": "nan",
    "Test Split": "No",
    "Tasks": "dialect identification, transliteration",
    "Venue Title": "LREC",
    "Citations": "127.0",
    "Venue Type": "conference",
    "Venue Name": "The International Conference on Language Resources and Evaluation",
    "Authors": "Bouamor, Houda, Nizar Habash, Mohammad Salameh, Wajdi Zaghouani, Owen Rambow, Dana Abdulrahim, Ossama Obeid, Salam Khalifa, Fadhl Eryani, Alexander Erdmann and Kemal Oflazer.",
    "Affiliations": "Carnegie Mellon University in Qatar, Qatar; Hamad Bin Khalifa University, Qatar; New York University Abu Dhabi, UAE; Columbia University, USA, University of Bahrain; Bahrain",
    "Abstract": "In this paper, we present two resources that were created as part of the Multi Arabic Dialect Applications and Resources (MADAR) project. The first is a large parallel corpus of 25 Arabic city dialects in the travel domain. The second is a lexicon of 1,045 concepts with an average of 45 words from 25 cities per concept. These resources are the first of their kind in terms of the breadth of their coverage and the fine location granularity. The focus on cities, as opposed to regions in studying Arabic dialects, opens new avenues to many areas of research from dialectology to dialect identification and machine translation.",
    "Added By": "Fadhl Al-Eryani"
}