{
    "Name": "MArSUM: Moroccan Articles Summarisation",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/MArSum",
    "Link": "https://github.com/KamelGaanoun/MoroccanSummarization",
    "License": "CC BY 4.0",
    "Year": 2022,
    "Language": "ar",
    "Dialect": "ar-MA: (Arabic (Morocco))",
    "Domain": "news articles",
    "Form": "text",
    "Collection Style": "crawling",
    "Description": "MArSUM is the first open corpus destinated for Moroccan dialect text summarization. The articles are retrieved from the GOUD.ma website and filtered to retain only Moroccan dialect. We have compiled a corpus of almost 20k articles with their titles.",
    "Volume": "20,000",
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": "INSEA-Morocco (Institut Nationale de Statistiques et d'Economie Appliquée)",
    "Derived From": "nan",
    "Paper Title": "Automatic Text Summarization for Moroccan Arabic Dialect Using an Artificial Intelligence Approach",
    "Paper Link": "https://link.springer.com/chapter/10.1007/978-3-031-06458-6_13",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "nan",
    "Test Split": "Yes",
    "Tasks": "summarization",
    "Venue Title": "CBI'22",
    "Citations": "nan",
    "Venue Type": "conference",
    "Venue Name": "International Conference of Business Intelligence",
    "Authors": "Kamel Gaanoun, Abdou Mohamed Naira, Anass Allak, Imade Benelallam",
    "Affiliations": "INSEA, AIOX Labs",
    "Abstract": "A major advantage of artificial intelligence is its ability to automatically perform tasks at a human-like level quickly; this is needed in many fields, and more particularly in Automatic Text Summarization (ATS). Several advances related to this technique were made in recent years for both extractive and abstractive approaches, notably with the advent of sequence-to-sequence (seq2seq) and Transformers-based models. In spite of this, the Arabic language is largely less represented in this field, due to its complexity and a lack of datasets for ATS. Although some ATS works exist for Modern Standard Arabic (MSA), there is a lack of ATS works for the Arabic dialects that are more prevalent on social networking platforms and the Internet in general. Intending to take an initial step toward meeting this need, we present the first work of ATS concerning the Moroccan dialect known as Darija. This paper introduces the first dataset intended for the summarization of articles written in Darija. In addition, we present state-of-the-art results based on the ROUGE metric for extractive methods based on BERT embeddings and K-MEANS clustering, as well as abstractive methods based on Transformers models.",
    "Added By": "Kamel GAANOUN"
}