{
    "Name": "MASC: Massive Arabic Speech Corpus",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/pain/MASC",
    "Link": "https://ieee-dataport.org/open-access/masc-massive-arabic-speech-corpus",
    "License": "CC BY 4.0",
    "Year": 2022,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": "transcribed audio",
    "Form": "spoken",
    "Collection Style": "crawling and annotation(other)",
    "Description": "This corpus is a dataset that contains 1,000 hours of speech sampled at 16~kHz and crawled from over 700 YouTube channels.",
    "Volume": "1,000",
    "Unit": "hours",
    "Ethical Risks": "",
    "Provider": "",
    "Derived From": "",
    "Paper Title": "",
    "Paper Link": "",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "other",
    "Access": "Free",
    "Cost": "",
    "Test Split": "Yes",
    "Tasks": "speech recognition",
    "Venue Title": "",
    "Citations": "",
    "Venue Type": "",
    "Venue Name": "",
    "Authors": "Mohammad Al-Fetyani,Muhammad Al-Barham,Gheith Abandah,Adham Alsharkawi, Maha Dawas\n",
    "Affiliations": "",
    "Abstract": "This paper releases and describes the creation of the Massive Arabic Speech Corpus (MASC). This corpus is a dataset that contains 1,000 hours of speech sampled at 16~kHz and crawled from over 700 YouTube channels. MASC is multi-regional, multi-genre, and multi-dialect dataset that is intended to advance the research and development of Arabic speech technology with the special emphasis on Arabic speech recognition. In addition to MASC, a pre-trained 3-gram language model and a pre-trained automatic speech recognition model are also developed and made available for interested researches. For a better language model, a new and unified Arabic speech corpus is required, and thus, a dataset of 12~M unique Arabic words is created and released. To make practical and convenient use of MASC, the whole dataset is stratified based on dialect into clean and noisy portions. Each of the two portions is then stratified and divided into three subsets: development, test, and training sets. The best word error rate achieved by the speech recognition model is 19.8% for the clean development set and 21.8% for the clean test set.",
    "Added By": "Mohammad Amjad Al-Fetyani"
}