{
    "Name": "Mawqif",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/NoraAlt/Mawqif_Stance-Detection",
    "Link": "https://github.com/NoraAlt/Mawqif-Arabic-Stance",
    "License": "unknown",
    "Year": 2022,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": "social media",
    "Form": "text",
    "Collection Style": "crawling and annotation(other)",
    "Description": "Mawqif is the first Arabic dataset that can be used for target-specific stance detection. This is a multi-label dataset where each data point is annotated for stance, sentiment, and sarcasm.",
    "Volume": "4,121",
    "Unit": "sentences",
    "Ethical Risks": "Medium",
    "Provider": "",
    "Derived From": "",
    "Paper Title": "Mawqif: A Multi-label Arabic Dataset for Target-specific Stance Detection",
    "Paper Link": "https://aclanthology.org/2022.wanlp-1.16/",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": "Yes",
    "Tasks": "sentiment analysis, topic classification, irony detection, stance detection",
    "Venue Title": "WANLP",
    "Citations": "",
    "Venue Type": "workshop",
    "Venue Name": "Arabic Natural Language Processing Workshop",
    "Authors": "",
    "Affiliations": "",
    "Abstract": "Social media platforms are becoming inherent parts of people’s daily life to express opinions and stances toward topics of varying polarities. Stance detection determines the viewpoint expressed in a text toward a target. While communication on social media (e.g., Twitter) takes place in more than 40 languages, the majority of stance detection research has been focused on English. Although some efforts have recently been made to develop stance detection datasets in other languages, no similar efforts seem to have considered the Arabic language. In this paper, we present Mawqif, the first Arabic dataset for target-specific stance detection, composed of 4,121 tweets annotated with stance, sentiment, and sarcasm polarities. Mawqif, as a multi-label dataset, can provide more opportunities for studying the interaction between different opinion dimensions and evaluating a multi-task model. We provide a detailed description of the dataset, present an analysis of the produced annotation, and evaluate four BERT-based models on it. Our best model achieves a macro-F1 of 78.89%, which shows that there is ample room for improvement on this challenging task. We publicly release our dataset, the annotation guidelines, and the code of the experiments.",
    "Added By": "Nora Saleh Alturayeif"
}