{
    "Name": "MCWC",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/ezzini/MCWCv1",
    "Link": "https://hf.co/datasets/ezzini/MCWCv1",
    "License": "MIT License",
    "Year": 2024,
    "Language": "multilingual",
    "Dialect": "Modern Standard Arabic",
    "Domain": "other",
    "Form": "text",
    "Collection Style": "crawling,machine annotation",
    "Description": "The “Multilingual Corpus of World’s Constitutions” (MCWC) is a rich resource available in English, Arabic, and Spanish, encompassing constitutions from various nations. This corpus serves as a vital asset for the NLP community, facilitating advanced research in constitutional analysis, machine translation, and cross-lingual legal studies.",
    "Volume": "236,156",
    "Unit": "documents",
    "Ethical Risks": "Low",
    "Provider": "",
    "Derived From": "",
    "Paper Title": "The Multilingual Corpus of World’s Constitutions (MCWC)",
    "Paper Link": "https://aclanthology.org/2024.osact-1.7.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "HuggingFace",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "machine translation",
    "Venue Title": "OSACT",
    "Citations": "",
    "Venue Type": "workshop",
    "Venue Name": "Workshop on Open-Source Arabic Corpora and Processing Tools",
    "Authors": "Mo El-Haj and Saad Ezzini",
    "Affiliations": "",
    "Abstract": "The “Multilingual Corpus of World’s Constitutions” (MCWC) is a rich resource available in English, Arabic, and\nSpanish, encompassing constitutions from various nations. This corpus serves as a vital asset for the NLP\ncommunity, facilitating advanced research in constitutional analysis, machine translation, and cross-lingual legal\nstudies. To ensure comprehensive coverage, for constitutions not originally available in Arabic and Spanish,\nwe employed a fine-tuned state-of-the-art machine translation model. MCWC prepares its data to ensure high\nquality and minimal noise, while also providing valuable mappings of constitutions to their respective countries\nand continents, facilitating comparative analysis. Notably, the corpus offers pairwise sentence alignments across\nlanguages, supporting machine translation experiments. We utilise a leading Machine Translation model, fine-tuned\non the MCWC to achieve accurate and context-aware translations. Additionally, we introduce an independent\nMachine Translation model as a comparative baseline. Fine-tuning the model on MCWC improves accuracy,\nhighlighting the significance of such a legal corpus for NLP and Machine Translation. MCWC’s diverse multilingual\ncontent and commitment to data quality contribute to advancements in legal text analysis within the NLP community,\nfacilitating exploration of constitutional texts and multilingual data analysis.",
    "Added By": "Zaid Alyafeai"
}