{
    "Name": "MGB-5",
    "Subsets": [],
    "HF Link": "nan",
    "Link": "https://arabicspeech.org/mgb5/",
    "License": "unknown",
    "Year": 2019,
    "Language": "ar",
    "Dialect": "ar-MA: (Arabic (Morocco))",
    "Domain": "transcribed audio",
    "Form": "spoken",
    "Collection Style": "crawling and annotation(other)",
    "Description": "Moroccan Arabic speech extracted from 93 YouTube videos distributed across seven genres: comedy, cooking, family/children, fashion, drama, sports, and science clips.",
    "Volume": "14",
    "Unit": "hours",
    "Ethical Risks": "Low",
    "Provider": "QCRI",
    "Derived From": "nan",
    "Paper Title": "The MGB-5 Challenge: Recognition and Dialect Identification of Dialectal Arabic Speech",
    "Paper Link": "https://ieeexplore.ieee.org/document/9003960",
    "Script": "Arab",
    "Tokenized": "Yes",
    "Host": "other",
    "Access": "Upon-Request",
    "Cost": "nan",
    "Test Split": "No",
    "Tasks": "speech recognition",
    "Venue Title": "ASRU",
    "Citations": "18.0",
    "Venue Type": "workshop",
    "Venue Name": "IEEE Automatic Speech Recognition and Understanding Workshop",
    "Authors": "A. Ali,Suwon Shon,Younes Samih,Hamdy Mubarak,Ahmed Abdelali,James R. Glass,S. Renals,K. Choukri",
    "Affiliations": ",,University Of Düsseldorf;Computational Linguistics,,,,,",
    "Abstract": "This paper describes the fifth edition of the Multi-Genre Broadcast Challenge (MGB-5), an evaluation focused on Arabic speech recognition and dialect identification. MGB-5 extends the previous MGB-3 challenge in two ways: first it focuses on Moroccan Arabic speech recognition; second the granularity of the Arabic dialect identification task is increased from 5 dialect classes to 17, by collecting data from 17 Arabic speaking countries. Both tasks use YouTube recordings to provide a multi-genre multi-dialectal challenge in the wild. Moroccan speech transcription used about 13 hours of transcribed speech data, split across training, development, and test sets, covering 7-genres: comedy, cooking, family/kids, fashion, drama, sports, and science (TEDx). The fine-grained Arabic dialect identification data was collected from known YouTube channels from 17 Arabic countries. 3,000 hours of this data was released for training, and 57 hours for development and testing. The dialect identification data was divided into three sub-categories based on the segment duration: short (under 5 s), medium (5–20 s), and long (>20 s). Overall, 25 teams registered for the challenge, and 9 teams submitted systems for the two tasks. We outline the approaches adopted in each system and summarize the evaluation results.",
    "Added By": "nan"
}