{
    "Name": "MMAC",
    "Subsets": [],
    "HF Link": "nan",
    "Link": "http://www.ashrafraouf.com/mmac",
    "License": "unknown",
    "Year": 2010,
    "Language": "ar",
    "Dialect": "ar-MSA: (Arabic (Modern Standard Arabic))",
    "Domain": "other",
    "Form": "text",
    "Collection Style": "crawling",
    "Description": "The multi-modal Arabic corpus contains 6 million Arabic words selected from various sources covering old Arabic, religious texts, traditional language, modern language, different specialisations and very modern material from online “chat rooms.”",
    "Volume": "6,000,000",
    "Unit": "tokens",
    "Ethical Risks": "Low",
    "Provider": "Multiple Institutions",
    "Derived From": "nan",
    "Paper Title": "Building a multi-modal Arabic corpus (MMAC)",
    "Paper Link": "https://link.springer.com/content/pdf/10.1007/s10032-010-0128-2.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "other",
    "Access": "Free",
    "Cost": "nan",
    "Test Split": "No",
    "Tasks": "dictionary ",
    "Venue Title": "IJDAR",
    "Citations": "nan",
    "Venue Type": "journal",
    "Venue Name": "International Journal on Document Analysis and Recognition ",
    "Authors": "Ashraf AbdelRaouf, Colin A. Higgins, Tony Pridmore,  Mahmoud Khalil",
    "Affiliations": "Misr International University, The University of Nottingham, The University of Nottingham, , Ain Shams University ",
    "Abstract": "Traditionally, a corpus is a large structured set\nof text, electronically stored and processed. Corpora have\nbecome very important in the study of languages. They\nhave opened new areas of linguistic research, which were\nunknown until recently. Corpora are also key to the development of optical character recognition (OCR) applications. Access to a corpus of both language and images is\nessential during OCR development, particularly while training and testing a recognition application. Excellent corpora\nhave been developed for Latin-based languages, but few\nrelate to the Arabic language. This limits the penetration of\nboth corpus linguistics and OCR in Arabic-speaking countries. This paper describes the construction and provides a\ncomprehensive study and analysis of a multi-modal Arabic\ncorpus (MMAC) that is suitable for use in both OCR development and linguistics. MMAC currently contains six million\nArabic words and, unlike previous corpora, also includes\nconnected segments or pieces of Arabic words (PAWs) as\nwell as naked pieces of Arabic words (NPAWs) and naked words (NWords); PAWs and Words without diacritical marks.\nMulti-modal data is generated from both text, gathered from\na wide variety of sources, and images of existing documents.\nText-based data is complemented by a set of artificially generated images showing each of the Words, NWords, PAWs\nand NPAWs involved. Applications are provided to generate a natural-looking degradation to the generated images.\nA ground truth annotation is offered for each such image,\nwhile natural images showing small paragraphs and full\npages are augmented with representations of the text they\ndepict. A statistical analysis and verification of the dataset\nhas been carried out and is presented. MMAC was also tested\nusing commercial OCR software and is publicly and freely\navailable.",
    "Added By": "Zaid Alyafeai"
}