{
    "Name": "mozilla foundation common voice dataset",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/mozilla-foundation/common_voice_17_0",
    "Link": "https://github.com/common-voice/cv-dataset/tree/main/datasets",
    "License": "MPL-2.0",
    "Year": 2020,
    "Language": "multilingual",
    "Dialect": "mixed",
    "Domain": [
        "other"
    ],
    "Form": "audio",
    "Collection Style": [
        "other"
    ],
    "Description": "The Common Voice dataset consists of a unique MP3 and corresponding text file. Many of the 20217 recorded hours in the dataset also include demographic metadata like age, sex, and accent that can help improve the accuracy of speech recognition engines.",
    "Volume": 87.0,
    "Unit": "hours",
    "Ethical Risks": "Low",
    "Provider": [
        "Mozilla",
        "Indiana University",
        "Artie",
        "Inc."
    ],
    "Derived From": [],
    "Paper Title": "Common Voice: A Massively-Multilingual Speech Corpus",
    "Paper Link": "https://arxiv.org/pdf/1912.06670.pdf",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "HuggingFace",
    "Access": "Free",
    "Cost": "",
    "Test Split": true,
    "Tasks": [
        "speech recognition",
        "language identification"
    ],
    "Venue Title": "LREC",
    "Venue Type": "conference",
    "Venue Name": "International Conference on Language Resources and Evaluation",
    "Authors": [
        "Rosana Ardila",
        "Megan Branson",
        "Kelly Davis",
        "Michael Henretty",
        "Michael Kohler",
        "Josh Meyer",
        "Reuben Morais",
        "Lindsay Saunders",
        "Francis M. Tyers",
        "Gregor Weber"
    ],
    "Affiliations": [
        "Mozilla",
        "Indiana University",
        "Artie",
        "Inc."
    ],
    "Abstract": "The Common Voice corpus is a massively-multilingual collection of transcribed speech intended for speech technology research and development. Common Voice is designed for Automatic Speech Recognition purposes but can be useful in other domains (e.g. language\nidentification). To achieve scale and sustainability, the Common Voice project employs crowdsourcing for both data collection and data validation. The most recent release includes 29 languages, and as of November 2019 there are a total of 38 languages collecting data.\nOver 50,000 individuals have participated so far, resulting in 2,500 hours of collected audio. To our knowledge this is the largest audio corpus in the public domain for speech recognition, both in terms of number of hours and number of languages. As an example use\ncase for Common Voice, we present speech recognition experiments using Mozilla’s DeepSpeech Speech-to-Text toolkit. By applying transfer learning from a source English model, we find an average Character Error Rate improvement of 5.99 ± 5.48 for twelve target\nlanguages (German, French, Italian, Turkish, Catalan, Slovenian, Welsh, Irish, Breton, Tatar, Chuvash, and Kabyle). For most of these languages, these are the first ever published results on end-to-end Automatic Speech Recognition.",
    "Added By": "Wafaa Mohammed"
}