{
    "Name": "MSAC",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/MSAC",
    "Link": "https://github.com/ososs/Arabic-Sentiment-Analysis-corpus",
    "License": "unknown",
    "Year": 2020,
    "Language": "ar",
    "Dialect": "ar-MA: (Arabic (Morocco))",
    "Domain": "social media",
    "Form": "text",
    "Collection Style": "crawling and annotation(other)",
    "Description": "rich and publicly available Arabic corpus called Moroccan Sentiment Analysis Corpus (MSAC)",
    "Volume": "2,000",
    "Unit": "sentences",
    "Ethical Risks": "Medium",
    "Provider": "Ibn Tofail University",
    "Derived From": "nan",
    "Paper Title": "ASA: A framework for Arabic sentiment analysis",
    "Paper Link": "https://dl.acm.org/doi/abs/10.1177/0165551519849516",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "nan",
    "Test Split": "No",
    "Tasks": "sentiment analysis",
    "Venue Title": "JIS",
    "Citations": "20.0",
    "Venue Type": "journal",
    "Venue Name": "Journal of Information Science",
    "Authors": "Ahmed Oussous,Fatima-Zahra Benjelloun,A. A. Lahcen,Samir Belfkih",
    "Affiliations": ",,,",
    "Abstract": "Sentiment analysis (SA), also known as opinion mining, is a growing important research area. Generally, it helps to automatically determine if a text expresses a positive, negative or neutral sentiment. It enables to mine the huge increasing resources of shared opinions such as social networks, review sites and blogs. In fact, SA is used by many fields and for various languages such as English and Arabic. However, since Arabic is a highly inflectional and derivational language, it raises many challenges. In fact, SA of Arabic text should handle such complex morphology. To better handle these challenges, we decided to provide the research community and Arabic users with a new efficient framework for Arabic Sentiment Analysis (ASA). Our primary goal is to improve the performance of ASA by exploiting deep learning while varying the preprocessing techniques. For that, we implement and evaluate two deep learning models namely convolutional neural network (CNN) and long short-term memory (LSTM) models. The framework offers various preprocessing techniques for ASA (including stemming, normalisation, tokenization and stop words). As a result of this work, we first provide a new rich and publicly available Arabic corpus called Moroccan Sentiment Analysis Corpus (MSAC). Second, the proposed framework demonstrates improvement in ASA. In fact, the experimental results prove that deep learning models have a better performance for ASA than classical approaches (support vector machines, naive Bayes classifiers and maximum entropy). They also show the key role of morphological features in Arabic Natural Language Processing (NLP).",
    "Added By": "Zaid Alyafeai"
}