{
    "Name": "muharaf public",
    "Subsets": [],
    "HF Link": "https://zenodo.org/records/11492215",
    "Link": "https://huggingface.co/datasets/aamijar/muharaf-public",
    "License": "CC BY-NC-SA 4.0",
    "Year": 2024,
    "Language": "ar",
    "Dialect": "Classical Arabic",
    "Domain": [
        "books"
    ],
    "Form": "images",
    "Collection Style": [
        "human annotation"
    ],
    "Description": "This dataset contains 24,495 line images of Arabic handwriting and the corresponding text. The images are Manuscripts from the 19th to 21st century. See the official code, paper, and zenodo archive below. ",
    "Volume": 24495.0,
    "Unit": "images",
    "Ethical Risks": "Low",
    "Provider": [],
    "Derived From": [],
    "Paper Title": "Muharaf: Manuscripts of Handwritten Arabic Dataset for Cursive Text Recognition",
    "Paper Link": "https://arxiv.org/pdf/2406.09630",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "zenodo",
    "Access": "Free",
    "Cost": "",
    "Test Split": true,
    "Tasks": [
        "optical character recognition"
    ],
    "Venue Title": "NeurIPS",
    "Venue Type": "conference",
    "Venue Name": "Neural Information Processing Systems",
    "Authors": [],
    "Affiliations": [],
    "Abstract": "We present the Manuscripts of Handwritten Arabic~(Muharaf) dataset, which is a machine learning dataset consisting of more than 1,600 historic handwritten page images transcribed by experts in archival Arabic. Each document image is accompanied by spatial polygonal coordinates of its text lines as well as basic page elements. This dataset was compiled to advance the state of the art in handwritten text recognition (HTR), not only for Arabic manuscripts but also for cursive text in general. The Muharaf dataset includes diverse handwriting styles and a wide range of document types, including personal letters, diaries, notes, poems, church records, and legal correspondences. In this paper, we describe the data acquisition pipeline, notable dataset features, and statistics. We also provide a preliminary baseline result achieved by training convolutional neural networks using this data.\n",
    "Added By": "Zaid Alyafeai"
}