{
    "Name": "Multilingual POPE",
    "Subsets": [],
    "HF Link": "https://huggingface.co/datasets/HIT4Yzk/Multilingual_POPE",
    "Link": "https://huggingface.co/datasets/HIT4Yzk/Multilingual_POPE",
    "License": "CC BY 4.0",
    "Year": 2023,
    "Language": "multilingual",
    "Dialect": "Modern Standard Arabic",
    "Domain": [
        "public datasets"
    ],
    "Form": "images",
    "Collection Style": [
        "machine annotation"
    ],
    "Description": "Object hallucination benchmark translated into Arabic and other languages.",
    "Volume": 27000.0,
    "Unit": "images",
    "Ethical Risks": "Low",
    "Provider": [
        "Harbin Institute of Technology",
        "Peng Cheng Laboratory",
        "Central South University",
        "Huawei Technologies Co., Ltd"
    ],
    "Derived From": [
        "POPE"
    ],
    "Paper Title": "CLAIM: Mitigating Multilingual Object Hallucination in Large Vision-Language Models with Cross-Lingual Attention Intervention",
    "Paper Link": "https://arxiv.org/pdf/2506.11073",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "other",
    "Access": "Free",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "hallucination detection"
    ],
    "Venue Title": "arXiv",
    "Venue Type": "preprint",
    "Venue Name": "arXiv",
    "Authors": [
        "Zekai Ye",
        "Qiming Li",
        "Xiaocheng Feng",
        "Libo Qin",
        "Yichong Huang",
        "Baohang Li",
        "Kui Jiang",
        "Yang Xiang",
        "Zhirui Zhang",
        "Yunfei Lu",
        "Duyu Tang",
        "Dandan Tu",
        "Bing Qin"
    ],
    "Affiliations": [
        "Harbin Institute of Technology",
        "Peng Cheng Laboratory",
        "Central South University",
        "Huawei Technologies Co., Ltd"
    ],
    "Abstract": "Large Vision-Language Models (LVLMs) have demonstrated impressive multimodal abilities but remain prone to multilingual object hallucination, with a higher likelihood of generating responses inconsistent with the visual input when utilizing queries in non-English languages compared to English. Most existing approaches to address these rely on pretraining or fine-tuning, which are resource-intensive. In this paper, inspired by observing the disparities in cross-modal attention patterns across languages, we propose Cross-Lingual Attention Intervention for Mitigating multilingual object hallucination (CLAIM) in LVLMs, a novel near training-free method by aligning attention patterns. CLAIM first identifies language-specific cross-modal attention heads, then estimates language shift vectors from English to the target language, and finally intervenes in the attention outputs during inference to facilitate cross-lingual visual perception capability alignment. Extensive experiments demonstrate that CLAIM achieves an average improvement of 13.56% (up to 30% in Spanish) on the POPE and 21.75% on the hallucination subsets of the MME benchmark across various languages. Further analysis reveals that multilingual attention divergence is most prominent in intermediate layers, highlighting their critical role in multilingual scenarios.\n",
    "Added By": "Zaid Alyafeai"
}
