{
    "Name": "MYC",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://github.com/MouadJb/MYC",
    "License": "unknown",
    "Year": 2023,
    "Language": "ar",
    "Dialect": "Morocco",
    "Domain": [
        "social media"
    ],
    "Form": "text",
    "Collection Style": [
        "human annotation"
    ],
    "Description": "Moroccan YouTube sentiment dataset with 20k balanced Arabic/Latin comments.",
    "Volume": 20000.0,
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": [
        "University Sultan Moulay Slimane"
    ],
    "Derived From": [],
    "Paper Title": "Sentiment Analysis Dataset in Moroccan Dialect: Bridging the Gap Between Arabic and Latin Scripted dialect.",
    "Paper Link": "https://arxiv.org/pdf/2303.15987",
    "Script": "Arab-Latin",
    "Tokenized": false,
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": true,
    "Tasks": [
        "sentiment analysis"
    ],
    "Venue Title": "arXiv",
    "Venue Type": "preprint",
    "Venue Name": "",
    "Authors": [
        "JBEL MOUAD",
        "JABRANE MOURAD",
        "HAFIDI Imad",
        "METRANE Abdulmutallib"
    ],
    "Affiliations": [
        "University Sultan Moulay Slimane"
    ],
    "Abstract": "Sentiment analysis, the automated process of determining emotions or opinions expressed in text,\nhas seen extensive exploration in the field of natural language processing. However, one aspect\nthat has remained underrepresented is the sentiment analysis of the Moroccan dialect, which boasts\na unique linguistic landscape and the coexistence of multiple scripts. Previous works in sentiment\nanalysis primarily targeted dialects employing Arabic script. While these efforts provided valuable\ninsights, they may not fully capture the complexity of Moroccan web content, which features a\nblend of Arabic and Latin script. As a result, our study emphasizes the importance of extending\nsentiment analysis to encompass the entire spectrum of Moroccan linguistic diversity.\nCentral to our research is the creation of the largest public dataset for Moroccan dialect sentiment\nanalysis that incorporates not only Moroccan dialect written in Arabic script but also in Latin\nletters. By assembling a diverse range of textual data, we were able to construct a dataset with a\nrange of 20.000 manually labeled text in Moroccan dialect and also publicly available lists of stop\nwords in Moroccan dialect.\nTo dive into sentiment analysis, we conducted a comparative study on multiple Machine learning\nmodels to assess their compatibility with our dataset. Experiments were performed using both raw\nand preprocessed data to show the importance of the preprocessing step. We were able to achieve\n92% accuracy in our model and to further prove its liability we tested our model on smaller\npublicly available datasets of Moroccan dialect and the results were favorable."
}