{
    "Name": "NArabizi corpus",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/NArabizi",
    "Link": "https://github.com/SamiaTouileb/Narabizi",
    "License": "unknown",
    "Year": 2021,
    "Language": "ar",
    "Dialect": "Algeria",
    "Domain": [
        "other"
    ],
    "Form": "text",
    "Collection Style": [
        "crawling"
    ],
    "Description": "extension of NArabizi treebank by adding to annotations.",
    "Volume": 1500.0,
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": [
        "University of Oslo"
    ],
    "Derived From": [
        "NArabizi treebank"
    ],
    "Paper Title": "The interplay between language similarity and script\r\non a novel multi-layer Algerian dialect corpus",
    "Paper Link": "https://arxiv.org/pdf/2105.07400.pdf",
    "Script": "Arab-Latin",
    "Tokenized": true,
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": true,
    "Tasks": [
        "part of speech tagging",
        "dependency parsing",
        "machine translation",
        "sentiment analysis",
        "transliteration",
        "topic classification"
    ],
    "Venue Title": "FINDINGS",
    "Venue Type": "conference",
    "Venue Name": "Findings of the Association for Computational Linguistics",
    "Authors": [
        "Samia Touileb",
        "Jeremy Barnes"
    ],
    "Affiliations": [
        "",
        "University of the Basque Country UPV/EHU"
    ],
    "Abstract": "Recent years have seen a rise in interest for cross-lingual transfer between languages with similar typology, and between languages of various scripts. However, the interplay between language similarity and difference in script on cross-lingual transfer is a less studied problem. We explore this interplay on cross-lingual transfer for two supervised tasks, namely part-of-speech tagging and sentiment analysis. We introduce a newly annotated corpus of Algerian user-generated comments comprising parallel annotations of Algerian written in Latin, Arabic, and code-switched scripts, as well as annotations for sentiment and topic categories. We perform baseline experiments by fine-tuning multi-lingual language models. We further explore the effect of script vs. language similarity in cross-lingual transfer by fine-tuning multi-lingual models on languages which are a) typologically distinct, but use the same script, b) typologically similar, but use a distinct script, or c) are typologically similar and use the same script. We find there is a delicate relationship between script and typology for part-of-speech, while sentiment analysis is less sensitive.",
    "Added By": "Zaid Alyafeai"
}