{
    "Name": "NewsTent",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://drive.google.com/drive/folders/1lVzaSmJWu63YFrJTszQxMqfVoAYuz28F",
    "License": "unknown",
    "Year": 2021,
    "Language": "ar",
    "Dialect": "ar-MSA: (Arabic (Modern Standard Arabic))",
    "Domain": "news articles",
    "Form": "text",
    "Collection Style": "crawling",
    "Description": "NewsTent extracts 8,443,484 articles and their summaries from 22 newspapers of 19 Arab countries\r\ndated from 1999 to 2019",
    "Volume": "8,443,484",
    "Unit": "documents",
    "Ethical Risks": "Low",
    "Provider": "Multiple Institutions",
    "Derived From": "",
    "Paper Title": "NewsTent: Arabic Text Summarization Dataset of 8\r\nMillion Arabic News Articles with Summaries\r",
    "Paper Link": "https://openreview.net/pdf?id=Sbf9j9WcAkk",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "Gdrive",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "summarization",
    "Venue Title": "other",
    "Citations": "0.0",
    "Venue Type": "preprint",
    "Venue Name": "",
    "Authors": "",
    "Affiliations": "",
    "Abstract": "There has been intensive research about text summarization in many languages.\r\nSome languages have reached advanced stages, but Arabic Text Summarization\r\n(ATS) is still in its developing stages due to several limitations starting from\r\ndatasets and ending at the evaluation process. Existing ATS datasets usually\r\ncontain a range of 100 to 30,000 training samples which make them too small\r\nto train a summarization model. Further, existing datasets lack diversity; they\r\nrely on one source (e.g. newspaper) or a few to collect the summaries, also some\r\nrely on a single Arab country and ignore the rest. We present, NewsTent, the\r\nlargest and most diverse dataset for Arabic Text Summarization tasks. NewsTent\r\novercomes the limitations of existing datasets. First, eight million articles and their\r\nsummaries are collected by the \"inverted pyramid\" writing style. The summaries\r\nare verified by human experts and achieved 87.4% accuracy from 1000 samples.\r\nSecond, NewsTent collected news articles from popular newspapers sources of 19\r\nArab countries with an eclectic mix of topics varying from finance, politics, sports,\r\netc to establish comprehensive diversity. Then, we corroborate the superiority\r\nof the extracted summaries by comparing them to MT5-generated summaries.\r\nNewsTent’s large and diverse corpus overcomes the limitations of ATS datasets to\r\nenhance the ATS field.",
    "Added By": "Zaid Alyafeai"
}