{
    "Name": "OCA: Opinion corpus for Arabic",
    "Subsets": [],
    "HF Link": "",
    "Link": "http://150.214.174.171:8059/investigacion/recursos/oca-corpus",
    "License": "unknown",
    "Year": 2011,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": "books",
    "Form": "text",
    "Collection Style": "crawling,annotation",
    "Description": "The corpus contains 500 movie reviews collected from different web pages and blogs in Arabic, 250 of them considered as positive reviews, and the other 250 as negative opinions",
    "Volume": "500",
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": "",
    "Derived From": "",
    "Paper Title": "OCA: Opinion corpus for Arabic\n",
    "Paper Link": "https://onlinelibrary.wiley.com/doi/full/10.1002/asi.21598",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "other",
    "Access": "Upon-Request",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "sentiment analysis",
    "Venue Title": "JASIST",
    "Citations": "242.0",
    "Venue Type": "journal",
    "Venue Name": "The Journal of the Association for Information Science and Technology",
    "Authors": "Mohammed Rushdi-Saleh,M. T. Martín-Valdivia,L. A. U. López,José Manuel Perea Ortega",
    "Affiliations": ",,,",
    "Abstract": "Sentiment analysis is a challenging new task related to text mining and natural language processing. Although there are, at present, several studies related to this theme, most of these focus mainly on English texts. The resources available for opinion mining (OM) in other languages are still limited. In this article, we present a new Arabic corpus for the OM task that has been made available to the scientific community for research purposes. The corpus contains 500 movie reviews collected from different web pages and blogs in Arabic, 250 of them considered as positive reviews, and the other 250 as negative opinions. Furthermore, different experiments have been carried out on this corpus, using machine learning algorithms such as support vector machines and Nave Bayes. The results obtained are very promising and we are encouraged to continue this line of research. © 2011 Wiley Periodicals, Inc.",
    "Added By": "Maraim Masoud"
}