{
    "Name": "OffensEval 2020",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/strombergnlp/offenseval_2020",
    "Link": "https://sites.google.com/site/offensevalsharedtask/results-and-paper-submission",
    "License": "CC BY 4.0",
    "Year": 2019,
    "Language": "multilingual",
    "Dialect": "mixed",
    "Domain": "social media",
    "Form": "text",
    "Collection Style": "crawling,annotation",
    "Description": "The Arabic dataset consists of 10,000 tweets collected in April–May 2019 using the Twitter API with the language filter set to Arabic: lang:ar.",
    "Volume": "10,000",
    "Unit": "sentences",
    "Ethical Risks": "High",
    "Provider": "Multiple Institutions ",
    "Derived From": "Arabic OSACT4",
    "Paper Title": "SemEval-2020 Task 12: Multilingual Offensive Language Identification in Social Media (OffensEval 2020)",
    "Paper Link": "https://aclanthology.org/2020.semeval-1.188.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "other",
    "Access": "Free",
    "Cost": "",
    "Test Split": "Yes",
    "Tasks": "offensive language detection ",
    "Venue Title": "SemEval",
    "Citations": "",
    "Venue Type": "conference",
    "Venue Name": "Semantic Evaluation",
    "Authors": "Marcos Zampieri, Preslav Nakov, Sara Rosenthal, Pepa Atanasova, Georgi Karadzhov, Hamdy Mubarak, Leon Derczynski, Zeses Pitenis, Çağrı Çöltekin",
    "Affiliations": "",
    "Abstract": "We present the results and the main findings of SemEval-2020 Task 12 on Multilingual Offensive Language Identification in Social Media (OffensEval-2020). The task included three subtasks corresponding to the hierarchical taxonomy of the OLID schema from OffensEval-2019, and it was offered in five languages: Arabic, Danish, English, Greek, and Turkish. OffensEval-2020 was one of the most popular tasks at SemEval-2020, attracting a large number of participants across all subtasks and languages: a total of 528 teams signed up to participate in the task, 145 teams submitted official runs on the test data, and 70 teams submitted system description papers.",
    "Added By": "Zaid Alyafeai"
}