{
    "Name": "OSIAN",
    "Subsets": [],
    "HF Link": "nan",
    "Link": "http://oujda-nlp-team.net/en/corpora/osian-corpus/",
    "License": "CC BY-NC 4.0",
    "Year": 2019,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": "news articles",
    "Form": "text",
    "Collection Style": "crawling",
    "Description": "The corpus data was collected from international Arabic news websites,",
    "Volume": "3,500,000",
    "Unit": "documents",
    "Ethical Risks": "Low",
    "Provider": "Multiple Institutions",
    "Derived From": "nan",
    "Paper Title": "OSIAN: Open Source International Arabic News Corpus -\r\nPreparation and Integration into the CLARIN-infrastructure\r",
    "Paper Link": "https://aclanthology.org/W19-4619.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "other",
    "Access": "Free",
    "Cost": "nan",
    "Test Split": "No",
    "Tasks": "text generation, language modeling",
    "Venue Title": "WANLP",
    "Citations": "15.0",
    "Venue Type": "workshop",
    "Venue Name": "Arabic Natural Language Processing Workshop",
    "Authors": "Imad Zeroual,Dirk Goldhahn,Thomas Eckart,A. Lakhouaja",
    "Affiliations": ",,,",
    "Abstract": "The World Wide Web has become a fundamental resource for building large text corpora. Broadcasting platforms such as news websites are rich sources of data regarding diverse topics and form a valuable foundation for research. The Arabic language is extensively utilized on the Web. Still, Arabic is relatively an under-resourced language in terms of availability of freely annotated corpora. This paper presents the first version of the Open Source International Arabic News (OSIAN) corpus. The corpus data was collected from international Arabic news websites, all being freely available on the Web. The corpus consists of about 3.5 million articles comprising more than 37 million sentences and roughly 1 billion tokens. It is encoded in XML; each article is annotated with metadata information. Moreover, each word is annotated with lemma and part-of-speech. the described corpus is processed, archived and published into the CLARIN infrastructure. This publication includes descriptive metadata via OAI-PMH, direct access to the plain text material (available under Creative Commons Attribution-Non-Commercial 4.0 International License - CC BY-NC 4.0), and integration into the WebLicht annotation platform and CLARIN’s Federated Content Search FCS.",
    "Added By": "nan"
}