{
    "Name": "Osman",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/Osman_Un_Corpus",
    "Link": "https://github.com/drelhaj/OsmanReadability",
    "License": "unknown",
    "Year": 2016,
    "Language": "multilingual",
    "Dialect": "ar-MSA: (Arabic (Modern Standard Arabic))",
    "Domain": "other",
    "Form": "text",
    "Collection Style": "crawling",
    "Description": "e text readability for 73,000 parallel sentences from English and Arabic UN documents",
    "Volume": "73,000",
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": "Lancaster University",
    "Derived From": "",
    "Paper Title": "OSMAN – A Novel Arabic Readability Metric\r",
    "Paper Link": "https://aclanthology.org/L16-1038.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "machine translation",
    "Venue Title": "LREC",
    "Citations": "14.0",
    "Venue Type": "conference",
    "Venue Name": "International Conference on Language Resources and Evaluation",
    "Authors": "Mahmoud El-Haj,Paul Rayson",
    "Affiliations": "Lancaster University,Lancaster University",
    "Abstract": "We present OSMAN (Open Source Metric for Measuring Arabic Narratives) - a novel open source Arabic readability metric and tool. It allows researchers to calculate readability for Arabic text with and without diacritics. OSMAN is a modified version of the conventional readability formulas such as Flesch and Fog. In our work we introduce a novel approach towards counting short, long and stress syllables in Arabic which is essential for judging readability of Arabic narratives. We also introduce an additional factor called “Faseeh” which considers aspects of script usually dropped in informal Arabic writing. To evaluate our methods we used Spearman’s correlation metric to compare text readability for 73,000 parallel sentences from English and Arabic UN documents. The Arabic sentences were written with the absence of diacritics and in order to count the number of syllables we added the diacritics in using an open source tool called Mishkal. The results show that OSMAN readability formula correlates well with the English ones making it a useful tool for researchers and educators working with Arabic text.",
    "Added By": "Zaid Alyafeai"
}