{
    "Name": "PAN Arabic Intrinsic Plagiarism Detection Shared Task Corpus",
    "Subsets": [],
    "HF Link": "nan",
    "Link": "https://zenodo.org/record/6609196#.YqTYvNrMLIV",
    "License": "CC BY 4.0",
    "Year": 2015,
    "Language": "ar",
    "Dialect": "ar-MSA: (Arabic (Modern Standard Arabic))",
    "Domain": "wikipedia",
    "Form": "text",
    "Collection Style": "crawling and annotation(other)",
    "Description": "Each part of the corpus (training and test) consists mainly of 2 datasets: textual files and XML files. The textual files represent the suspicious documents i.e., the documents that contain artificial plagiarism; and the XML files are the plagiarism annotation i.e. they provide for each plagiarized passage its starting offset in the suspicious document and its length (offset and length are both expressed in characters). A suspicious document file and its plagiarism annotation file share the same name.",
    "Volume": "2,048",
    "Unit": "documents",
    "Ethical Risks": "nan",
    "Provider": "MISC Lab. Constantine 2 university,PRHLT, Universitat Politècnica de València,",
    "Derived From": "nan",
    "Paper Title": "A New Corpus for the Evaluation of Arabic Intrinsic Plagiarism Detection.",
    "Paper Link": "https://link.springer.com/chapter/10.1007/978-3-642-40802-1_6",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "zenodo",
    "Access": "Free",
    "Cost": "nan",
    "Test Split": "Yes",
    "Tasks": "plagiarism detection",
    "Venue Title": "CLEF 2013",
    "Citations": "nan",
    "Venue Type": "conference",
    "Venue Name": "International Conference of the Cross-Language Evaluation Forum for European Languages",
    "Authors": "Imene Bensalem, Paolo Rosso, Salim Chikhi",
    "Affiliations": "¹MISC Lab. Constantine 2 university, Algeria  PRHLT, Universitat Politècnica de València, Spain ",
    "Abstract": "The present paper introduces the first corpus for the evaluation of Arabic intrinsic plagiarism detection. The corpus consists of 1024 artificial suspicious documents in which 2833 plagiarism cases have been inserted automatically from source documents.",
    "Added By": "Kamel GAANOUN"
}