{
    "Name": "Phoneme-UD",
    "Subsets": [],
    "HF Link": "https://huggingface.co/datasets/suchirsalhan/Phonemized-UD",
    "Link": "https://huggingface.co/datasets/suchirsalhan/Phonemized-UD",
    "License": "MIT License",
    "Year": 2025,
    "Language": "multilingual",
    "Dialect": "Modern Standard Arabic",
    "Domain": [
        "public datasets"
    ],
    "Form": "text",
    "Collection Style": [
        "machine annotation"
    ],
    "Description": "A phonemic dataset of child-directed and child-produced speech across 31 languages.",
    "Volume": 21600.0,
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": [
        "University of Cambridge"
    ],
    "Derived From": [
        "Universal Dependencies."
    ],
    "Paper Title": "IPA CHILDES & G2P+: Feature-Rich Resources for Cross-Lingual Phonology and Phonemic Language Modeling",
    "Paper Link": "https://arxiv.org/pdf/2504.03036",
    "Script": "Latin",
    "Tokenized": true,
    "Host": "HuggingFace",
    "Access": "Free",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "spoken language modeling"
    ],
    "Venue Title": "arXiv",
    "Venue Type": "preprint",
    "Venue Name": "arXiv",
    "Authors": [
        "Zébulon Goriely",
        "Paula Buttery"
    ],
    "Affiliations": [
        "University of Cambridge"
    ],
    "Abstract": "In this paper, we introduce two resources: (i) G2P+, a tool for converting orthographic datasets to a consistent phonemic representation; and (ii) IPA CHILDES, a phonemic dataset of child-centered speech across 31 languages. Prior tools for grapheme-to-phoneme conversion result in phonemic vocabularies that are inconsistent with established phonemic inventories, an issue which G2P+ addresses by leveraging the inventories in the Phoible database. Using this tool, we augment CHILDES with phonemic transcriptions to produce IPA CHILDES. This new resource fills several gaps in existing phonemic datasets, which often lack multilingual coverage, spontaneous speech, and a focus on child-directed language. We demonstrate the utility of this dataset for phonological research by training phoneme language models on 11 languages and probing them for distinctive features, finding that the distributional properties of phonemes are sufficient to learn major class and place features cross-lingually.",
    "Added By": "Zaid Alyafeai"
}