{
    "Name": "PolyNews",
    "Subsets": [],
    "HF Link": "https://huggingface.co/datasets/aiana94/polynews",
    "Link": "https://huggingface.co/datasets/aiana94/polynews",
    "License": "CC BY-NC 4.0",
    "Year": 2025,
    "Language": "multilingual",
    "Dialect": "Modern Standard Arabic",
    "Domain": [
        "news articles",
        "public datasets"
    ],
    "Form": "text",
    "Collection Style": [
        "machine annotation"
    ],
    "Description": "A large-scale multilingual non-parallel news corpus compiled from five sources covering 77 languages and 19 scripts.",
    "Volume": 50948.0,
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": [
        "University of Mannheim",
        "University of Würzburg"
    ],
    "Derived From": [
        "MasakhaNews",
        "MAFAND",
        "WMT-News",
        "GlobalVoices"
    ],
    "Paper Title": "News Without Borders: Domain Adaptation of Multilingual Sentence Embeddings for Cross-lingual News Recommendation",
    "Paper Link": "https://arxiv.org/pdf/2406.12634",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "HuggingFace",
    "Access": "Free",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "machine translation"
    ],
    "Venue Title": "arXiv",
    "Venue Type": "preprint",
    "Venue Name": "arXiv",
    "Authors": [
        "Andreea Iana",
        "Fabian David Schmidt",
        "Goran Glavaš",
        "Heiko Paulheim"
    ],
    "Affiliations": [
        "University of Mannheim",
        "University of Würzburg"
    ],
    "Abstract": "Rapidly growing numbers of multilingual news consumers pose an increasing challenge to news recommender systems in terms of providing customized recommendations. First, existing neural news recommenders, even when powered by multilingual language models (LMs), suffer substantial performance losses in zero-shot cross-lingual transfer (ZS-XLT). Second, the current paradigm of fine-tuning the backbone LM of a neural recommender on task-specific data is computationally expensive and infeasible in few-shot recommendation and cold-start setups, where data are scarce or completely unavailable. In this work, we propose a news-adapted sentence encoder (NaSE), domain-specialized from a pretrained massively multilingual sentence encoder (SE). To this end, we compile and leverage PolyNews and PolyNewsParallel, two multilingual news-specific corpora. With the news-adapted multilingual SE in place, we test the effectiveness of (i.e., question the need for) supervised fine-tuning for news recommendation, and propose a simple and strong baseline based on (i) frozen NaSE embeddings and (ii) late click behavior fusion. We show that NaSE achieves state-of-the-art performance in ZS-XLT in true cold-start and few-shot news recommendation.",
    "Added By": "Zaid Alyafeai"
}