{
    "Name": "POLYGLOT-NER",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://www3.cs.stonybrook.edu/~polyglot/ner2/",
    "License": "unknown",
    "Year": 2014,
    "Language": "multilingual",
    "Dialect": "Modern Standard Arabic",
    "Domain": "wikipedia",
    "Form": "text",
    "Collection Style": "crawling,annotation",
    "Description": "Polyglot-NER A training dataset automatically generated from Wikipedia and Freebase the task of named entity recognition. The dataset contains the basic Wikipedia based training data for 40 languages we have (with coreference resolution) for the task of named entity recognition. The details of the procedure of generating them is outlined in Section 3 of the paper (https://arxiv.org/abs/1410.3791). Each config contains the data corresponding to a different language. For example, \"es\" includes only spanish examples.",
    "Volume": "10,000,144",
    "Unit": "tokens",
    "Ethical Risks": "Low",
    "Provider": "Stony Brook University",
    "Derived From": "",
    "Paper Title": "POLYGLOT-NER: Massive Multilingual Named Entity Recognition",
    "Paper Link": "https://arxiv.org/pdf/1410.3791.pdf",
    "Script": "Arab-Latn",
    "Tokenized": "Yes",
    "Host": "other",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "named entity recognition",
    "Venue Title": "arXiv",
    "Citations": "161.0",
    "Venue Type": "preprint",
    "Venue Name": "",
    "Authors": "Rami Al-Rfou, Vivek Kulkarni, Bryan Perozzi, Steven Skiena",
    "Affiliations": "Stony Brook University",
    "Abstract": "The increasing diversity of languages used on the web introduces a new level of complexity to Information Retrieval (IR) systems. We can no longer assume that textual content is written in one language or even the same language family. In this paper, we demonstrate how to build massive multilingual annotators with minimal human expertise and intervention. We describe a system that builds Named Entity Recognition (NER) annotators for 40 major languages using Wikipedia and Freebase. Our approach does not require NER human annotated datasets or language specific resources like treebanks, parallel corpora, and orthographic rules. The novelty of approach lies therein - using only language agnostic techniques, while achieving competitive performance. Our method learns distributed word representations (word embeddings) which encode semantic and syntactic features of words in each language. Then, we automatically generate datasets from Wikipedia link structure and Freebase attributes. Finally, we apply two preprocessing stages (oversampling and exact surface form matching) which do not require any linguistic expertise. Our evaluation is two fold: First, we demonstrate the system performance on human annotated datasets. Second, for languages where no gold-standard benchmarks are available, we propose a new method, distant evaluation, based on statistical machine translation.",
    "Added By": "Abdelrahman Kaseb"
}