{
    "Name": "QASR",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://arabicspeech.org/qasr/",
    "License": "unknown",
    "Year": 2021,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": [
        "other"
    ],
    "Form": "audio",
    "Collection Style": [
        "crawling"
    ],
    "Description": "This multi-dialect speech dataset contains 2, 000 hours of speech sampled at 16kHz crawled from Aljazeera news channel",
    "Volume": 2000.0,
    "Unit": "hours",
    "Ethical Risks": "Low",
    "Provider": [
        "QCRI"
    ],
    "Derived From": [],
    "Paper Title": "QASR: QCRI Aljazeera Speech Resource\r\nA Large Scale Annotated Arabic Speech Corpus",
    "Paper Link": "https://arxiv.org/pdf/2106.13000.pdf",
    "Script": "Arab",
    "Tokenized": true,
    "Host": "other",
    "Access": "Upon-Request",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "speech recognition"
    ],
    "Venue Title": "ACL",
    "Venue Type": "conference",
    "Venue Name": "Assofications of computation linguisitcs",
    "Authors": [
        "Hamdy Mubarak",
        "Amir Hussein",
        "S. A. Chowdhury"
    ],
    "Affiliations": [
        "",
        "",
        ""
    ],
    "Abstract": "We introduce the largest transcribed Arabic speech corpus, QASR1, collected from the broadcast domain. This multi-dialect speech dataset contains 2, 000 hours of speech sampled at 16kHz crawled from Aljazeera news channel. The dataset is released with lightly supervised transcriptions, aligned with the audio segments. Unlike previous datasets, QASR contains linguistically motivated segmentation, punctuation, speaker information among others. QASR is suitable for training and evaluating speech recognition systems, acousticsand/or linguisticsbased Arabic dialect identification, punctuation restoration, speaker identification, speaker linking, and potentially other NLP modules for spoken data. In addition to QASR transcription, we release a dataset of 130M words to aid in designing and training a better language model. We show that end-to-end automatic speech recognition trained on QASR reports a competitive word error rate compared to the previous MGB-2 corpus. We report baseline results for downstream natural language processing tasks such as named entity recognition using speech transcript. We also report the first baseline for Arabic punctuation restoration. We make the corpus available for the research community.",
    "Added By": ""
}