{
    "Name": "Sa`7r",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/SaudiIrony",
    "Link": "https://github.com/iwan-rg/Saudi-Dialect-Irony-Dataset",
    "License": "CC0",
    "Year": 2022,
    "Language": "ar",
    "Dialect": "Saudi Arabia",
    "Domain": [
        "social media"
    ],
    "Form": "text",
    "Collection Style": [
        "crawling"
    ],
    "Description": "The dataset was collected using Twitter API and it consists of 19,810 tweets, 8,089 of them are labeled as ironic tweets.",
    "Volume": 19810.0,
    "Unit": "sentences",
    "Ethical Risks": "Medium",
    "Provider": [
        "King Saud University"
    ],
    "Derived From": [],
    "Paper Title": "Sa`7r: A Saudi Dialect Irony Dataset",
    "Paper Link": "",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "irony detection"
    ],
    "Venue Title": "OSACT",
    "Venue Type": "workshop",
    "Venue Name": "Open-Source Arabic Corpora and Processing Tools",
    "Authors": [
        "Halah AlMazrua",
        "Najla AlHazzani",
        "Amaal AlDawod",
        "Lama AlAwlaqi",
        "Noura AlReshoudi",
        "Hend Al-Khalifa and Luluh AlDhubayi"
    ],
    "Affiliations": [],
    "Abstract": "In sentiment analysis, detecting irony is considered a major challenge. The key problem with detecting irony is the difficulty to recognize the implicit and indirect phrases which signifies the opposite meaning. In this paper, we present Sa`7r ساخرthe Saudi irony dataset, and describe our efforts in constructing it. The dataset was collected using Twitter API and it consists of 19,810 tweets, 8,089 of them are labeled as ironic tweets. We trained several models for irony detection task using machine learning models and deep learning models. The machine learning models include: K-Nearest Neighbor (KNN), Logistic Regression (LR), Support Vector Machine (SVM), and Naïve Bayes (NB). While the deep learning models include BiLSTM and AraBERT. The detection results show that among the tested machine learning models, the SVM outperformed other classifiers with an accuracy of 0.68. On the other hand, the deep learning models achieved an accuracy of 0.66 in the BiLSTM model and 0.71 in the AraBERT model. Thus, the AraBERT model achieved the most accurate result in detecting irony phrases in Saudi Dialect.",
    "Added By": "Zaid Alyafeai"
}