{
    "Name": "Sanadset 650K: Data on Hadith Narrators",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/Sanadset",
    "Link": "https://data.mendeley.com/datasets/5xth87zwb5/4",
    "License": "CC BY 4.0",
    "Year": 2022,
    "Language": "ar",
    "Dialect": "Classical Arabic",
    "Domain": [
        "books"
    ],
    "Form": "text",
    "Collection Style": [
        "crawling"
    ],
    "Description": "Sanadset is a full hadith dataset that contains over 650,986 records collected from 926 historical Arabic books of hadith. This dataset can be used for further investigation and classification of hadiths (Strong/Weak), and narrators (trustworthy/not) using AI techniques, and also it can be used as a linguistic resource tool for Arabic Natural Language Processing.",
    "Volume": 650000.0,
    "Unit": "documents",
    "Ethical Risks": "Low",
    "Provider": [
        "Abdelmalek Essaâdi University"
    ],
    "Derived From": [],
    "Paper Title": "Sanadset 650K: Data on Hadith Narrators",
    "Paper Link": "https://doi.org/10.1016/j.dib.2022.108540",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "Mendeley Data",
    "Access": "Free",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "machine translation",
        "topic classification",
        "text generation",
        "named entity recognition",
        "question answering",
        "information retrieval",
        "natural language inference"
    ],
    "Venue Title": "Data in Brief",
    "Venue Type": "journal",
    "Venue Name": "Data in Brief",
    "Authors": [
        "Mohammed Mghari",
        "Omar Bouras",
        "Abdelaaziz El Hibaoui"
    ],
    "Affiliations": [],
    "Abstract": "The chain of narrators (Sanad) plays a vital role in deciding the authenticity of Islamic hadiths. However, the investigation and validation of such Sanad fully depend on scientists (Hadith Scholars). They ordinarily utilize their acquired knowledge, which in this manner needs a critical sum of exertion and time.\n\nAutomated Sanad evaluation using machine learning algorithms is the best way to solve this problem. Therefore, a representative Sanad dataset is required.\n\nThis paper presents a full hadith dataset which is named Sanadset and is made openly accessible for researchers. Sanadset corpus contains over 650,986 records collected from 926 historical Arabic books of hadith. This dataset can be used for further investigation and classification of hadiths (Strong/Weak), and narrators (trustworthy/not) using AI techniques, and also it can be used as a linguistic resource tool for Arabic Natural Language Processing.\n\nOur dataset is collected from online Hadith sources using data scraping and web crawling. The main contribution of this dataset is the extraction of narrator chains that were originally present in textual form within Hadith books. Each observation in the dataset contains complete information about a specific hadith, such as (original book, number, Hadith text, Matn, list of narrators, and the number of narrators).",
    "Added By": "Mohammed Mghari"
}