{
    "Name": "SERAG: Semantic Entity Retrieval from Arabic knowledge Graphs",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/ArabicDEv2",
    "Link": "https://zenodo.org/record/4560653#.YprApXZBxD8",
    "License": "CC BY 4.0",
    "Year": 2021,
    "Language": "ar",
    "Dialect": "Modern Standard Arabic",
    "Domain": [
        "other"
    ],
    "Form": "text",
    "Collection Style": [
        "human annotation"
    ],
    "Description": "This is the dataset used in: \"S. Esmeir, SERAG: Semantic Entity Retrieval from Arabic knowledge Graphs, In: Proceedings of the Sixth Arabic Natural Language Processing Workshop (WANLP 2021) at EACL 2021\".  The dataset is a translation of a subset (139/467) of the queries in DBpedia Entity v2 to Modern Standard Arabic. We used the “stopped” version of DBpedia Entity v2 (queries-v2_stopped.txt).  Please use the query ID to link the translated queries to their English counterparts, and to the relevance judgment files provided with DBpedia Entity v2 (qrels-v2.txt).  DBpedia’s interlingual mapping file (interlanguage_links_ar.ttl.bz2) can be used to map entities from English to Arabic and vice-versa.",
    "Volume": 139.0,
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": [],
    "Derived From": [
        "DBpedia Entity v2"
    ],
    "Paper Title": "SERAG: Semantic Entity Retrieval from Arabic Knowledge Graphs",
    "Paper Link": "https://aclanthology.org/2021.wanlp-1.24/",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "zenodo",
    "Access": "Free",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "entity retrieval"
    ],
    "Venue Title": "ACL",
    "Venue Type": "workshop",
    "Venue Name": "The Sixth Arabic Natural Language Processing Workshop (WANLP 2021),",
    "Authors": [
        "Esmeir Saher"
    ],
    "Affiliations": [
        "Bloomberg L.P"
    ],
    "Abstract": "Knowledge graphs (KGs) are widely used to store and access information about entities and their relationships. Given a query, the task of entity retrieval from a KG aims at presenting a ranked list of entities relevant to the query. Lately, an increasing number of models for entity retrieval have shown a significant improvement over traditional methods. These models, however, were developed for English KGs. In this work, we build on onesuchsystem, named KEWER, to propose SERAG (Semantic Entity Retrieval from Arabic knowledge Graphs). Like KEWER, SERAG uses random walks to generate entity embeddings. DBpedia-Entity v2 is considered the standard test collection for entity retrieval. We discuss the challenges of using it for non-English languages in general and Arabic in particular. We provide an Arabic version of this standard collection, and use it to evaluate SERAG. SERAG is shown to significantly outperform the popular BM25 model thanks to its multi-hop reasoning.",
    "Added By": "Kamel GAANOUN"
}