{
    "Name": "Speech-MASSIVE",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/FBK-MT/Speech-MASSIVE",
    "Link": "https://hf.co/datasets/FBK-MT/Speech-MASSIVE",
    "License": "CC BY-NC-SA 4.0",
    "Year": 2024,
    "Language": "multilingual",
    "Dialect": "Saudi Arabia",
    "Domain": [
        "other"
    ],
    "Form": "text",
    "Collection Style": [
        "other"
    ],
    "Description": "Speech-MASSIVE is a multilingual Spoken Language Understanding (SLU) dataset comprising the speech counterpart for a portion of the MASSIVE textual corpus. Speech-MASSIVE covers 12 languages (Arabic, German, Spanish, French, Hungarian, Korean, Dutch, Polish, European Portuguese, Russian, Turkish, and Vietnamese) from different families and inherits from MASSIVE the annotations for the intent prediction and slot-filling tasks. MASSIVE utterances' labels span 18 domains, with 60 intents and 55 slots. Full train split is provided for French and German, and for all the 12 languages (including French and German), we provide few-shot train, validation, test splits. Few-shot train (115 examples) covers all 18 domains, 60 intents, and 55 slots (including empty slots).",
    "Volume": 2150.0,
    "Unit": "hours",
    "Ethical Risks": "Low",
    "Provider": [
        "Naver Labs"
    ],
    "Derived From": [
        "MASSIVE"
    ],
    "Paper Title": "Speech-MASSIVE: A Multilingual Speech Dataset for SLU and Beyond",
    "Paper Link": "https://arxiv.org/pdf/2408.03900",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "HuggingFace",
    "Access": "Free",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "speech recognition"
    ],
    "Venue Title": "arXiv",
    "Venue Type": "preprint",
    "Venue Name": "",
    "Authors": [],
    "Affiliations": [],
    "Abstract": "We present Speech-MASSIVE, a multilingual Spoken Language Understanding (SLU) dataset comprising the speech counterpart for a portion of the MASSIVE textual corpus. Speech-MASSIVE covers 12 languages from different families and inherits from MASSIVE the annotations for the intent\nprediction and slot-filling tasks. Our extension is prompted by the scarcity of massively multilingual SLU datasets and the growing need for versatile speech datasets to assess foundation models\n(LLMs, speech encoders) across languages and tasks. We provide a multimodal, multitask, multilingual dataset and report SLU baselines using both cascaded and end-to-end architectures in various training scenarios (zero-shot, few-shot, and full fine-tune). Furthermore, we demonstrate the\nsuitability of Speech-MASSIVE for benchmarking other tasks such as speech transcription, language\nidentification, and speech translation. The dataset, models, and code are publicly available at:\nhttps://github.com/hlt-mt/Speech-MASSIVE",
    "Added By": "Zaid Alyafeai"
}