{
    "Name": "Sudanese Dialect tweets about telecommunication companies",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/Sudanese_Dialect_Tweet_Tele",
    "Link": "https://docs.google.com/spreadsheets/d/13fIV8oHss-QRBKN-2h5LYF1i_1O9qH1R/edit?usp=sharing&ouid=101796411348671465142&rtpof=true&sd=true",
    "License": "unknown",
    "Year": 2018,
    "Language": "ar",
    "Dialect": "ar-SD: (Arabic (Sudan))",
    "Domain": "social media",
    "Form": "text",
    "Collection Style": "crawling and annotation(other)",
    "Description": "Sentiment Analysis dataset written in Sudanese Arabic Dialect",
    "Volume": "4,712",
    "Unit": "sentences",
    "Ethical Risks": "High",
    "Provider": "University of Khartoum",
    "Derived From": "nan",
    "Paper Title": "Sentiment Analysis for Arabic Dialect Using Supervised Learning",
    "Paper Link": "https://ieeexplore.ieee.org/document/8515862",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "Gdrive",
    "Access": "Free",
    "Cost": "nan",
    "Test Split": "No",
    "Tasks": "sentiment analysis",
    "Venue Title": "ICCCEEE",
    "Citations": "8.0",
    "Venue Type": "conference",
    "Venue Name": "International Conference on Computer, Control, Electrical, and Electronics Engineering 2018",
    "Authors": "Rua Ismail, Mawada Omer, Mawada Tabir, Noor Mahadi, Izzeldein Amin",
    "Affiliations": "University of Khartoum",
    "Abstract": "Sentiment analysis is a set of procedures used to extract subjective opinions from the text. Generally, there are two techniques for sentiment analysis, machine learning method, and lexicon-based method. This work focuses on extracting and analyzing Twitter data written in Sudanese Arabic dialect to observe opinionated patterns regarding the quality of telecommunication services operating in Sudan. One of the significant limitations in the field of text classification is the exclusive focus on the English language. There is a need to bridge this gap by developing efficient methods and tools for sentiment analysis in the Arabic language. Moreover, reliable corpus and lexicons are needed. For this study, four classifiers were trained on a dataset consist of 4712 tweets. Namely Naïve Bayes, SVM, Multinomial Logistic Regression and K-Nearest Neighbor to conduct a comparative analysis on the performance of the classifiers. These algorithms when ran against the tweets dataset the results revealed that SVM gives the highest F1-score (72.0) while the best accuracy was achieved by KNN (k=2) and it equals to 92.0.",
    "Added By": "Khalid N. Elmadani"
}