{
    "Name": "Synonyms",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://sina.birzeit.edu/synonyms/",
    "License": "CC BY 4.0",
    "Year": 2022,
    "Language": "ar",
    "Dialect": "Modern Standard Arabic",
    "Domain": "other",
    "Form": "text",
    "Collection Style": "manual curation",
    "Description": "A set of 500 synsets (extracted from the Arabic Wordnet). Each synset is enriched with a list of candidate synonyms. The total number is 3K candidates. ",
    "Volume": "300,000",
    "Unit": "tokens",
    "Ethical Risks": "Low",
    "Provider": "SinaLab, Birzeit University",
    "Derived From": "",
    "Paper Title": "A Benchmark and Scoring Algorithm for Enriching Arabic Synonyms",
    "Paper Link": "https://arxiv.org/abs/2302.02232",
    "Script": "Arab-Latn",
    "Tokenized": "No",
    "Host": "SinaLab Resources",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "language modeling, cross-lingual, information retrieval, part of speech tagging",
    "Venue Title": "",
    "Citations": "",
    "Venue Type": "",
    "Venue Name": "",
    "Authors": "Sana Ghanem, Mustafa Jarrar, Radi Jarrar, Ibrahim Bounhas",
    "Affiliations": "",
    "Abstract": "This paper addresses the task of extending a given synset with additional synonyms taking into account synonymy strength as a fuzzy value. Given a mono/multilingual synset and a threshold (a fuzzy value [0 − 1]), our goal is to extract new synonyms above this threshold from existing lexicons. We present twofold contributions: an algorithm and a benchmark dataset. The dataset consists of 3K candidate synonyms for 500 synsets. Each candidate synonym is annotated with a fuzzy value by four linguists. The dataset is important for (i) understanding how much linguists (dis/)agree on synonymy, in addition to (ii) using the dataset as a baseline to evaluate our algorithm. Our proposed algorithm extracts synonyms from existing lexicons and computes a fuzzy value for each candidate. Our evaluations show that the algorithm behaves like a linguist and its fuzzy values are close to those proposed by linguists (using RMSE and MAE).  The dataset and a demo page are publicly available at https://portal.sina.birzeit.edu/synonyms. ",
    "Added By": "Tymaa Hammouda"
}