{
    "Name": "TArC",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/TArC",
    "Link": "https://github.com/eligugliotta/tarc",
    "License": "unknown",
    "Year": 2020,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": "social media",
    "Form": "text",
    "Collection Style": "crawling,annotation",
    "Description": "flexible and multi-purpose open corpus in order to be a useful support for different types of analyses: computational and linguistics, as well as for NLP tools training",
    "Volume": "4,790",
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": "Stanford University",
    "Derived From": "",
    "Paper Title": "TArC: Incrementally and Semi-Automatically Collecting a Tunisian\r\nArabish Corpus\r",
    "Paper Link": "https://aclanthology.org/2020.lrec-1.770.pdf",
    "Script": "Arab-Latn",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "transliteration",
    "Venue Title": "LREC",
    "Citations": "2.0",
    "Venue Type": "conference",
    "Venue Name": "International Conference on Language Resources and Evaluation",
    "Authors": "Elisa Gugliotta,Marco Dinarelli",
    "Affiliations": ",",
    "Abstract": "This article describes the constitution process of the first morpho-syntactically annotated Tunisian Arabish Corpus (TArC). Arabish, also known as Arabizi, is a spontaneous coding of Arabic dialects in Latin characters and “arithmographs” (numbers used as letters). This code-system was developed by Arabic-speaking users of social media in order to facilitate the writing in the Computer-Mediated Communication (CMC) and text messaging informal frameworks. Arabish differs for each Arabic dialect and each Arabish code-system is under-resourced, in the same way as most of the Arabic dialects. In the last few years, the attention of NLP studies on Arabic dialects has considerably increased. Taking this into consideration, TArC will be a useful support for different types of analyses, computational and linguistic, as well as for NLP tools training. In this article we will describe preliminary work on the TArC semi-automatic construction process and some of the first analyses we developed on TArC. In addition, in order to provide a complete overview of the challenges faced during the building process, we will present the main Tunisian dialect characteristics and its encoding in Tunisian Arabish.",
    "Added By": ""
}