{
    "Name": "The Arabic Speech Corpus for Isolated Words",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/Speech_Corpus_for_Isolated_Words",
    "Link": "https://www.cs.stir.ac.uk/~lss/arabic/",
    "License": "unknown",
    "Year": 2014,
    "Language": "ar",
    "Dialect": "ar-MSA: (Arabic (Modern Standard Arabic))",
    "Domain": "transcribed audio",
    "Form": "spoken",
    "Collection Style": "manual curation",
    "Description": "The Arabic speech corpus for isolated words contains 9992 utterances of 20 words spoken by 50 native male Arabic speakers. It has been recorded with a 44100 Hz sampling rate and 16-bit resolution. This corpus is free for noncommercial uses in the raw format (.wav files) and other formats e.g. (MFCCs) are available under request.",
    "Volume": "9,992",
    "Unit": "tokens",
    "Ethical Risks": "Low",
    "Provider": "University of Stirling",
    "Derived From": "nan",
    "Paper Title": "On Improving the Classification Capability of Reservoir Computing for Arabic Speech Recognition",
    "Paper Link": "https://www.cs.stir.ac.uk/~lss/recentpapers/icann2014AlalshekmubarakSmith.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "other",
    "Access": "Free",
    "Cost": "nan",
    "Test Split": "No",
    "Tasks": "speech recognition ",
    "Venue Title": "nan",
    "Citations": "nan",
    "Venue Type": "preprint",
    "Venue Name": "nan",
    "Authors": "Abdulrahman Alalshekmubarak, Leslie S. Smith",
    "Affiliations": "University of Stirling",
    "Abstract": "Designing noise-resilient systems is a major challenge in the\nfield of automated speech recognition (ASR). These systems are crucial\nfor real-world applications where high levels of noise tend to be present.\nWe introduce a noise robust system based on Echo State Networks and\nExtreme Kernel machines which we call ESNEKM. To evaluate the performance of the proposed system, we used our recently released public\nArabic speech dataset and the well-known spoken Arabic digits (SAD)\ndataset. Different feature extraction methods considered in this study\ninclude mel-frequency cepstral coefficients (MFCCs), perceptual linear\nprediction (PLP) and RASTA- perceptual linear prediction. These extracted features were fed to the ESNEKM and the result compared with\na baseline hidden Markov model (HMM), so that nine models were compared in total. ESNEKM models outperformed HMM models under all\nthe feature extraction methods, noise levels, and noise types. The best\nperformance was obtained by the model that combined RASTA-PLP\nwith ESNEKM.",
    "Added By": "Zaid Alyafeai"
}