{
    "Name": "TSAC",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/TSAC",
    "Link": "https://github.com/fbougares/TSAC",
    "License": "LGPL-3.0",
    "Year": 2017,
    "Language": "ar",
    "Dialect": "Tunisia",
    "Domain": "social media",
    "Form": "text",
    "Collection Style": "crawling and annotation(other)",
    "Description": "About 17k user comments manually annotated to positive and negative polarities. This corpus is collected from Facebook users comments written on official pages of Tunisian radios and TV channels",
    "Volume": "17,000",
    "Unit": "sentences",
    "Ethical Risks": "Medium",
    "Provider": "Vienna",
    "Derived From": "",
    "Paper Title": "Sentiment Analysis of Tunisian Dialect:\nLinguistic Resources and Experiments",
    "Paper Link": "https://aclanthology.org/W17-1307.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": "Yes",
    "Tasks": "sentiment analysis",
    "Venue Title": "WANLP",
    "Citations": "59.0",
    "Venue Type": "workshop",
    "Venue Name": "Arabic Natural Language Processing Workshop",
    "Authors": "Salima Medhaffar,Fethi Bougares,Y. Estève,L. Belguith",
    "Affiliations": ",,,",
    "Abstract": "Dialectal Arabic (DA) is significantly different from the Arabic language taught in schools and used in written communication and formal speech (broadcast news, religion, politics, etc.). There are many existing researches in the field of Arabic language Sentiment Analysis (SA); however, they are generally restricted to Modern Standard Arabic (MSA) or some dialects of economic or political interest. In this paper we are interested in the SA of the Tunisian Dialect. We utilize Machine Learning techniques to determine the polarity of comments written in Tunisian Dialect. First, we evaluate the SA systems performances with models trained using freely available MSA and Multi-dialectal data sets. We then collect and annotate a Tunisian Dialect corpus of 17.000 comments from Facebook. This corpus allows us a significant accuracy improvement compared to the best model trained on other Arabic dialects or MSA data. We believe that this first freely available corpus will be valuable to researchers working in the field of Tunisian Sentiment Analysis and similar areas.",
    "Added By": ""
}