{
    "Name": "TUFS Media",
    "Subsets": [],
    "HF Link": "",
    "Link": "http://ngc2068.tufs.ac.jp/tufsmedia-corpus/",
    "License": "unknown",
    "Year": 2018,
    "Language": "multilingual",
    "Dialect": "Modern Standard Arabic",
    "Domain": "news articles",
    "Form": "text",
    "Collection Style": "crawling and annotation(translation)",
    "Description": "a parallel corpus of translated news articles collected at Tokyo University of Foreign Studies (TUFS)",
    "Volume": "8,652",
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": "Tokyo University",
    "Derived From": "",
    "Paper Title": "A Parallel Corpus of Arabic–Japanese News Articles\n",
    "Paper Link": "https://aclanthology.org/L18-1147.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "other",
    "Access": "Upon-Request",
    "Cost": "",
    "Test Split": "Yes",
    "Tasks": "machine translation",
    "Venue Title": "LREC",
    "Citations": "9.0",
    "Venue Type": "conference",
    "Venue Name": "International Conference on Language Resources and Evaluation",
    "Authors": "Go Inoue,Nizar Habash,Yuji Matsumoto,Hiroyuki Aoyama",
    "Affiliations": "New York University;New York University Abu Dhabi,,,",
    "Abstract": "Much work has been done on machine translation between major language pairs including Arabic–English and English–Japanese thanks to the availability of large-scale parallel corpora with manually verified subsets of parallel sentences. However, there has been little research conducted on the Arabic–Japanese language pair due to its parallel-data scarcity, despite being a good example of interestingly contrasting differences in typology. In this paper, we describe the creation process and statistics of the Arabic–Japanese portion of the TUFS Media Corpus, a parallel corpus of translated news articles collected at Tokyo University of Foreign Studies (TUFS). Part of the corpus is manually aligned at the sentence level for development and testing. The corpus is provided in two formats: A document-level parallel corpus in XML format, and a sentence-level parallel corpus in plain text format. We also report the first results of Arabic– Japanese phrase-based machine translation trained on our corpus.",
    "Added By": ""
}