{
    "Name": "Tunisian Arabic Corpus",
    "Subsets": [],
    "HF Link": "",
    "Link": "http://www.tunisiya.org/",
    "License": "unknown",
    "Year": 2010,
    "Language": "ar",
    "Dialect": "Tunisia",
    "Domain": [
        "web pages"
    ],
    "Form": "text",
    "Collection Style": [
        "crawling"
    ],
    "Description": "There are currently 2,874 texts in the corpus, comprising 1,088,614 words. The top categories currently included are displayed below. As you can see, the internet sources are currently dominant",
    "Volume": 2874.0,
    "Unit": "documents",
    "Ethical Risks": "Low",
    "Provider": [],
    "Derived From": [],
    "Paper Title": "Tunisian Arabic Corpus: Creating a written corpus of an \" unwritten \" language",
    "Paper Link": "https://www.academia.edu/28966672/Tunisian_Arabic_Corpus_Creating_a_written_corpus_of_an_unwritten_language",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "other",
    "Access": "Free",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "morphological analysis"
    ],
    "Venue Title": "",
    "Venue Type": "preprint",
    "Venue Name": "",
    "Authors": [
        "Karen McNeil"
    ],
    "Affiliations": [
        "Edinburgh University"
    ],
    "Abstract": "Because of the many varieties of Arabic, there can never be ‘one’ authoritative corpus of the language. To achieve the best results for language-learning resources and natural language processing, corpora for both the standard language and the spoken varieties are needed. To this end, the Tunisian Arabic Corpus (TAC) is a project, led by Karen McNeil and Miled Faiza, seeking to build a four-million-word corpus of Tunisian Spoken Arabic. There are many challenges to creating Arabic corpora, and dialectal corpora in particular, including those of sources, balance, and parsing. The corpus currently consists only of about 881,000 words, and issues of balance and parsing have not been completely solved. Nonetheless, the corpus has proved to be a useful resource to Arabic students and researchers, and also presents a model for others who wish to create dialectal Arabic corpora.",
    "Added By": "Zaid Alyafeai"
}