{
    "Name": "Twifil ",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/arbml/Twifil",
    "Link": "https://github.com/kinmokusu/oea_algd",
    "License": "unknown",
    "Year": 2020,
    "Language": "ar",
    "Dialect": "Algeria",
    "Domain": "social media",
    "Form": "text",
    "Collection Style": "crawling,annotation",
    "Description": "An Algerian dialect dataset annotated for both sentiment (9,000 tweets), emotion (about 5,000 tweets) and extra-linguistic information including author profiling (age and gender)",
    "Volume": "14,000",
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": "",
    "Derived From": "",
    "Paper Title": "An Algerian Corpus and an Annotation Platform for Opinion and Emotion Analysis",
    "Paper Link": "https://aclanthology.org/2020.lrec-1.151.pdf",
    "Script": "Arab-Latin",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "sentiment analysis, emotion detection",
    "Venue Title": "LREC",
    "Citations": "14.0",
    "Venue Type": "conference",
    "Venue Name": "Language Resources and Evaluation Conference",
    "Authors": "Leila Moudjari, Karima Akli-Astouati, Farah Benamara",
    "Affiliations": "",
    "Abstract": "In this paper, we address the lack of resources for opinion and emotion analysis related to North African dialects, targeting Algerian dialect. We present TWIFIL (TWItter proFILing) a collaborative annotation platform for crowdsourcing annotation of tweets at different levels of granularity. The plateform allowed the creation of the largest Algerian dialect dataset annotated for both sentiment (9,000 tweets), emotion (about 5,000 tweets) and extra-linguistic information including author profiling (age and gender). The annotation resulted also in the creation of the largest Algerien dialect subjectivity lexicon of about 9,000 entries which can constitute a valuable resources for the development of future NLP applications for Algerian dialect. To test the validity of the dataset, a set of deep learning experiments were conducted to classify a given tweet as positive, negative or neutral. We discuss our results and provide an error analysis to better identify classification errors.",
    "Added By": "Abderrahmane Issam"
}