{
    "Name": "Twitter Arabic Image Spam",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://data.mendeley.com/datasets/gfc32vndz8/2",
    "License": "CC BY 4.0",
    "Year": 2019,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": [
        "social media"
    ],
    "Form": "images",
    "Collection Style": [
        "crawling",
        "human annotation"
    ],
    "Description": "Images with Arabic embedded text collected from Twitter for spam detection research",
    "Volume": 300.0,
    "Unit": "images",
    "Ethical Risks": "High",
    "Provider": [
        "University of York"
    ],
    "Derived From": [],
    "Paper Title": "Detecting Spam Images with Embedded Arabic Text in Twitter",
    "Paper Link": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8892954",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "Mendeley Data",
    "Access": "Free",
    "Cost": "",
    "Test Split": true,
    "Tasks": [
        "spam detection"
    ],
    "Venue Title": "ICDARW",
    "Venue Type": "workshop",
    "Venue Name": "International Conference on Document Analysis and Recognition",
    "Authors": [
        "Niddal Imam",
        "Vassilios G. Vassilakis"
    ],
    "Affiliations": [],
    "Abstract": "Detecting image-based spam in Online Social\nNetworks (OSNs), such as Facebook and Twitter, is an ongoing\nproblem. Spam is prevalent in all forms of online\ncommunication (such as email and the web) However,\nresearchers’ and practitioners’ attention has increasingly\nshifted to spam in OSNs, due to the growing number of\nspammers and the possible negative effects on users. There are\ndifferent types of spam messages that can be found in OSNs.\nSpam images, which are images embedded with malicious text,\nare one of the most difficult types of spam to tackle. Processing\nimages overwhelms classifiers and affects detection\nperformance. Consequently, spammers take advantage of this\nissue to launch more sophisticated attacks, such as evasion\nattacks. After observing some Arabic trending hashtags and\ntopics in Twitter, a substantial amount of image-based spam was\nfound. Thus, this paper proposes an approach for detecting\nimage-based spam with Arabic text in Twitter through using\nDeep Learning (DL) techniques. In this paper, an Efficient and\nAccurate Scene Text Detector (EAST) and Convolutional\nRecurrent Neural Network (CRNN) models were used for text\ndetection and text recognition. After the text extraction step, a\nblacklist and whitelist approach was applied for classifying text\nas either spam or non-spam. The proposed text classification\ntechnique is adaptable and robust against some text\nclassification attacks.",
    "Added By": "Zaid Alyafeai"
}
