{
    "Name": "TYDIQA",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/google-research-datasets/tydiqa",
    "Link": "https://github.com/google-research-datasets/tydiqa",
    "License": "Apache-2.0",
    "Year": 2020,
    "Language": "multilingual",
    "Dialect": "Modern Standard Arabic",
    "Domain": [
        "other"
    ],
    "Form": "text",
    "Collection Style": [
        "crawling"
    ],
    "Description": "question answering dataset covering 11 typologically diverse languages with 200K question-answer pairs",
    "Volume": 25893.0,
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": [
        "Google"
    ],
    "Derived From": [],
    "Paper Title": "TYDI QA: A Benchmark for Information-Seeking Question Answering in Typologically Diverse Languages",
    "Paper Link": "https://storage.googleapis.com/tydiqa/tydiqa.pdf",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": true,
    "Tasks": [
        "question answering"
    ],
    "Venue Title": "TACL",
    "Venue Type": "journal",
    "Venue Name": "Transactions of the Association for Computational Linguistics",
    "Authors": [
        "J. Clark",
        "Eunsol Choi",
        "Michael Collins",
        "Dan Garrette",
        "T. Kwiatkowski",
        "Vitaly Nikolaev",
        "Jennimaria Palomaki"
    ],
    "Affiliations": [
        "Google Research"
    ],
    "Abstract": "Abstract Confidently making progress on multilingual modeling requires challenging, trustworthy evaluations. We present TyDi QA—a question answering dataset covering 11 typologically diverse languages with 204K question-answer pairs. The languages of TyDi QA are diverse with regard to their typology—the set of linguistic features each language expresses—such that we expect models performing well on this set to generalize across a large number of the world’s languages. We present a quantitative analysis of the data quality and example-level qualitative linguistic analyses of observed language phenomena that would not be found in English-only corpora. To provide a realistic information-seeking task and avoid priming effects, questions are written by people who want to know the answer, but don’t know the answer yet, and the data is collected directly in each language without the use of translation.",
    "Added By": "Zaid Alyafeai"
}