{
    "Name": "wikiann",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/unimelb-nlp/wikiann",
    "Link": "https://drive.google.com/drive/folders/1Q-xdT99SeaCghihGa7nRkcXGwRGUIsKN",
    "License": "unknown",
    "Year": 2017,
    "Language": "multilingual",
    "Dialect": "Modern Standard Arabic",
    "Domain": "wikipedia",
    "Form": "text",
    "Collection Style": "crawling and annotation(other)",
    "Description": " Both name tagging and linking results for 282 languages are promising on Wikipedia data and on-Wikipedia\r\ndata",
    "Volume": "185,000",
    "Unit": "tokens",
    "Ethical Risks": "Low",
    "Provider": "Multiple Institutions",
    "Derived From": "",
    "Paper Title": "Cross-lingual Name Tagging and Linking for 282 Languages\r",
    "Paper Link": "https://aclanthology.org/P17-1178.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "Gdrive",
    "Access": "Free",
    "Cost": "",
    "Test Split": "Yes",
    "Tasks": "named entity recognition",
    "Venue Title": "ACL",
    "Citations": "168.0",
    "Venue Type": "conference",
    "Venue Name": "Assofications of computation linguisitcs",
    "Authors": "Xiaoman Pan,Boliang Zhang,Jonathan May,J. Nothman,Kevin Knight,Heng Ji",
    "Affiliations": ",,,,,",
    "Abstract": "The ambitious goal of this work is to develop a cross-lingual name tagging and linking framework for 282 languages that exist in Wikipedia. Given a document in any of these languages, our framework is able to identify name mentions, assign a coarse-grained or fine-grained type to each mention, and link it to an English Knowledge Base (KB) if it is linkable. We achieve this goal by performing a series of new KB mining methods: generating “silver-standard” annotations by transferring annotations from English to other languages through cross-lingual links and KB properties, refining annotations through self-training and topic selection, deriving language-specific morphology features from anchor links, and mining word translation pairs from cross-lingual links. Both name tagging and linking results for 282 languages are promising on Wikipedia data and on-Wikipedia data.",
    "Added By": "Zaid Alyafeai"
}