{
    "Name": "WILDCHAT",
    "Subsets": [],
    "HF Link": "https://huggingface.co/datasets/allenai/WildChat-1M",
    "Link": "https://wildchat.allen.ai",
    "License": "ODC-By",
    "Year": 2024,
    "Language": "multilingual",
    "Dialect": "Modern Standard Arabic",
    "Domain": [
        "other"
    ],
    "Form": "text",
    "Collection Style": [
        "manual curation",
        "human annotation"
    ],
    "Description": "One million user-ChatGPT interaction logs collected with explicit consent, featuring multi-turn multilingual conversations enriched with demographic metadata for studying real-world chatbot usage.",
    "Volume": 11919.0,
    "Unit": "sentences",
    "Ethical Risks": "High",
    "Provider": [
        "Allen Institute for Artificial Intelligence"
    ],
    "Derived From": [],
    "Paper Title": "WILDCHAT: 1M ChatGPT Interaction Logs in the Wild",
    "Paper Link": "https://arxiv.org/pdf/2405.01470",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "HuggingFace",
    "Access": "Free",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "instruction tuning"
    ],
    "Venue Title": "ICLR",
    "Venue Type": "conference",
    "Venue Name": "International Conference on Learning Representations",
    "Authors": [
        "Wenting Zhao",
        "Xiang Ren",
        "Jack Hessel",
        "Claire Cardie",
        "Yejin Choi",
        "Yuntian Deng"
    ],
    "Affiliations": [
        "Cornell University",
        "Allen Institute for Artificial Intelligence",
        "University of Southern California",
        "University of Washington"
    ],
    "Abstract": "Chatbots such as GPT-4 and ChatGPT are now serving millions of users. Despite their widespread use, there remains a lack of public datasets showcasing how these tools are used by a population of users in practice. To bridge this gap, we offered free access to ChatGPT for online users in exchange for their affirmative, consensual opt-in to anonymously collect their chat transcripts and request headers. From this, we compiled WildChat, a corpus of 1 million user-ChatGPT conversations, which consists of over 2.5 million interaction turns. We compare WildChat with other popular user-chatbot interaction datasets, and find that our dataset offers the most diverse user prompts, contains the largest number of languages, and presents the richest variety of potentially toxic use-cases for researchers to study. In addition to timestamped chat transcripts, we enrich the dataset with demographic data, including state, country, and hashed IP addresses, alongside request headers. This augmentation allows for more detailed analysis of user behaviors across different geographical regions and temporal dimensions. Finally, because it captures a broad range of use cases, we demonstrate the dataset's potential utility in fine-tuning instruction-following models. WildChat is released at this https URL under AI2 ImpACT Licenses.\n",
    "Added By": "Zaid Alyafeai"
}