{
    "Name": "WojoodGaza",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://sina.birzeit.edu/wojood/",
    "License": "CC BY 4.0",
    "Year": 2024,
    "Language": "ar",
    "Dialect": "mixed",
    "Domain": [
        "news articles"
    ],
    "Form": "text",
    "Collection Style": [
        "crawling"
    ],
    "Description": "It is an extestion of Wojood. It is about the ongoing Israeli War on Gaza, based on the assumption that discourse about recent global events will involve mentions from different data distributions. The dataset is collected from five news domains related to the War (Health, Economics, Finance, Politics, and Law). It consists of 60k tokens, divided into a test set (50k) and a development set (10k), with the domains evenly distributed.y. It is manually annotated with fine-grained named entities, following the same annotation guidelines as WojoodFine.",
    "Volume": 60000.0,
    "Unit": "tokens",
    "Ethical Risks": "Low",
    "Provider": [
        "SinaLab",
        "Birzeit University"
    ],
    "Derived From": [],
    "Paper Title": "WojoodNER 2024: The Second Arabic Named Entity Recognition Shared Task.",
    "Paper Link": "https://arxiv.org/pdf/2407.09936",
    "Script": "Arab-Latin",
    "Tokenized": true,
    "Host": "CAMeL Resources",
    "Access": "Free",
    "Cost": "",
    "Test Split": true,
    "Tasks": [
        "language modeling",
        "tokenization",
        "named entity recognition"
    ],
    "Venue Title": "arXiv",
    "Venue Type": "preprint",
    "Venue Name": "arXiv",
    "Authors": [
        "Mustafa Jarrar",
        "Nagham Hamad",
        "Mohammed Khalilia",
        "Bashar Talafha",
        "AbdelRahim Elmadany",
        "Muhammad Abdul-Mageed"
    ],
    "Affiliations": [
        "Birzeit University, Palestine",
        "The University of British Columbia",
        "Mohamed bin Zayed University of Artificial Intelligence"
    ],
    "Abstract": "We present WojoodNER-2024, the second Arabic Named Entity Recognition (NER) Shared Task. In WojoodNER-2024, we focus on fine-grained Arabic NER. We provided participants with a new Arabic fine-grained NER dataset called wojoodfine, annotated with subtypes of entities. WojoodNER-2024 encompassed three subtasks: (i) Closed-Track Flat Fine-Grained NER, (ii) Closed-Track Nested Fine-Grained NER, and (iii) an Open-Track NER for the Israeli War on Gaza. A total of 43 unique teams registered for this shared task. Five teams participated in the Flat Fine-Grained Subtask, among which two teams tackled the Nested Fine-Grained Subtask and one team participated in the Open-Track NER Subtask. The winning teams achieved F-1 scores of 91% and 92% in the Flat Fine-Grained and Nested Fine-Grained Subtasks, respectively. The sole team in the Open-Track Subtask achieved an F-1 score of 73.7%.",
    "Added By": "Tymaa Hammouda"
}