{
    "Name": "XL-HeadTags",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/faisaltareque/XL-HeadTags",
    "Link": "https://hf.co/datasets/faisaltareque/XL-HeadTags",
    "License": "CC BY-SA 4.0",
    "Year": 2024,
    "Language": "multilingual",
    "Dialect": "Modern Standard Arabic",
    "Domain": [
        "news articles"
    ],
    "Form": "text",
    "Collection Style": [
        "crawling"
    ],
    "Description": "We provide XL-HeadTags, a large-scale news headline and tags generation dataset. The dataset consists of 20 languages across six diverse language families. It contains 415K news headline-article pairs with auxiliary information such as image captions, topic words",
    "Volume": 6922.0,
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": [],
    "Derived From": [],
    "Paper Title": "XL-HeadTags: Leveraging Multimodal Retrieval Augmentation for the Multilingual Generation of News Headlines and Tags",
    "Paper Link": "https://aclanthology.org/2024.findings-acl.771.pdf",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "HuggingFace",
    "Access": "Free",
    "Cost": "",
    "Test Split": false,
    "Tasks": [
        "title generation"
    ],
    "Venue Title": "ACL Findings",
    "Venue Type": "conference",
    "Venue Name": "Findings of Associations of computation linguistics",
    "Authors": [],
    "Affiliations": [],
    "Abstract": "Millions of news articles published online daily\ncan overwhelm readers. Headlines and entity\n(topic) tags are essential for guiding readers to\ndecide if the content is worth their time. While\nheadline generation has been extensively studied, tag generation remains largely unexplored,\nyet it offers readers better access to topics of\ninterest. The need for conciseness in capturing\nreaders’ attention necessitates improved content selection strategies for identifying salient\nand relevant segments within lengthy articles,\nthereby guiding language models effectively.\nTo address this, we propose to leverage auxiliary information such as images and captions\nembedded in the articles to retrieve relevant sentences and utilize instruction tuning with variations to generate both headlines and tags for\nnews articles in a multilingual context. To make\nuse of the auxiliary information, we have compiled a dataset named XL-HeadTags, which\nincludes 20 languages across 6 diverse language families. Through extensive evaluation,\nwe demonstrate the effectiveness of our plugand-play multimodal-multilingual retrievers for\nboth tasks. Additionally, we have developed a\nsuite of tools for processing and evaluating multilingual texts, significantly contributing to the\nresearch community by enabling more accurate\nand efficient analysis across languages",
    "Added By": "Zaid Alyafeai"
}