{
    "Name": "xlel_wd_dictionary",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/adithya7/xlel_wd_dictionary",
    "Link": "https://hf.co/datasets/adithya7/xlel_wd_dictionary",
    "License": "CC BY 4.0",
    "Year": 2022,
    "Language": "multilingual",
    "Dialect": "ar-CLS: (Arabic (Classic))",
    "Domain": "wikipedia",
    "Form": "text",
    "Collection Style": "crawling",
    "Description": "XLEL-WD is a multilingual event linking dataset. This supplementary dataset contains a dictionary of event items from Wikidata. The descriptions for Wikidata event items are taken from the corresponding multilingual Wikipedia articles.",
    "Volume": "114,834",
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": "Carnegie Mellon University",
    "Derived From": "",
    "Paper Title": "Multilingual Event Linking to Wikidata",
    "Paper Link": "https://arxiv.org/pdf/2204.06535.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "HuggingFace",
    "Access": "Free",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "event linking",
    "Venue Title": "",
    "Citations": "",
    "Venue Type": "",
    "Venue Name": "",
    "Authors": "Adithya Pratapa, Rishubh Gupta, Teruko Mitamura",
    "Affiliations": "Carnegie Mellon University",
    "Abstract": "We present a task of multilingual linking of events to a knowledge base. We automatically compile a large-scale dataset for this task, comprising of 1.8M mentions across 44 languages referring to over 10.9K events from Wikidata. We propose two variants of the event linking task: 1) multilingual, where event descriptions are from the same language as the mention, and 2) crosslingual, where all event descriptions are in English. On the two proposed tasks, we compare multiple event linking systems including BM25+ (Lv and Zhai, 2011) and multilingual adaptations of the biencoder and crossencoder architectures from BLINK (Wu et al., 2020). In our experiments on the two task variants, we find both biencoder and crossencoder models significantly outperform the BM25+ baseline. Our results also indicate that the crosslingual task is in general more challenging than the multilingual task. To test the out-of-domain generalization of the proposed linking systems, we additionally create a Wikinews-based evaluation set. We present qualitative analysis highlighting various aspects captured by the proposed dataset, including the need for temporal reasoning over context and tackling diverse event descriptions across languages.",
    "Added By": "Khalid N. Elmadani"
}