{
    "Name": "XNLI",
    "Subsets": [],
    "HF Link": "https://hf.co/datasets/facebook/xnli",
    "Link": "https://github.com/facebookresearch/XNLI",
    "License": "CC BY-NC 4.0",
    "Year": 2018,
    "Language": "multilingual",
    "Dialect": "Modern Standard Arabic",
    "Domain": "other",
    "Form": "text",
    "Collection Style": "crawling,other",
    "Description": "Evaluation set for NLI by extending the development and test sets of the Multi-Genre Natural Language Inference Corpus (MultiNLI) to 15 languages",
    "Volume": "7,500",
    "Unit": "sentences",
    "Ethical Risks": "Low",
    "Provider": "",
    "Derived From": "MultiNLI",
    "Paper Title": "XNLI: Evaluating Cross-lingual Sentence Representations",
    "Paper Link": "https://arxiv.org/pdf/1809.05053.pdf",
    "Script": "Arab",
    "Tokenized": "No",
    "Host": "GitHub",
    "Access": "Free",
    "Cost": "",
    "Test Split": "Yes",
    "Tasks": "natural language inference",
    "Venue Title": "arXiv",
    "Citations": "354.0",
    "Venue Type": "preprint",
    "Venue Name": "",
    "Authors": "Alexis Conneau,Guillaume Lample,Ruty Rinott,Adina Williams,Samuel R. Bowman,Holger Schwenk,Veselin Stoyanov",
    "Affiliations": ",,,Facebook AI Research,New York University,,",
    "Abstract": "State-of-the-art natural language processing systems rely on supervision in the form of annotated data to learn competent models. These models are generally trained on data in a single language (usually English), and cannot be directly used beyond that language. Since collecting data in every language is not realistic, there has been a growing interest in cross-lingual language understanding (XLU) and low-resource cross-language transfer. In this work, we construct an evaluation set for XLU by extending the development and test sets of the Multi-Genre Natural Language Inference Corpus (MultiNLI) to 14 languages, including low-resource languages such as Swahili and Urdu. We hope that our dataset, dubbed XNLI, will catalyze research in cross-lingual sentence understanding by providing an informative standard evaluation task. In addition, we provide several baselines for multilingual sentence understanding, including two based on machine translation systems, and two that use parallel data to train aligned multilingual bag-of-words and LSTM encoders. We find that XNLI represents a practical and challenging evaluation suite, and that directly translating the test data yields the best performance among available baselines.",
    "Added By": "Zaid Alyafeai"
}