{
    "Name": "ZAEBUC",
    "Subsets": [],
    "HF Link": "",
    "Link": "https://sites.google.com/view/zaebuc/home",
    "License": "CC BY-NC 4.0",
    "Year": 2022,
    "Language": "multilingual",
    "Dialect": "Modern Standard Arabic",
    "Domain": "other",
    "Form": "text",
    "Collection Style": "manual curation",
    "Description": "the corpus is an annotated Arabic-English bilingual writer corpus comprising short essays by first-year university students at Zayed University in the United Arab Emirates.",
    "Volume": "33,300",
    "Unit": "tokens",
    "Ethical Risks": "Medium",
    "Provider": "NYU Abu Dhabi, Zayed University, UAE",
    "Derived From": "",
    "Paper Title": "ZAEBUC: An annotated Arabic-English bilingual writer corpus",
    "Paper Link": "http://www.lrec-conf.org/proceedings/lrec2022/pdf/2022.lrec-1.9.pdf",
    "Script": "Latn",
    "Tokenized": "Yes",
    "Host": "other",
    "Access": "Upon-Request",
    "Cost": "",
    "Test Split": "No",
    "Tasks": "language modeling, language identification, morphological analysis, text error analysis",
    "Venue Title": "LREC",
    "Citations": "",
    "Venue Type": "conference",
    "Venue Name": "European Language Resources Association (ELRA)",
    "Authors": "Nizar Habash, David Palfreyman",
    "Affiliations": "New York University Abu Dhabi, Abu Dhabi, UAE,  Zayed University, Abu Dhabi, UAE",
    "Abstract": "We present ZAEBUC, an annotated Arabic-English bilingual writer corpus comprising short essays by first-year university students at Zayed University in the United Arab Emirates. We describe and discuss the various guidelines and pipeline processes we followed to create the annotations and quality check them. The annotations include spelling and grammar correction, morphological tokenization, Part-of-Speech tagging, lemmatization, and Common European Framework of Reference (CEFR) ratings. All of the annotations are done on Arabic and English texts using consistent guidelines as much as possible, with tracked alignments among the different annotations, and to the original raw texts. For morphological tokenization, POS tagging, and lemmatization, we use existing automatic annotation tools followed by manual correction. We also present various measurements and correlations with preliminary insights drawn from the data and annotations. The publicly available ZAEBUC corpus and its annotations are intended to be the stepping stones for additional annotations.",
    "Added By": "Jezia Zakraoui"
}